[
    "哈囉 哈囉 時間 過得 快 不知不覺 2022 鐵人 賽 我要 參賽 • ̀ ㅂ • ́ و 還在 想要 做 內容 想 有沒有 推薦 想 主題 想 去年 作品 逛逛 給我 建議 罷拖罷 拖",
    "這次 鐵人 賽 完有 出書 廠商 想要 協助 我出 教學 書 想 一陣子 答應 合約 內容 詳細 想 這問 碰 STM32 學習 管道 市面 STM32 書籍 缺少 沒有碰過 STM32 朋友 說 說 想法 打算 出 一本 適合 入門 偏 進階 內容 這屆 鐵人 賽 更 詳細 完整 撰寫 會 從無到有 STM32 開發 版 製作 底層 暫存器 操作 原理 標準 庫 開發 簡單 實例 這裡會 詳細 步驟 搭配 數據 手冊 參考手冊 發現 市面上 STM32 教學 書 沒 分析 手冊 查找 解說 書 沒錯 做 手冊 一頁 想法 說 寫 一本 厚重 書籍 開發 過程 講解 搭配 數據 手冊 參考手冊 做 解析 做 內容 但讀 會 底子 很多 想法 延伸 會 有人 想 想 聽聽 想法 問 說不定 我會 想到 編寫 教學 書籍 內容 想法 寫 1 2 章 1 萬多個 字 標準 庫 開發 流程 知識 交代 詳細 提到 手冊 重點 目錄 1 章 做 一塊 開發板 1.1 STM32 1.2 STM32 開發板 製作 2 章 暫存器 開發 2.1 暫存器 映射 2.2 STM32 GPIO 介紹 2.3 開發 環境 創建 Keil5 2.4 操作 暫存器 控制 LED 閃爍 講解 2.5 隨便 截 幾章 暫存器 章節 內容",
    "系列 發表 本頁 後記 喔 iThome 呼 總算 地盤 發表 完整 內容 實際上 內容 當初 有計畫 寫 好像 不算 完整 內容 翻看 內容 發現 不算 太 精確 太 算是 嚴重錯誤 部份 反正 這次 沒 修改 XD 近期 工作 規劃 相關 驗證 授權 內容 學習 不少 提供 高可用性 服務 HA 反向 代理 負載平衡 Load Balance 熔斷器 Circuit Breaker 服務 探索 Service Discovery 回來 Keycloak 接觸 14 15 版 18 版 釋出 大概 理解 CIBA 流程 運作 方式 很酷 WebAuthN FIDO Kerberos Client Authenication x509 進一步 了解 Cookie 存儲 方式 更 儲存 資訊 -- 儲存 access token refresh token 接觸 很多 新鮮 有趣 相關 事情 會來 規劃 授權 管理 服務",
    "Media Query 講到 快 爛掉 搭配 Grid 說 實在話 不好 做 地方 Grid 方格 系統 撇開 Float Position Flexbox 那種 流向 思維 這是 令人 苦惱 像是 打開 Grid 預設 關閉 揪 竟 人會 打開 ... Grid RWD 盲點 困難 的點 在於 數 三聲 數 四聲 複習 RWD 事情 先 複習 Grid 定義 方式 彈性 單位 Grid 尺寸 底下 會 彈性 4x4 網格 系統 內 很棒 很棒 全家 很棒 網格 系統 彈性 尺寸 設定 尺寸 會 保有 最小 空間 min content 設計 排版 來說 未必 一件 好事 舉例來說 想要 2 3 位置 當中 元件 強制 換行 做 假設 4x4 位置 恰恰好 放 1x1 方塊 找 2 3 位置 方塊 找到 2 3 元件 我要 斷行 找 找 Google StackOverflow 有沒有 grid layout break row 這篇 最佳解 不用 找 澄清 一件 事情 網格 系統 斷行 這件 事情 查詢 斷行 操作 類似 作法 利用 Auto placement 特性 做 來看 事情 想要 2 3 位置 發生 斷行 動作 3 3 元件 下放 先 提醒 會 副作用 網格 系統 擺放 空間 勢必會 隱性 網格 定義 自動 填滿 欄 列 尺寸 請留 意 會 min content 填充 原本 負數 軌道 請 會 改變 實際上 操作 有沒有 崩潰 解釋 何用 Auto replacement 類似 事情 先決條件 網格 系統 強迫 定義 元件 網格 位置 也就是說 自然 排列 位置 排列 要將 2 3 位置 元件 換到 一行 會 找到 斷行 解法 利用 Auto placement 規則 加上 span 關鍵字 位置 元件 跨欄 動作 自然 元件 就會 欄位 關係 擠 一行 說真的 斷行 斷行 現行 格線 系統 來看 想要 麻煩 定義 元件 位置 只能 做 命名 方式 grid template areas 做 不行 才 會 說 這是 數數 工作 要命 數錯 有沒有 作法 前提 這是 作法 不好 請 留言 罵 沒 請 往下 RWD 來說 一種 合適 Grid 結構 方式 情況 來說 不太可能 頁面 設計 彈性 尺寸 做 客戶 彈性 很大 像是 石墨 烯 褲子 會 固定 尺寸 固定 位置 需求 例子 來說 以樣 4x4 網格 容器 定義 幾個 區塊 會 像是 結構 思考 Media Query 做 裝置 sidebar 放到 main 下方 實際上 操作 方式 會 請 記得 網格 設定 固定 尺寸 裝置 變小 變化 也就是說 設定 套用 手機 iPhone 13 尺寸 裝置 Viewport 寬度 390px 情況 容器 彈性 空間 會 壓縮 也就是說 扣掉 sidebar 本身 固定 200px 扣掉 gap 10px main 剩下 180px 可用 這是 彈性 空間 計算出來 剩餘 尺寸 手機 會 側邊 欄位 欄位 還要 大 情況 回到 Media Query 到底 做會 例子 理解 到格線 系統 斷行 概念 全部都是 矩型 矩陣 排 位置 想像成 圍棋 棋盤 想像 擺放 東西 位置 座標 涵蓋 大 來看 比較複雜 例子 元件 排列 沒 單純 順序 情況 製作 Grid Flexbox 搞不好 更 快 延續 例子 想要 main 加上 廣告 手機 廣告 sidebar 下方 不想 main 夾在 廣告 先 來看 手機 呈現 方式 HTML 內容 來看 大 尺寸 呈現 看起來 好像 完美 實務 操作 挺 累人 網格 系統 中 斷行 概念 定位 排序 做 裝置 CSS 最少 設定 大概 換到 大 裝置 發現 網格 系統 尺寸 略微 調整 Media Query 到底 做 玩 拼圖 格線 系統 中 並不像 Flexbox 會 文件 流要 的點 說 只能 說 少 考量 的點 扣除 掉 定位 position absolute 帶來 狀況 先前 Flexbox 並不需要 定位問題 這是 差異 與其說是 Mediq Query 做 RWD 倒不如說 利用 Media Query 畫面 換掉 重做 感覺 搜尋 css grid media queries 一堆 告訴 Media Query 去換 Grid Layout 操作 先 一般來說 畫面 換掉 事情 AWD Adaptive Web Design 範疇 最一 初衷 規劃 出 換掉 Grid Layout 才 重點 來說 網格 系統 規劃 Media Query 誠心 建議 找個 方格紙 筆記本 元件 排上去 尺寸 順序 大小 位置 HTML 語意 結構 放到 2 順序 就要 計算 最小 裝置 先 擺出來 做 慢慢 裝置 放大 並在 breakpoint 元件 順序 大小 位置 一種 breakpoint 規劃 Grid 容器 利用 彈性 尺寸 彌補 預測 邊界 尺寸 真的 不行 回去 Flexbox Flexbox 何不 小結 說 Grid 好像 很潮 地方 蠻 現行 諸多 套件 基本上 當作 類 Flexbox 操作 沒 在乎 在乎 痛苦 目錄 小節 部落 格 同步 放送",
    "前言 系列 看過 Vue 官方 文件 或學過 Vue 下手 重構 網站 規畫 系列 文章 整理 Vue 重構 很多 網站 經驗 分享 讀者 單元測試 當你 接觸 開發 專案 一段時間 會 漸漸 聽到 專業術語 就讓 我來 了解 單元測試 影片 搭配 文章 學習效果 會 更好 喔 單元測試 簡單 來說 程式碼 最小 單位 測試 確保 程式 邏輯 團隊 維護 過程 中 出錯 維護 程式碼 品質 最小 單位 我用 個例 子來 舉例 主 功能 A Ｂ 兩個 功能 兩個 功能 所說 最小 單位 撰寫 測試 重點 針對 A Ｂ 測試 主 功能 測試 中 包含 A Ｂ 測試 測試 所說 單元測試 單元測試 我先 列出 幾個 優缺點 優點 確保 團隊 跌代 影響 原本 功能 確保 品質 準確 程式碼 切割 最小 單位 降低 耦合度 程式 return 預期 重構 程式碼 測試 規格 走 缺點 初期 撰寫 單元測試 消耗 時間 會 大於 開發 時間 迭代 性高 很常 寫 測試 重寫 久 會 浪費 很多 時間 測試 相關 配置 繁瑣 配合 開發 細節 設定 很多 從優 缺點 說 撰寫 單元測試 初期 開發 效益 並不高 先 撇開 熟悉 測試 來說 光 公司 會 需求 改變 就要 來來回回 改寫 程式 就要 再花 時間 重寫 測試 想 時辰 壓力 專案 來說 划算 會 放棄 寫 測試 初期 會 修改 需求 先寫 測試 笑 情況 下該 寫 單元測試 產品開發 中期 基本上 中期 平台 規格 差不多 補 單元測試 會 做好 功能 新 功能 預期 外 錯誤 專案 同事 接手 改壞 功能 同事 透過 測試 了解 測試 沒 案子 給推 上線 寫 Vue 單元測試 前 寫 測試 前 先 了解 透過 何種 技術 撰寫 測試 Jest Jest Facebook 開發 維護 一款 JavaScript 測試 框架 簡潔 語法 測試 function Vue Test Utils Vue Test Utils Vue 官方 推出 組件 單元測試 框架 簡化 組件 測試 提供 方法 區分 掛載 組件 之間 交互 會 透過 兩種 測試 框架 針對 vue component 測試 Vue Test Utils 負責 解析 component 透過 build 模擬 DOM 渲染 透過 Jest 撰寫 test case 驗證 符合 預期 安裝 jest Vue Test Utils Vue cli 新 建立 專案 請 選擇 Unit Testing Jest 專案 預設 會 安裝 jest Vue Test Utils 建立 專案 選擇 Unit Testing 輸入 指令 現有 CLI 專案 jest Vue Test Utils 語法 介紹 describe test 先來 帶 來看 語法 describe 類似 群組 概念 用來 多個 相關 測試 包再 test 測試 項目 單位 test 別名 兩個 東西 expect 測試 項目 內容 toBe 斷言 檢查 expect 回傳 內容 符合 預期 多種形式 斷言 語法 jest 語法 API 接下來 Vue Test Utils 負責 解析 Component shallowMount 方法 渲染 Component 透過 text 方法 Component 文字 內容 做 比對 簡單 單元測試 先 告一段落 還想 更 單元測試 情境 購買 新課程 Vue 單元測試 vue test utils 入門 課程 網址 原價 新台幣 2200 元 預購 價新 台幣 1800 元 輸入 折扣 碼 PAJNBFUNO300 馬上 再折 300 元 優惠 訂閱 Mike 頻道 享受 精彩 教學 分享 MIke 官方 line 帳號 好友 搜尋 mike cheng",
    "Shadow React Native 這門 學問 專案 中 卡牌 陰影 css3 中 box shadow 屬性 發現 設定 沒 效果 發現 雙 平台 顯示 竟然 統一 31 天 接續 紀錄 寫 這篇 原因 P Platform 先 react native 有個 平易近人 跨平台 裝置 判斷 請 這篇 學會 判斷 平台 ... 回事 style 實作 iOS android code 結論 ... 會 發現 兩個 裝置 樣式 寫法 做 平台 判斷 合併 寫 即可",
    "tags swfLAB ⚠ ️ Of course only my personal thoughts don ' t too serious haha ... ⚠ ️ Final Updated 2022 3 17 Table Contents Intro event Cast eye over contract What Foundry Testing Time Conclusion Reference Synchronization Link Tree Intro iParking NFT What happened 簡單 來說 事件 起因 過程 深度 了解 接收 資訊 來源 附上 連結 自行 參考 Motivation 發現 好像 選擇 合約 部屬 前 會 測試 角度 來看 這次 事件 錯誤 發生 肉眼 觀察 合約 找到 講 要說 評論 這件 事情 前輩 夥伴 錯 開發 團隊 做好 事後 MOD 這次 錯誤 肉眼 清晰可見 水汪汪 大 眼睛 大腦 確實 比手 程式碼 好用 哈哈哈哈 Testing 職業 工程師 檻 自認 距離 工程師 不小 距離 想要 藉此機會 陳品 告訴 Foundry 撰寫 測試 篇文章 主軸 學習 Foundry 小小 筆記 嘟嘟 房 活例 D 先回到 文章 最一 宣告 ⚠ ️ Of course only my personal thoughts don ' t too serious haha ... ⚠ ️ 發現 文中 錯誤 想法 請 不吝 大方 告訴 還在 學習 中 我會 無條件 接受 意見 想法 Cast eye over contract 參考 前輩 媒體 資料 大 概率 先 技術 層面 定位 array 資料 結構 實作 白名單 系統 Gas Limit 設定 來看 程式碼 The path Contract Inheritance 基本上 猜 嘟嘟 房 工程師 特別 改 繼承 而來 合約 內容 我先 道歉 OpenZeppelin 不到 東西 變數 資料 結構 宣告 刪掉 藉此 Gas Fee 降低 寫 Project 會 習慣 繼承 Github 內容 東西 貼過來 改成 想要 樣子 OpenZeppelin 安全性 便利性 稱許 科學家 工程師 菜雞 半個 來說 細細的 斟酌一下 東西 蠻 隨便 亂改 合約 反而 Bug 確實 石頭砸 腳 很常 ... 畢竟 工作 收 薪水 繼承 函式 庫 呼叫 API 更 小心 更 了解 這門 技術 才 發現 很多 程式碼 Copy Paste 簡單 CarMan 繼承 歷代 先祖 先烈 遺產 迎來 人生 曙光 主 合約 我並 仔細 一一 講解 合約 變數 函式 細節 大概 摸 出 合約 東西 希望 文中 引用 程式碼 到底 寫 宣告 版本 宣告 合約 繼承 進 合約 先 宣告 常數 馬上 第一個 鞭 小夥伴 array 型態 whitelistedAddresses 負責 接收 初始化 參數 建構 子 指 NFT Metadata baseURI IPFS CID VIP mint 函式 預售 mint 函式 公售 mint 函式 判斷 訊息 傳遞 交易 mint msg sender 自然 消費者 白名單 成員 NFT 合約 tokenURI 鑄造 函式 啟動 關閉 條件 擁有 管理權 才能 呼叫 函式 函式 越 越 中心化 一切都是 透明 明白 寫 程式碼 sign 代表 同意 接受 合約 控制權 合約 算是 管理權 人員 管理 函式 賺了錢 記得 錢 withdraw 函式 What Foundry Unit Testing Smart Contract 過往 Testing 無非 Hardhat Truffle DappTools 撰寫 Javascript Typescript 語法 測試 搭配 Ganache Infura 服用 藥物 還會 包含 ethers js mocha waffle chai blablabla 自行 體會 D 寫過 node modules 充滿 各式各樣 dependencies 做 開發 先來 一套 刪 套件 重載 套件 降 版本 環境 變數 組合拳 算是 夠 惱人 ... Javascript 人手 一把 利器 但身 撰寫 Solidity 工程師 測試 語言 寫 會 怪怪的 更 不用說 Big Number 套件 還會 Solidity 劑 打天下 疫苗 效果 快狠準 Foundry 掌聲 Introduction Rust 建置 開發工具 自稱 以太 坊 開發 環境 中 最快 最有 彈性 擴充性 最強 一款 官方 github 中 拿來 知名 工具 dapptools 理所當然 大勝 Foundry 從眾 工具 中 脫穎而出 快速 之外 Solidity 撰寫 測試 特質 會 會 機會 細細品味 Comparison 基準 相關 敘述 翻譯 Foundry 官方 文件 Forge 利用 編譯 測試 表現 快 速度 Project Forge DappTools Speedup 28.6 s 2m36s 5.45 x 6s 46s 7.66 x 11s 40s 3.63 x 1.4 s 5.5 s 3.9 x 著名 函式 庫 時 Hardhat 耗費 15.244 s 時間 編譯 Forge 9.449 s 4s cached What features use Foundry 平常 開發工具 Ethereum 測試 框架 支援 多種 客戶端 功能 像是 EVM 智能 合約 互動 傳遞 交易 鏈上 資訊 一把 瑞士刀 官方 文件 寫 來自 官方 Foundry 特性 Fast flexible compilation pipeline Automatic Solidity compiler version detection installation under svm Incremental compilation caching Only changed files re compiled Parallel compilation Non standard directory structures support e g Hardhat repos Tests written Solidity like DappTools Fast fuzz testing shrinking inputs printing counter examples Fast remote RPC forking mode leveraging Rust ' s async infrastructure like tokio Flexible debug logging Dapptools style using DsTest ' s emitted logs Hardhat style using popular console sol contract Portable 5 10MB easy install without requiring Nix any other package manager Fast CI Foundry GitHub action Download Foundry 作業系統 Linux macOS 簡單 方法 方法 下載 Foundry 下載 執行 foundryup 會將 Foundry 更新 最新 版本 想要 返回 指定 版本 指令 foundryup v VERSION Windows 下載 方式 下載 Foundry 先 Rust Cargo rustup rs 下載 rust 執行 Rust Cargo 打開 CMD 指令 成功 安裝 Foundry 下載 過程 中像 錯誤 就要 下載 選擇 C++ Build Tools 重 開機 解決 下載 大小 約 6 GB First Foundry Test init 初始化 專案 進 hello foundry 初始化 資料夾 forge CLI 將會 創建 兩個 檔案 目錄 lib src lib 包含 testing contract lib ds test src test sol 各式各樣 測試 合約 實作 demo lib ds test demo demo sol src 放 寫 智能 合約 測試 原始 碼 編譯 測試 More Foundry Test iParking foundry hello foundry src Contract sol 中 合約 修改 成 想要 撰寫 合約 檔案 test Contract t sol 中 測試 熟悉 require 之外 方式 測試 更多酷 炫 assertions 語法 用來 測試 合約 lib ds test src test sol 中 找到 邏輯運算 assertTrue 十進制 assertEqDecimal 大於 小於 assertGt assertGe assertLt assertLe More features use Foundry 支持 測試 因為當 函式 測試 時 成功 PASS 邊際 測 資中 會 導致 Under Overflow RE ME 錯誤 測試 函式 中 增加 參數 Fuzzing Solidity test runner 隨機 選擇 參數 輸入 函式 例子 中 fuzzer 會 自動 x 嘗試 隨機數 發現 輸入 會 導致 測試 失敗 便會 回傳 錯誤 這時候 debug 測試 錯誤 發現 參數 輸入 57896044618658097711785492504343953926634992332820282019728792003956564819968 會 錯誤 來到 貼 數字 會 發現 數字 5.789 10 76 2 255 聽 x 型態 uint256 程式 勢必 函式 增加 型態 異常 敘述 未來 Foundry Fuzz Testing 之外 還會 支援 Invariant Testing Symbolic Execution Mutation Testing Give me more information Give me more more more documentation ⚗ Testing Time Initialization Preparation 打開 空 資料夾 init 初始化 專案 繼承 OpenZeppelin 合約 先將 導入到 專案 src 感覺 子 做 正確 做法 拜託 提供 給我 iParking foundry src Contract sol 中 合約 修改 成 嘟嘟 房 NFT 合約 記得 import 繼承 列祖列宗 先 Contract t sol 檔案 中 測試 合約 建置 測試 專案 編譯 有沒有 Unit Testing 目標 preSaleMint 函式 運作 狀況 說到底 一種 馬後炮 懶得 寫 測試 哈哈哈 廢話 不多 說 開測 先 宣告 版本 主 合約 宣告 進來 之外 宣告 DEPLOYER ADDRESS 來存 合約 deployer 地址 temp 暫存 增長 白名單 這段 程式碼 多個 重點 DEPLOYER ADDRESS carman owner 敘述 中 msg sender deploy 合約 owner 方法 msg sender foundry toml 中 環境 變數 全域 變數 設定 檔 預設值 二 carman addController DEPLOYER ADDRESS 這是 陣列 存 白名單 外 弔 詭 地方 主 合約 owner 建構 子裡面 設定 Controller 大部分 功能 函式 居然 require Controller onlyOwner modifier 幫 deployer 宣告 三 增長 白名單 重點 合約 中 隨機 製造 帳戶 地址 加進去 temp 陣列 push whitelistedAddresses 中 接下來 程式碼 苦惱 超級 久 實作 checkOnERC721Received 宣告 safeMint 會 瘋狂 錯誤 我查 資料 checkOnERC721Received verification logic 地址 合約 EOA 實作 body 才 ERC 721 介面 回傳 正確 4 bytes hash 第一個 測試 先 試試 水溫 Deployer 能不能夠 鑄造 幾個 NFT 第二個 測試 Foundry 提供 很酷 功能 身分 轉變成 帳戶 藉此 角度 測試 合約 宣告 CheatCodes 介面 測試 合約 宣告 cheats 想要 測試 合約 加上 cheats prank address 0 角度 轉成 address 0 測試 Gas Report Foundry 有趣 功能 Gas Report Gas 消耗 驚人 發現 錯誤 foundry toml 中 gasLimit 設定 成 想要 大小 控制 辦法 D Conclusion Why do I correct contract 市面上 實作 例子 無論是 mapping 酷炫 Merkle Tree Hash Tree 稍微 中心化 更 易於 管理 節省 開銷 Backend Signature Whitelist Data Base 多查 一點 資料 會 選擇 掉 array 資料 結構 來存 白名單 菜鳥 會 寫 Solidity 人裡面 99% 強 哈哈哈 修正 智能 合約 事情 我先 躲開 做 Auditing 大師 不少 D My point view array 遍歷 子 演算法 尋找 白名單 稱得上 詭譎 Web2 跨足 Web3 公司 很多 東西 學習 才剛 蓬勃發展 產業 技術 中 還在 摸索 技術 模式 商業模式 也許 改善 機會 累積 越來越 先例 某種程度 產業 邁向 更好 發展 希望 多多 多多 多多 增進 寫 測試 實力 畢竟 寫出 會動 合約 不難 寫出 出錯 難如登天 Reference Foundry ERC 721 Contract Unit Testing",
    "提到 做 一塊 開發板 要來 分享 PCB 淘寶 送洗 經驗 動手做 一塊 玩 成就感 先想 辦法 註冊 淘寶 帳號 要過 電話 認證 手機 下載 EZway 手機 認證 軟體 實名 認證 確保 電話 淘寶 攸關 海關 貨物 實名 認證 手機 下載 淘寶 APP 會 說 用途 電腦 下載 阿里 旺旺 大陸 賣家 溝通 軟體 下載 手機 淘寶 APP 做 溝通 設定 淘寶 送貨 地址 步驟 淘寶 買 想要 東西 瞜 找 一家 淘寶 PCB 廠家 找 捷配 找到 賣家 賣家 商場 首頁 點選 聯絡 客服 客服 說 PCB 打樣 這時候 賣家 會 傳 文件 給他 IP 位置 阿里 旺旺 傳給 客服 這時候 就問 賣家 發郵件 我會 大陸 說法 台灣 說法 OK 看得懂 這時候 他會給 信箱 PCB 元件 寄給 只收 PcbDoc 檔案 這時候 會問 工藝 工藝 賣家 網頁 寫 興趣 瞜 不介意 規格 說 常規 工藝 會 說 常規 工藝 截 對話 紀錄 最少 片數 5 片 喔 會 確認 傳過來 文件 有沒有 賣家 會 說 沒 賣家 會 傳個 付款 連結 選擇 下單 再來 選擇 運送 方式 運送 方式 多種 兩種 貨物 集運 倉在繳 運費 送來 台灣 這有 好處 多個 賣家 商品 全都 送到 XX 集運 倉 統一 附 郵件 費 送來 台灣省 運費 賣家 說順 豐直 發台灣 會 快 價錢 差不多 了解 在問 賣家 接下來 方式 付款 兩種 7 點 ibon 輸入 付款 條碼 說 下載 手機 淘寶 APP 這時候 手機 付款 條碼 去年 改 原本 網頁 只能 手機 APP 軟體 小七 付款 號碼 信用卡 付款 完後跟 賣家 說 新 客戶 淘寶 賣家 會 身分證 字號 提供 喔 貨物 進不來 海關 實名 認證 大致 等貨 回來 喔 淘寶 APP 查看 貨物 狀態 假設 貨都 沒來 壓 退款 退款 會退 玉山 銀行 詳細 玉山 客服 詢問 喔 淘寶 交易 管理 這時候 電路板 到來 已將 重點 列出來 沒 辦法 花太多 時間 做 一步步 教學 提 喔",
    "這篇要 補充 少 useLayoutEffect hook useEffect 語法 執行 時機 不太 useEffect 差異 先 假設 畫面 toggle 按鈕 綁定 事件 state 那當 點擊 瞬間 DOM 四個 步驟 做 改變 state 狀態 更新 畫面 變化 建構 新 virtual dom tree 舊 virtual dom tree 透過 diff 演算法 找出 更新 更新 更新 real dom 第四 步驟 結束 時 useEffect 才 執行 放在 它裡面 函式 useLayoutEffect 第三 步驟 會 執行 useLayoutEffect 同步 它會 拖延 畫面 呈現 時機 操作 DOM 時 發現 閃爍 情況 時 範例 中 點擊 按鈕 會 跳出 一段 文字 圖片 useEffect 彈 出 文字 殘影 圖片 不易 讀者 點 範例 做 嘗試 useEffect useLayoutEffect 註 也許 跳出 文字 開發 中有 寫法 想 差別",
    "公司 內部 分享 公司 20 年老 系統 傳統 組織 正 面臨 數位 轉型 中 團隊 管理 開發 定義 SLO 目標 DevOps 文化 帶給 傳統 開發 團隊 新思維 習慣 紀錄 監控 觀測 性 帶給 開發 維運 團隊 好處 Talking About DevOps Observability Outline 運維 盲區 Operational Blindness 監控 Monitoring 紀錄 Logging 指標 Metrics Observability 前言 針對 公司 內部 現況 做 分享 站 DevOps 右側 偏運維 角度看 事情 Observability 介紹 Operational Blindness War Story Note 天 中午 運維 組內 暴發 出 警報 通知 一堆 訊息 湧現 跳 發現 網站 癱瘓 外部 監控 近 幾次 健康檢查 沒過 觸發 警報 Note 發現 網站 癱瘓 Black Box Monitoring Note 登入 主機 監控 系統 發現 網站 系統 指標 記憶體 CPU 沒到 100% Disk IO 還在 容許 內 資料庫 活著 Note 原因 只好 開發 團隊 主機 網站 服務 進程 本身 看起來 算 Note 開發 團隊 登入 正式 環境 主機 權限 所有人 權限 主機 管理 成本高 資安 風險 高 Note 開發 團隊 只好 運維 團隊 工作 只能 發號施令 最終 資料庫 發現 一堆 慢 查詢 一堆 連線 處於 CLOSE WAIT 狀態 Web 服務 數量 進程 推測 Web 服務 容量 停止 響應 新 request healthcheck db query session 砍掉 Web 服務 請求 隊列 清空 Note 查找 根源 浪費 很多 時間 升級 時 波及 沒 足夠 權限 查看 找 有用 主機 資訊 服務 資訊 最終 依賴 運維 團隊 情境 一分鐘 服務 停機 時間 要錢 運維 團隊 只能 主機 監控 指標 Question Dev Ops 團隊 分離 組織 溝通 方式 間接成本 Note 傳統 結構 一條 紅線 開發 運維 職責 劃分 開 運維 團隊 負責 主機 基礎設施 應用程式 交付 Note Developer Operations 組織 結構 合作 方式 職責 分 太開 會 拔河 分散 力道 相互 拉扯 中 復原 時間 流逝 Note 可怕 使用者 平台 提供 服務 品質 沒 信心 跳去 競品 平台 DevOps Note Developer Operations 相互 拉扯 拔河 分散 眾人 力道 Note SLI service level indicator 指 指標 QPS TPS Duration 準確性 延遲 性能 metric 視為 SLI 選擇 儘可能少 SLI SLI 服務 穩定 可靠 SLO service level objective 服務 等級 目標 指 一段時間 內 目標 1 月 內 QPS 99.99% 響應 時間 10ms SLO 一組 值 值 SLI 定義 服務 級別 數值 自然 SLO 定義 SLI 情況 小於 某值 處於 大小 值 之間 選擇 合適 SLO 一件 事情 並不需要 設定 SLA service level agreement 服務 等級 協議 指 協議 協議 內容 包含 SLI SLO 恢復 方式 時間 一系列 協議 基於 時間 可用性 基於 時間 可用性 系統 運行 時間 系統 運行 時間 停機 時間 SLO 99.95% 一年 來看 佔 4 小時 22 分鐘 SLO 99.99% 一年 來看 佔 52 分鐘 基於 次數 合計 可用性 基於 合計 可用性 成功 請求 數 請求 數 總和 SLO 99.99% 接受 2.5 M 請求 錯誤 個數 應 250 基於 延遲 SLO 99% 前台 每秒 User 訪問 延遲 300ms Monitoring Types Monitoring Monitoring Layers Logging Deal discrete events Application debug error messages Audit trail events Request specific metadata Specific events Note 應用程式 錯誤 訊息 稽核 事件 HTTP 請求 事件 Log Monitoring Troubleshooting Monitor Clearly log level Good log message Log aggregation Note Show Loki 單行 Log JSON 格式 針對 各種類型 服務 定義出 固定 metadata key Defect Log Monitor Low value density Note 價值 資訊 密度 太低 很多 第一行 價值 資訊 這部 影片 講了 很多 Log Cetralize Monitor 好處 Log 表達 Write log into RDBMS log 併發 寫入 高 寫入 資料庫 RDBMS 併發 事務 量 高 就算 buffer pool 加大 極限 建議 log 字段 很多 種類 索引 選擇 困難 DB 真 出事 想 登入 log 沒法 搞不好 還沒 寫進去 壓死 DB 那根 樹枝 DB 回歸 業務 狀態 資料 存儲 存取 Metrics 4 Golden Signals Latency time serivce a request Traffic requests second Error error rate request Saturation fullness a service Note 用戶 體驗 衡量 系統核心 性能 系統 時間 作業 計算 系統 作業 時間 系統 服務 量 請求 數 發出 接收 網絡 封包 大小 發現 定位 故障 錯誤 總量 調用 服務 失敗率 系統 飽和度 負載 系統 佔用 內存 作業 隊列 長度 Prometheus metric name label sets Note label sets 代表 metric name 維度 多個 維度 做 聚合 操作 Metric Types Note counter 只增 不減 用來 request 總量 數量 錯誤 發生 次數 計算 段時間 內 rate 變化率 事前 透過 壓力 負載 測試 預期 上限 做 監控 警告 查詢 系統 中 訪問量 前 10 HTTP URL gauge 即時 變化 情況 時間 變化 用來 記錄 cpu mem 用量 coroutine 數量 pool usage 併發 請求 數 ... 透過 計算 樣本 線性 回歸 模型 數據 變化趨勢 預測 Histogram 會 觀測 數據 取樣 觀測 數據 放入 數值 上界 桶 中 記錄 各桶 中 數據 個數 數據 個數 數據 數值 總和 請求 時延 樣本 數據 用來 區分 平均 慢 長尾 慢 快速 了解 監控 樣本 分佈 情況 Summary Histogram 類似 會 觀測 數據 取樣 數據 個數 總和 還會取 滑動 窗口 計算 窗口 內 樣本 數據 分 位數 Archetecture Observability Note Monitoring tells whether system works observability lets ask why ' s working Pilliars Obersvability News Reference Thank You find me",
    "▲ AR12 TUF 採用 導熱管 CPU 接觸 熱導管 直觸 技術 HDC 4 根 Ø 6mm 全銅 熱導管 搭配 全鋁 散熱 鰭 片 液相 作動 流體 吸熱 端 蒸發 成汽相 相變 吸收 熱量 流體 高速 流向 放熱 端 放熱 端遇 冷凝 結成 液相 相變 釋放出 熱量 藉由 重力 毛細 力 離心力 迴流 吸熱 端 反覆 循環 由此可知 吸熱 端 位於 下方 理想 ▲ 12 公分 高效能 九 葉片 風扇 PWM 風扇 主機板 透過 控制線 調整 風扇 轉速 使用者 自行 調整 效能 靜音 風扇 中央 帶有 8 顆 ARGB LED 各家 主機板 連動 軟體 協作 同步控制 燈效 設定 接頭 4 pin PWM 4 1 pin ARGB 5V LED 安裝 主機板 4Pin 接腳 集線器 更 aRGB 裝置 偕同 運作 ★ ★ ★ ★ Ardiuno 控制 ★ ★ ★ ★ ▲ 裝 機殼 偕同 運作 貌 主機板 4Pin 接腳 文章 藥 草草 結束 aRGB 風扇 電力 輸入 5V DC 手邊 光好 想到 Arduino 開發板 5V 輸出 便 想 Ardiuno 控制 SilverStone AR12 TUF 散熱器 呼吸 燈 ▲ 麵 包版 結構 請 自行 參考 網站 麵 包版 好處 aRGB Hub 並聯 方式 控制 aRGB 裝置 隨時 調整 價格 便宜 尺寸 30 元 即可 入手 固定 雙面膠 即可 ▲ 杜邦 長度 插不進 控制線 孔徑 附上 蓋子 一截 排針 直 插 麵 包版上 ▲ 板子 小抄 5V 接地 資料 線 安排 第五 針 改動 define DATA PIN 5 一行 下載 程式碼 安裝 FastLED 函式 庫 Arduino IDE 安裝 請 自行 google -- ▲ 編譯 上傳 更 執行 官方 提醒 字樣 務必 確認 所欲 接 控制 盒 主機板 RGB 連接埠 排列 定義 AR12 TUF 連接 正確 連接埠 損毀 再三 電錶 確認 電阻 腳位 成功 想像 簡單 Youtube 影片 連結 此供 參 風扇 機上 電後 自然 會 ★ ★ ★ ★ 心得 ★ ★ ★ ★ 燈控 軟體 簡單 易用 好處 會 吃 一點 系統資源 開發 版 玩家 想要 燈校 展現 展現 音樂 撥放 同步 白天黑夜 切換 程式 控制 比燈控 軟體 彈性",
    "本文 同步 刊 目錄 前言 鐵人 賽 系列 文 提到 項目 比賽 結束 區塊 鏈 近期 規劃 未來 規劃 結語 前言 會 寫 這篇文 原因 參加 2021 鐵人 賽 說不定 意義 改變 人生 哈哈哈 哈哈哈 講並 要給 鐵人 文章 冠上 榮耀 深度 層面 很多 先來 聽個 歌 鐵人 賽 平常 習慣 寫文章 紀錄 學習 內容 心得 習慣 過往 當作 宣洩 心情 一種 方式 分享 近狀 發在 FB IG 鐵人 賽 想太多 參加 畢竟 從小到大 喜歡 寫東 寫西 擠出 一點 內容 鋪滿 三十天 太 困難 想 說 得獎 前 從來沒 想過 肯定 新 媒介 分享 學習 歷程 頗 有趣 鐵人 賽是 極度 意義 活動 身邊 很多 朋友 會 寒 暑假 規劃 要學 東西 動力 Push 比賽 團體 完賽獎 藉由 同儕 組員 壓力 督促 砥礪 有心 對得起 會 多花 一點 心力 寫文章 參加 比賽 達 質量 為防 意外 獲 肯定 為求 舒適 累積 存稿 真的 不可避免 累積 文章 數量 會 意外 組員 一陣子 痛苦 至極 至少 組員 開賽 累積到 20 25 篇 看起來 嚴厲 隊長 但過 暑假 大學生 真的 超級 悠閒 實在 理由 先存 稿 硬 拖 開學 才 寫 自以 安排 幾天 衝刺 那為 前 幾個 寒暑假 還會 毫無 收穫 結束 系列 文 提到 項目 項目 胎死腹中 成本 獲利 奇形怪狀 撲朔迷離 現象 成功 要說 真的 Deploy Mint E 真不知道 猜 回本 沒 區塊 鏈 領域 技術 統治 世界 科學家 工程師 真的 太多 太多太多 事情 交易 MainNet TestNet 透明 導致 單和鎖址 機器人 橫行 熟悉 熟悉 區塊 鏈 夥伴 釣魚 網站 駭客 攻擊 損失 資產 更 不用說 充斥 一堆 假 博士 騙子 無腦 推 公鏈 生態系 項目 老鼠會 沒 兩樣 嶄新 領域 項目 衡量 Developer Marketing Artist 努力 多寡 功過 真的 評量 準則 既定 模式 唯一 確認 做 項目 合夥 錢 事情 講好 講到 錢 很多 六親不認 呵呵 半年 接觸 越來越 同行 前輩 夥伴 便 聽到 越來越 奇聞 軼事 賣不出去 想要 怪 Marketing 分錢 想 專利 回 Artist 手中 寫出 Bug Developer 道歉 沒 項目 說 公司 組織 經營 確實 一門 大 功課 組織 穩定 會 影響 社群 信心 向心力 NFT 價值 水平 非 同質化 代幣 發行量 吞吐量 通膨率 代幣 模型 估值 頂多 持有 幾位 最終 回到 社群 營運 福利 向心力 藝術 價值 品牌形象 要說 反正 世界 有緣 做 沒緣 就算 做好 事情 做好 那就好 比賽 結束 半年 接收 不少 合作 訊息 信件 不免 詐騙 看起來 稍微 詭譎 內容 大部分 興趣 請原諒 小弟 不常 iThome 網站 信箱 有時候 會 漏掉 資訊 很多 中文 創作者 社群 開發 NFT DAPP 參考 文章 對此 開心 厲害 至少 當初 寫 系列 文 菜 能給 一丁點 像是 當初 很多 厲害 慷慨 大神 手中 差別 大神 厲害 比賽 結束 充實 找到 一份 蠻 喜歡 工作 接觸 好多好多 厲害 工程師 收到 很多 工作 面試 邀約 重的點 賺 多少錢 沒 我能 藉由 機會 更 印象 深刻 收到 面試 規模 公司 開出 七 八個 技術 門檻 勉勉強強 才能 一半 光是 案例 就夠 努力 一陣子 區塊 鏈 來說 區塊 鏈是 極度 迷人 技術 之中 龐大 市場 像是 迷幻 魔法 中心化 概念 像是 革命 號角 高深莫測 底層 技術 電腦 科學 密碼學 像是 人類 時代 推進 產物 身為 反骨 青年 很多 現行 社會制度 資本 橫行 現象 中間人 信息 對稱 壟斷 金融業 央行 詭異 感到 舒適 想要 一股腦 推翻 這項 技術 帶來 更 改變 喜歡 原型 東西 區塊 鏈 底層 技術 興趣 數學 密碼學 網路 學 計算機 學科 都給 非 本科 系 學生 帶來 不少 麻煩 這也 導致 此時此刻 還在 層面 佇足 底層 鑽 未來 會發 更 學習 區塊 鏈 底層 技術 筆記 心得 近期 規劃 近期 規劃 歸類 7 月 暑假 學期 課業 助教 工作 之外 兩份 出版 品 兩場 表演 一場 Tech Meet Up 一份 實習 帶隊參加 ETH Global Hackathon 未來 規劃 鐵人 賽 要往 Blockchain Developer 決心 上文 平常 會掛 嘴邊 一句 話 非電資 科系 自信 說 小小的 佳作 飛 上天 贏過 本科 系 訓練 學生 比賽 體會 很多 嚮往 事情 挑戰 像是 原本 沒 辦法 寫出 合約 串上 API 規劃 DAPP 架構 才 發現 做出 能動 東西 倒 真 沒 難 或許 能動 東西 好用 東西 東西 學會 東西 公司 開 技術 門檻 弄 機會 我修 資料 結構 演算法 NTU CSIE 當的 助教 NTU IM 實在 沒理由 嘗試 放棄 當我 想法 面對 挑戰 好像 沒 害怕 直視 可怕 科目 時 會 怨聲載道 地想 放棄 哈哈哈哈 哈哈哈 結語 回首 超過 半年前 三十篇 文章 說 槽點 滿滿 我並 這是 多麼 羞恥 事情 內容 漏洞百出 地方 想 出 更 棒 寫法 某種程度 證明 比賽 結束 虛度光陰 寫 鐵人 賽 文章 本來 想 說 60 90 篇 2 3 部 系列 文 算了 真的 沒 時間 ㄚ 先不講 主題 嘿嘿 但會 喜歡 內容 衷心希望 重現 Blockchain 組 不用 擺在 SWE 組 MW 組了 DevOps 組 組別 系列 文有 大部分 重點 Unit Testing CI CD 自動化 工作 流 特別感謝 共事 好友 支持 心靈 支柱 給我 無數 機會 肯定 每位 老師 前輩 無償 提供 資源 產出 大神 2022 IT 鐵人 見",
    "文章 發佈 過程 中 建立 request command 預計 規劃 透過 command 觸發 多個 request 功能 多個 command 觸發 同一個 request 觸發 順序 定義 那要 需求 預計 多開 一張 表 名為 commands requests 這張表 目的 要將 commands requests 建立 關聯 規劃 欄位 name type uuid uuid commands uuid uuid requests uuid uuid 觸發 順序 欄位 中要 順序 欄位 name type uuid uuid commands uuid uuid requests uuid uuid order int commands requests commands uuid command uuid commands requests requests uuid requests uuid 將相 關的 欄位 做 foreign key 關聯 做 資料庫 幫 保證 commands requests 中 兩個 uuid 存 在於 兩張 表中 資料庫 語法 發現 commands requests primary key 也將 建立 Primary Key 語法 補上去 怕 自動 uuid extension postgresql 中 沒 建立 建立 extension 功能 放上 補上 沒寫 down 檔 影片 code",
    "測試環境 登入 囉 如何是好 登入 先前 測試環境 測試 帳號 登入 程式碼 商品 類別 資料 登入 成功 近期 回應 連線 進去 程式 內部 錯誤 探究 原因 才 測試環境 關閉 測試環境 測試 只能 正式 環境 方式 開發 測試 小心 別亂 下單 喔 正式 環境 登入 想要 正式 環境 登入 先 永豐 開戶 登入 帳號密碼 正式 環境 shioaji 正式 環境 登入 方式 參考 sj Shioaji simulation True 改成 api sj Shioaji 即可 程式 參考 範例 後記 在過 這麼久 有人 討論 才 發現 測試環境 真 可惜 只能 實單 希望 開放 開發 怕 ...",
    "以下內容 同步 更新 程式 先到 資料庫 語法 建好表 程式 新增 屬性 會 新 環境 將你 程式 部署 兩個 月 前 資料庫 型態 這時候 會 發生 執行 sql 語法 曉得 兩個 月 前 資料庫 長 資料庫 定期 備份 情況 有個 機制 資料庫 狀態 納入 git 版本控制 幫 資料庫 版本控制 選擇 gorm migrate 語法 原因 資料庫 gorm 寫到 extension extension 放到 程式 中 才 會 選擇 語法 資料庫 表 版本控制 migrate 工具 方式 還蠻 簡單 地方 放上 指定 規則 sql 檔案 version 持續 變多 第一個 1 第二個 2 跳 10 數字 變多 up down 版本控制 會 說 原本 程式 升級 v2.0 0 版 發生 很大 bug 退回 v1.9 7 版 資料庫 會 資料 v1.9 7 形狀 up down 基本上 相輔相成 up 創表 create table ... down 就要 刪表 drop table ... 教學 寫 蠻 詳盡 點進 github 閱讀 readme 喔 這次 寫 過成 程式碼",
    "某人 會 遲到 從不 缺席 沒 x 失蹤 很久 故事 原點 正式 參加 鐵人 賽 從不 活動 說 逛過 iT 邦 幫忙 網站 第一次 意義 鐵人 賽 學校 UNIX 作業系統 時 瓶頸 著急 地到 網路上 尋找 其他人 學習 恐龍 書 所寫 心得 緣分 使然 無意間 黑馬 作業系統 教室 統整 鐵人 賽 系列 文 下架 QQ 令 拾回 學習 信心 心中 浮現 下次 鐵人 賽 參賽 計畫 2021 13 屆 恐龍 書 圖源 初次 參加 鐵人 賽 選擇 報名 自我 挑戰 組 或許 自由 關係 想 30 天要 寫些 原始 想法 想 寫 接觸 網頁 心得 像是 網頁 三本 柱 前期 踩 坑 有人 分享 JS30 課程 心得 剛好 30 天 課程 當下 寫 JS30 學習 日記 系列 文 故事 伊始 鐵人 賽 正式 開賽 2021 09 01 思考 該不該 寫稿 放 鐵人 賽 開賽 沒 幾天 有人 文章 中說 寫 完 30 天 文章 自爆 XD 時間 安排 彈性 開賽 前屯 10 篇 稿子 說 每天晚上 12 00 剛過 丟 篇文章 打卡 簡單 前輩 稍微 看過 寫 系列 文 會 發現 JS 真的 很菜 依賴 網路上 查 算是 常識 資料 查資料 時間 課程 影片 寫 學習心得 時間 還要 長 故事 途中 前期 準時 發 心得 文 確認 發表 前 會 確認 內容 盡量 文章 錯字 寫 文章內容 觀看 教學 影片 查 資料 中 平靜 度過 故事 轉折點 發生 開學 課業 大學生 ing 鐵人 賽 事情 剛好 重疊 只能 零碎 時間 寫 鐵人 賽 系列 文 故事 轉折 大學生 開學 第一週 思考 整 學期 課程 安排 選到 帶走 東西 課 每學期 挑戰 我會 仔細 地看 課程 大綱 課程 評價 參考 萬惡 必修課 XD 想當然 耳 說 只能 零碎 時間 發文 過程 中 想要 放棄 畢竟 剩 幾天 完賽 浮現 那份 甘願 促使 我要 稍微 體會 優質 系列 文會 挑戰 成功 真的 會 很多 突發狀況 時間 寫 完 一篇 優質 文章 或許 短短 不到 10 分鐘 快速 閱讀 完畢 作者 花 數倍 時間 寫 整理 相關 資料 故事 尾聲 Stack Overflow 前人 JS30 課程 筆記 MDN Web Docs 支援 JS30 學習 日記 系列 文就 順利 開學 文章 寫 隨便 完賽 瞬間 真的 帶給 滿滿的 感動 成就感 瀏覽 次數 Like 數 訂閱 數的 跳動 認同 感覺 真的 非常感謝 網路上 前輩 更新 2022 02 28",
    "想 紀錄 STM32CubeMX 經驗 適合 沒用過 開發 經驗 不用 第一次 STM32CubeMX 開發 STM32 標準 庫 方式 做 開發 興趣 13 屆 鐵人 賽 幸運 Arm Platforms 類組 優選 文章 提到 標準 庫 開發 STM32CubeMX HAL LL 庫 開發 差異 重複 說 差別 學 標準 庫會 嵌入式 單晶 片 這塊 領域 更 Sense 學完 再來 深入探討 進階 功能 程式 執行 快 更 有效率 標準 庫 銜接 HAL 庫 沒 說學過 標準 庫 過後 碰 STM32CubeMX 配置 專案 陌生 眼裡 標準 庫 刪掉 一堆 功能 函示 作 精簡 版本 STM32CubeMX 安裝 描述 建立 1 新 專案 GPIO 點亮 LED 點 開來 STM32CubeMX 軟 體會 畫面 上圖 ACCESS TO MCU SELECTOR 創建 專案 開 完後會 下圖 選擇 MCU MPU 型號 列表 假設 身邊 ST 官方 出 開發板 選擇 第二項 開發板 型號 做 創建 專案 選擇 STM32F030CC MCU 型號 選擇 身邊 開發 版 MCU 型號 做 選擇 影響 亮 LED 範例 左 半邊 MCU MPU 規格 做 篩選 選擇 好後後會 反黑 再點 右上角 Start Project 專案 會 配置 函示 介面 要來 配置 燒入 程式 IO 口 SWCLK SWDIO 1 點選 SYS 2 點選 Debug Serial Wire 配置 燒錄 口 3 會 顯示 兩個 角位 框框 綠色 兩個 選項 作用 用來 喚醒 MCU MCU 休眠 IO 口 不到 先 選取 再來 選取 左邊 GPIO 選項 對著 右邊 MCU 選擇 配置 GPIO 口 1 點選 GPIO 2 點選 IO 口 會 跳出 1 選單 再選 功能 選 PA1 GPIO Output 選完 介面 會 跳出 進階 設定 下圖 左上方 界面 1 PA1 一排 規格 下方 則是 PA1 初始化 1 GPIO output level GPIO 口 默認 狀態 配置 High Low 2 GPIO mode GPIO 口 模式 配置 成 Output Push Pull Output Open Drain 模式 差別 文章 提到 3 GPIO Pull up Pull down GPIO 口 內部 上拉 VDD 下拉 GND 不上 拉 不下 拉 4 Maximum output speed GPIO 口 輸出 速度 配置 高速 中速 低速 數值 查看 參考手冊 GPIO 章節 5 User Label 這是 定義 IO 口 名稱 宏 定義 define LED TEST 則會 MCU 介面 註解 感覺 程式碼 部 分則 會 專案 裡的 main h 下圖 GPIO 口 配置 再來 開啟 RCC MCU 震盪 才 會 工作 點開 左邊 RCC 選項 會 下圖 介面 1 點選 RCC 2 選擇 想 開起 外部 時鐘 兩個 外部 時鐘 焊上去 選擇 外部 高速 時因 震盪 3 顯示 兩個 角位 配置 成 外部 高速 石英 震盪 Clock Configuration 要用 IO 口 開好 再來 Clock Configuration 時鐘 樹 RCC 詳細 設置 點選 上方 Clock Configuration 1 點選 上方 Clock Configuration 配置 時鐘 樹 2 設定 外部 石英 震盪 速度 4 32 代表 說 只能 掛 石英 開發 版 3 PLL 數據 多工器 選擇 HSE HSI 選擇 HSE 4 選擇 6 倍頻 想 這顆 MCU 工作頻率 48MHz 每顆 mcu 工作 頻率 一點 高階 一點 MCU IO 口 工作頻率 會 喔 Datasheet 裡的 調 7 框框 會變 紅色 提示 錯誤 配置 5 系統 Clock 來源 選擇 PLLCLK 6 PCLK1 APB1 總線 速度 48MHz 原因 APB1 GPIO 口上 控制線 Project Manager 再來 創造 專案 設定 點選 上方 Project Manager 1 Project Settings 專案 設置 Project Name 專案 名稱 設置 h01 GPIO 設置 中文 Project Location 專案 要放 路徑 選擇 D 槽 創建 1 STM32CubeMXLib 空 資料夾 Application Struture 應用程式 結構 這裏 包含 兩個 選項 Basic 基礎 結構 包含 中間件 RTOS 文件系統 USB 設備 Advanced 包含 中間件 針對 一點 工程 設定 Basic 模式 Toolchain Folder Location 這會 Project Location 專案 路徑 建立 資料夾 名稱 Project Name Toolchain IDE 選擇 編譯 軟體 選擇 MDK ARM Keil5 習慣 Keil5 喜好 瞜 版本 選 2 Linker Settings 堆棧 設置 這部分 預設 牽扯 程式碼 運行 速度 入門 這行 先 玩 地方 動到 s 檔 組合 語言 完過 再來 理解 設置 用意 3 Thread safe Settings 官方 使用手冊 完 懂 Keil5 STM32CubeIDE 勾選 Enble multi threaded support 4 Mcu Firmware Package 不用 動 預設 選擇 要用 HAL 庫 版本 Code Generator 來點 選 左 半邊 Code Generator 代碼生成 器 地方 設定 代碼 樣子 1 STM32Cube MCU packages embedded software packs Copy used libraries into project folder 過的庫 複製到 項目 文件夾 中 地方 勾 工程 才 會 包含 功能 庫 查看 功能 樣 函示 Copy only necessary library files 複製 庫 文件 CAN SPI I2C 外設 功能 新增 相關 庫 文件 工程 Add necessary library files reference toolchain project configuration file 工具 鏈 項目 配置文件 中 添加 庫 文件 作爲 參考 勾選 HAL 庫 驅動 文件 只會 配置 初始 函示 我要 點亮 1 LED 勾選 選項 就要 寫 操作 暫存器 賦予 值 像是 暫存器 開發 剛 勾 1 快速 基本功能 2 Generated files 生成 文件 需求 選擇 習慣 功能 函示 地方 居住 勾選 1 選項 像是 標準 庫 開發 方式 興趣 鐵人 文章 再來 2 不想 每次 生成 程式 備份 舊 3 個則 每次 新 文件 時 取代 掉 原本 程式 Generate peripheral initialization a pair ' c h ' files per peripheral 外設 生成 獨立 ' c h ' 文件 勾 初始化 代碼 生成 main c 勾選 初始化 代碼生成 外設 文件 UART 初始化 代碼生成 uart c 中 Backup previously generated files when re generating 生成 時 備份 生成 文件 生成 代碼 時 會 相關 目錄 中 生成 Backup 文件夾 源文件 拷貝到 Keep User Code when re generating 生成 時 保留 用戶 代碼 main c 中 添加 一段 代碼 生成 時 會 main c 中 保留 添加 這段 代碼 前提 這段 代碼 寫 位置 BEGIN END 之間 會 刪除 Delete previously generated files when re generated 刪除 生成 生成 文件 假設 生成 i2c c 重新配置 i2c c 則會 刪除 i2c c 文件 3 HAL Settings HAL 庫 設置 Set free pins analog optimize power consumption 空閒 引腳 設置 爲 類比 輸入 做 低功耗 產品 時 選項 勾選 nable Full Assert 使能 斷言 參數 檢查 Template Settings 模板 設置 預設 興趣 參考 最新 用戶手冊 6 節 Custom code generation 內容 Advanced Settings Driver Selector 選擇 庫 做 驅動 HAL 庫 LL 庫 兩個 差別 做 解釋 不在 描述 Generated Function Calls 調用函數 兩個 選項 Not Generate Function Call Visibility Static 1 Do Not Generate Function Call 生成 函數調用 代碼 調用 初始化 函數 GPIO 項勾選 Do Not Generate Function Call main c 函數 中 調用 MX GPIO Init 函數 選擇 調用 設定 GENERATE CODE 完過 一下子 會 視窗 選擇 左邊 1 開啟 專案 資料夾 點開 MDK ARM 會 下圖 點開 h01 GPIO 專案 寫 程式 main c 4 行 插上 LED PA1 會 閃爍 花 半天 這篇文 會想 整理 好處 想 傳承 實驗室 學弟 妹 傳承 包跨 鐵人 賽 文章 操作 疑問 提",
    "以下內容 同步 更新 接下來 內容 要將 測試 案例 變得 更 測試 案例 建立 資料 輸入 正確 資料 則回 成功 資料 回傳 400 並跟 使用者 錯 未來 針對 屬性 會 go playground validator 功能 這段 內容 透過 validator 錯誤 透過 validator 轉換 使用者 輸入 內容 還缺 這次 code 轉寫 影片",
    "網格 機器人 改成 一周 開啟 周五 機器人 會 自動 關閉",
    "文章 同步 更新 接下來 測試 勢必 建立 interface 新增 mock interface 未來 interface 擴增 輸入 指令 gomock 官網 中 提到 想要 批次 建立 mock file 透過 批量 go generate 原理 透過 註解 方式 執行 語法 搭配 mockgen 根目錄 執行 ... 當前目錄 ... 目錄 字串 路徑 參考 做 資料夾 中 檔案 go generate 跑 一遍 未來 會 忘記 這段 指令 這時候 就用到 工具 Makefile 工具 幫 很多 系統 使令 統一 放到 檔案 中 透過 執行 檔案 寫法 存放 Makefile 路徑 執行 會 幫 執行 PHONY Makefile 執行 指令 拿來 做 compile 會 建議 執行 指令 指令 檔案 放到 PHONY 放在 PHONY 裡的 內容 Makefile 執行 才 會 辨別 有沒有 改變 舉 個例 子 剛好 有個 檔案 generate 第一次 執行 他會 實行 go generate ... 第二次 執行 時 generate PHONY 中 Makefile 判斷 會 generate 變動 執行 go generate ... 詳細 內容 網路上 查看 更 資料 僅用 執行 指令 附上 這次 comment 紀錄",
    "文章 同步 更新 大致 api 開設 這次 專案 中 預計 會 實作 測試 request 完整 執行 實作 測試 案例 寫 程式 中 頻繁 測試 向下兼容 這次 測試 到來 測試 範本 這次 寫 測試 案例 http request input output 參考 echo 官網 測試 案例 撰寫 這次 gomock mock 來將 程式 中 有用 依賴 interface 做 替換 測試 案例 中 自由選擇 method 預期 輸出 這次 測試 案例 中 IRequest 中 換成 gomock struct 然 程式 中 Get 變得 自由 控制 預期 輸入 輸出 詳細 參考 golang 中 想要 mock 內容 種 方式 附上 找到 的還 不錯 參考 這次 code 編輯 影片 過程 參考 備註 撰寫 程式 當下 釋出 第二 版 想 v2 ginkgo 先 專案 執行 專案 go mod ginkgo 升級成 v2 再來 來將 系統 cli 更新",
    "上架 打包 APK 1 選 Buile Generate Signed Bundle APK 2 選 APK 一步 3 簽章 檔 4 存放 位置 5 輸入 檔名 只能 英文 副 檔名 jks OK 6 文件 密碼 123456 7 Alias key0 別名 預設 8 Validity years 代表 key 多久 代表 25 年 9 填 O 痾 金鑰 10 一步 一步 11 12 選 release 才 上架 13 apk 檔案 上架 14 google play 網站 15 建立 應用程式 16 名稱 中文 17 V 18 長 資訊 主頁 19 寫 一連串 .... 20 存取 權 開放 儲存 儲存 21 ... 廣告 不含 廣告 分級 填 問卷 對象 剩下 圖片 22 鎖住 代表 有沒有 做 完 23 選取 國家 24 放上 剛剛 做 APK 建立 版本 7 天審 核才 有沒有 上傳 ... 从 2021 年 11 月 开始 新版 应用 必须 API 级别 30 更 高 版本 为 目标 运行 环境 一篇",
    "先前 文章 中 探討 中斷 異常 UNIX Like Shell 實作 方式 本篇 文章 中 作者 會 嘗試 實作 系統 呼叫 Shell mini riscv os 當中 透過 Shell 學習 fork exit 系統 呼叫 系統 呼叫 System Call 作業系統 提供 User space 應用程式 調用 系統 呼叫 作業系統 便會 User space 切換 Kernel space 作業系統 完該 系統 呼叫 才 會 切換 回 User space 上圖 取自 精簡 UNIX Shell 流程圖 Shell 會 讀取 來自 使用者 輸入 命令 呼叫 fork 作業系統 複製 狀態 母 程序 子程序 On success PID child process returned parent 0 returned child -- 子程序 作業系統 母與子 程序 會 fork return value 判斷 程序 後者 執行 母 程序 呼叫 wait 系統 呼叫 等待 子程序 結束 執行 執行 子程序 則將 剛剛 分析 完 使用者 命令 帶入 exec 系統 呼叫 載入 執行 指定 檔案 子程序 結束 母 程序 會 循環 等待 使用者 下達 新 命令 補充 Copy On Write 作業系統 接受 fork 系統 呼叫 會 將母 程序 內容 複製 子程序 母 程序 子程序 持有 Stack 並非 一塊 若要 fork 時 完整 Copy 整份 Stack 內容 浪費 效能 針對 作業系統 採用 Copy On Write 技術 假設 母 程序 Stack 存放 counter 變數 呼叫 fork 子程序 參考 一塊 記憶體 狀況 會 持續 一方 嘗試 修改 counter 變數 修改 方會將 counter 內容 放到 新 記憶體 位址 修改 持有 一份 做 節省 記憶體 空間 fork 帶來 額外 開銷 正題 實作 系統 呼叫 簡易 Shell 尚未 實作 fork 系統 呼叫 下方 身影 先 略過 實作 系統 呼叫 剛剛 提到 User space 應用程式 調用 系統 呼叫 作業系統 便會 User space 切換 Kernel space 需求 系統 中斷 Interrupt 0 Exception 11 描述 Environment call M mode Environment call ecall 即可 組合 語言 幾個 函式 提供 C 語言 呼叫 呼叫 列出 函式 函式 會將 系統 呼叫 號碼 放入 a7 暫存器 執行 ecall Machin mode Environment call 會 交由 do syscall do syscall 會以 a7 暫存器 儲存 號碼 判斷 系統 呼叫 做出 exec exit 為例 exec 呼叫 系統 會將 希望 執行 程式 位址 參數 傳入 覆寫 掉 pc 位址 exit 呼叫 系統 會 Task 移除 並將 pc 複寫 os kernel 位址 會將 希望 執行 程式 位址 參數 傳入 exec 函式 作業系統 完整 檔案 系統 實作 執行 檔案 概念 彌補 缺陷 選擇 事先 構造 app table 作業系統 開機 執行 user init 時 先 註冊 User Program Program 簡易 函式 透過 函式 指標 方式 註冊 OS 實作 mini shell 實作 mini shell 筆者 發現 lib puts 執行 時 使用者 還沒 輸入 命令 Shell 發生 時間 中斷 等到 完 中斷 回到 Task 時 會 正確 執行 小心 存取 記憶體 空間 作業系統 會 Fault load Fault store 狀況 系統 還沒 實作 fork file system unix shell 一套 方法 拿來 筆者 花 一點 時間 解答 lib puts 執行 時 需 特別 關閉 開啟 interrupt enable BTW 請 先將 exteral handler 中 UART 中斷 handler 移除 使用者 輸入 字元 當下 系統 會 uart register 內容 印出來 等到 shell 要用 讀 不到 內容 Program counter 執行 一條 指令 中斷 異常 Program counter 繼續執行 發生 異常 指令 會 死循環 稍微 修改 trap handler 即可 改用 task create 替代 剛剛 提到 筆者 構造 user table 用來 存放 簡易 user program 讀取 命令 找到 命令 函式 丟給 task create 當作 fork 替代 方案 確保 使用者 輸入 命令 系統 立刻 需求 縮短 作業系統 排程 切換 時間 lib delay 保證系統 會 馬上 切換 user program 這次 實驗 使用者 體驗 mini riscv os 互動 快樂 更動 還沒 patch back 回 mini riscv os 之中 修改 專案 底下 原因 幾點 改動 幅度 大 系統 呼叫 shell 完整 應 改以 方式 排程 非 Timer Interrupt UART 中斷 當下 uart register 內容 buffer 等到 lib puts 要用 時 存取 buffer 專案 諸多 缺點 但作 學習 作業系統 敲門磚 價值 賞我 Star 感謝 貢獻 gethid 實作 構建 系統 呼叫 雛形 Reference",
    "前言 想不到 草稿 還能 寫 代碼 重構 情況 回頭 修 文章 bug 機率 不大 reCAPTCHA google 推出 機器人 服務 幫忙 過濾 機器人 流量 V3 版本 為例 google 會 使用者 判斷 使用者 機器人 使用者 花 時間 去點 圖形 先到 reCAPTCHA 官網 申請 帳號 網域 地方 輸入 網域 有趣 想 本地 測試 輸入 127.0 0.1 會 兩組 金鑰 一組 用於 前端 另一組 則是 放在 server 隨意 公開 描述 reCAPTCHA 綁訂 按鈕 這方 法較 彈性 一種 方法 假設 希望 發出 登陸 請求 使用者 機器人 打開 sign js 將登入 地方 改寫 解釋 當按 送 出 表單 會先 請求 發給 google 檢查 是否是 機器人 google 會 回應 一組 token 接著將 這組 token 使用者 資料 送到 台 台 要將 這筆 token 送給 google 這位 使用者 分數 過程 另一組 金鑰來 認證 middleware auth go 補上 router package 選擇 想要 檢查 是否是 機器人 路徑 接上 middleware serve auth go 補上 發送 請求 google google 回應 google 判斷 分數 CheckRobot 內 補上 分數 以此 做 邏輯 無視 掉 太 機器人 分數 小於 自訂 score 值 請求 CheckRobot 內 補上",
    "光看 圖片 發現 ST 提供 各式 畫圖 function 方形 外框 全 填滿 DrawRect FillRect 圓形 外框 全 填滿 DrawCircle FillCircle 三角形 外框 全 填滿 DrawPolygon FillPolygon 橢圓形 外框 全 填滿 DrawEllipse FillEllipse 劃線 DrawLine 垂直 水平 DrawVLine DrawHLine 測試 過後 才 三角形 ... 光看 英文 多邊形 才 只能 畫 三角形 導致 我畫 出 啾 啾 BSP LCD DrawPolygon Points 3 BSP LCD FillPolygon Points2 3 原本 兩行 畫出 那種 三角形 依樣畫葫蘆 才 改成 直角三角形 Polygon 多邊形 改 參數 BSP LCD FillPolygon Points4 4 Point Points4 260 150 260 170 290 150 290 170 錯 不信邪 改 畫圖 區塊 Point Points4 260 150 290 150 260 170 290 170 function 適合 三角形 ..................................... 想 會 錯誤 思考 順序 圖案 這才 發現 給的 x y 順序 像是 調整 順序 Point Points4 260 150 290 150 290 170 260 170 認知 四邊形 試試看 Point Points4 260 150 290 150 290 170 275 185 260 170 結論 給的 X Y 座標 順序 圍起來 區塊 才 它畫 算是 還他 清白",
    "參加 鐵人 賽 用意 開發 版 STM32F746 開發 版 好康 事情 參加 開賽 前 統計 報名 人數 初期 統計 參加 人數 統計 完賽 人數 好不容易 撐 完 30 天 發現 完賽 沒 這塊 板子 鐵定 到手 正題 這塊 板子 送到 光看 這面 發現 SPDIF 接頭 CAMERA uSD 右邊 兩個 按鈕 user 操作 reset 右邊 jump 控制 電源 輸入 四個 選擇 5v ext 5v link usb fs usb hs jump 下方 5v ext 下方 下方 ETHERNET 3.5 音源 輸入 輸出 另一面 則是 塊 觸控 面板 這是 上電 顯示 畫面 燒 CODE 稍微 玩 感覺 不錯 很快 M7 效能 順暢 媲美 手機 順暢 度 接下來 回到 RD 安裝 Driver en stsw link009 v2.0 2 安裝 IDE en st stm32cubeide 1.8 0 11526 20211126 0815 x86 64 exe v1.8 0 看起來 IDE 維護 更新 再來 亂搞 IDE 抓 sample code 跑 抓 幾個 試試看 剩下 動手 改寫 發現 網路 居然 燒錄 那份 demo code 那份 超棒 提供 那份 source code 學習 學習 難道 找 Arm 窗口 索取 私下 找 Odin 問問 Jack 會 那份 source code 觸控 音效 檔案 讀寫 效能 抓取 畫圖 解讀 地方 這塊 板子 會 順手 初 接觸 這塊 板子 小小 心得",
    "燙傷 手 停 幾天 差不多 15 天 好像 交代 完 東西 剩下 大部分 冷門 Grid Layout Module Level 2 事情 支援 度 商榷 講 一點 手是 了點 倒 不用 太 擔心 Grid 耐心 假設 Grid Layout Module 基本操作 方式 來看 Grid 到底 情況 事情 事情 做 地方 很多 單 討論 做 不到 地方 快 非矩 型 區塊 非矩 型 區塊 非矩 型 區塊 基本上 想要 Grid 實作 Layout 有太大 非矩 型 區塊 設計 基本上 Grid 製作 如同 div 盛行 年代 東西 Grid 來排 潮 做 例外 說 意外 章節 來說 例外 地方 無限 寬度 高度 物件 隱 性格 線 瀏覽器 Bug 間隔 尺寸 消滅 零 尺寸 網格 軌道 fr 演算 規則 fit content 演算 規則 minmax 演算 規則 基本上 製作 格線 系統 留意 地方 大方向 矩型 區塊 地方 機會 Layout 發生 奇怪 事情 會 莫名其妙 地方 例子 贅述 前述 章節 提到 最讓人 麻煩 瀏覽器 實作 說 Grid 多年 瀏覽器 網格 實作 渲染 方式 略有 差異 主流 瀏覽器 Grid 渲染 有太多 例外 這也 Microsoft Edge Chromium 協助 重寫 新 渲染 引擎 說 Issue 回報 Chromium 笑 哪一天 會 回到 Chrome 身上 看起來 Edge 93 會用 新 GridNG 實際上 查詢 Microsoft 特別 提到 這件 事情 期待 畢竟 Grid Layout Level 2 支援 樂見 其成 謹慎 設定 網格 軌道 會 發現 一篇 會 講到 尺寸 事情 會 發現 固定 尺寸 網格 容器 彈性 尺寸 網格 容器 網格 軌道 設定 稍有不慎 網格 容器 尺寸 基本上 形同虛設 會 網格 軌道 爆掉 網格 單元 指定 超出 軌道 數量 方向 跨 網格 單元 超出 軌道 數量 方向 網格 單元 命名 網格 隱性 軌道 尺寸 總和 大於 網格 容器 grid template 寫錯 懷疑 一點 合法 寫法 想 做 寫 複製 貼 改 狀況 不少 俗語 好像 知其然 不知 所以然 隱 性格 線 瀏覽器 渲染 設定 雷 有沒有 發現 提及 隱 性格 線時 特別 著墨 軌道 格線 數字 有雷 燦笑 提到 網格 系統 爆掉 事情 故意 想 善用 隱 性格 線來 幫 做些 事情 留意 隱 性格 線 軌道 數字 舉個 例子 渲染 貼上來 先 設定 來看 渲染 測試 瀏覽器 Google Chrome 97.0 4692.71 Firefox 96.0 Microsoft Edge 97.0 1072.55 Safari 15.1 17612.2 9.1 20 基本上 畫面 放 Chrome Safari Safari ModernIE 美名 這次 算是 蠻 合群 顯而易見 我為 了將 差異 作 特意 指定 grid auto column grid auto row 數值 gap 設定 10px 狀況 先 列舉 auto 尺寸 演算 關係 尺寸 0 1 關係 gap 第二條 線 關係 隱性 網格 列入 負數 網格 計算 內 3 關係 行 方向 1 2 列 方向 1 4 狀況 換個 方向 會 成立 不用 太 失望 該會 怪怪的 地方 row 轉向 column 會 自動 變好 gap 消滅 合併 取消 gap grid auto column grid auto row 數值 取消 那畫 畫面 毛病 說 打算 好好 規劃 grid template grid template area 請 隱 性格 線 帶來 小結 主流 瀏覽器 來看 Grid 支援 度 各家 渲染 狀況 太 奇怪 落差 主流 市場 CSS Framework 真的 在意 Framework 到底 Flexbox Grid 章節 會聊 Media Query Grid 演算 機制 回見 目錄 小節 部落 格 同步 放送",
    "Show html 資料 查詢 呈現 多出 操作 像是 編輯 刪除 ... Show html 加上 client 端 jQuery 存取 呼叫 程式 擴充 操作 相關 連結 編輯 傳入 產品類別 ID 頁面 跳轉 後續 資料 回填 刪除 針對 特定 產品類別 ID 呼叫 HTTP Delete 即可 擴充 編輯 Action Method Edite html client 端 jQuery 存取 呼叫 程式 GET 類型 GetSpecificCategoryById 用來 幫 資料 查詢 用來 後續 回填 畫面 PUT 類型 UpdateCategory 用來 呼叫 端 編輯 更新 運行 效果 畫面 By CategoryID 回填 更改 執行 編輯 更新 擴充 刪除 Action Method 運行 效果 刪除 API 存取 採用 同步 方式 確保 entity 取到 null null 例外 錯誤 此會 發現 Entity Framework 更新 寫法 所寫 方式 事實上 EntityFramework 中有 多種 更新 寫法 文章 net core MVC 更新 採用 context Update 實體 context SaveChanges context SaveChangesAsync net core WebAPI 採用 context Entry 實體 State EntityState Modified context SaveChanges context SaveChangesAsync 若想 觀察 EF Core SQL 指令 Startup cs 引入 using Microsoft Extensions Logging 調整 ConfigureServices 再次 執行 編輯 觀察 到當 執行 SaveChange EF 底層 執行 SQL script 輸出 視窗 中 記得 調整 net core 才 預設 帶 參數值 版本 啟動 敏感 資料 log 機制 即可 MVC context Update 實體 SQL 語句 WebAPI context Entry 實體 State EntityState Modified SQL 語句 執行 state 變更 句 事實上 處於 Detached 狀態 標記 Modified 才 會 變更 追蹤 EF 中 EntityState 共分 幾種 改 MVC Update 寫法 看起來 欄位 更新 事實上 兩種 寫法 針對 資料 物件 欄位 做 更新 寫法 Update 事實上 標記 Modified 做 變更 追蹤 更新 兩種 寫法 設計 接收 並覆寫 做法 預設 Entity 狀態 處於 Detached 改 採用 先 查詢 更新 預設 既有 DB 取出 Entity 狀態 追蹤 中 改為 作法 先 DB 撈取 出 指定 entity 改 年齡 欄位 entity 預設 狀態 追蹤 中 不用 state 標記 呼叫 Update 更新 會 更新 變動 欄位 網上 時常 有人 EF 例子 寫 樣子 寫 事實上 update 潔癖 有要 更新 欄位 更新 若是則 先 DB 撈取 預設 會 attach Ref Modifying data via DbContext C# Entity Framework 更新 数据 三种 方法 C# NET Entity Framework Update Record Q A Entity Framework 更新 資料 表 欄位 觀察 EF Core SQL 指令 NET Core C# Entity Framework Core EF Core Update 更新 记录 方法 示例 代码 本篇 同步 發表 部落 格",
    "接續 Startup cs 中 啟用 靜態 資源 專案 新增 目錄 命名 wwwroot 會 自動 地球 圖示 wwwroot 引入 bs4 jquery3.6 測試 Client 端 UI 時 互動 存取 透過 jQuery 接著要 實作 產品 分類 資料 查詢 增加 新增 PCategoryController cs 新增 Action 查詢 Action Controllers PCategoryController cs 同步 形式 API 存取 透過 net core DI 建構 子 注入 DbContext Controller 程式 中 存取 異動 新增 靜態 資源 頁面 wwwroot PCategory Add html wwwroot PCategory Show html 運行 效果 ado net 搭配 寫法 寫法 基本上 採用 同步 API 存取 方式 基本上 單位 時間 內能 消化 請求 量 稱 吞吐 流通 量 Throughput 有限 會 阻塞 EFCore 支援 異步 存取 相關 API 方法 名 Async 後綴 改為 非 同步 API 存取 非 同步 異步 形式 API 存取 Ref The Ultimate Guide Async Await C# ASP NET 效能 調教 Async Await 非 同步 機制 加快 Web API 回應 時間 網站 測試工具 JMeter 教學 JMeter 網頁 壓力 測試 教學 NET Web 应用 中 为什么 async await 异步 编程 非 同步 程式設計 真的 提升 整體 應用程式 執行 效能 ASP NET async 心法 本篇 同步 發表 部落 格",
    "專案 前置 建立 配置 visual studio net core web api 專案 net5 專案 中 預設 OpenAPI 勾選 會 自動 配置 Swagger 文檔 相關 dll 設定 預設 Swashbuckle AspNetCore 預設 專案 Startup cs 運行 專案 預設 會 跳轉 swagger swagger UI 畫面 Properties launchSettings json launchUrl swagger 設定 關係 EF Core 安裝 Microsoft EntityFrameworkCore sqlserver 此要 vs2019 net5 做 開發 太高版 EFCore 會 支援 vs2022 net6 改為 5.0 13 版本 6 x CodeFirst 開發 前置 一段時間 需求 分析 資料 朔模 會 產出 ERD 和表 關聯 簡單 產品 分類 產品 項目 資訊 設計 資料庫 中 兩張 table 關聯 資料 字典 Step1 資料 實體模型 一張 table Model Folder Models Product cs Models PCategory cs Step2 建立 DbContext 衍生 類 Data ProductDbContext cs Step3 appsettings json 配置 DB connection string Step4 Startup cs ConfigureServices DB 服務 依賴 注入 Startup cs 引入 命名 空間 using Microsoft EntityFrameworkCore using Net5EFCoreWebApiApp Data Startup cs Step5 至主 程式 Program cs 中 Main 實踐 第一次 執行 DB 上下文 建立 原先 程式碼 CreateHostBuilder args Build Run 刪掉 註解 掉 需 引入 命名 空間 Microsoft Extensions DependencyInjection using Microsoft Extensions DependencyInjection Program cs 希望 Web 應 用於 啟動時 會 Startup class 中 註冊 DB 上下文 服務 自行 建立 衍生 DbContext 物件 ProductDbContext 藉由 dbContext Database EnsureCreated 方法 創建 DB EnsureCreated 回傳 Boolean true 代表 新 資料庫 結構 建立 false 代表 資料庫 結構 不需 建立 啟動 先 觀察 SSMS 是還 AspNetEFCoreDb 資料庫 沿用 示範 ado net 資料庫 會 發現 啟動 完並 額外 新 table DB 兩種 方式 情境 情境 1 這是 全新 一項 專案 更改 DB 名稱 再重 執行 應用程式 想要 同一個 Db 既有 先 做 刪除 建立 Drop database exists dbContext Database EnsureDeleted 情境 2 這是 針對 既有 DB 搭配 EF 開發 沿用 示範 ado net 資料庫 AspNetEFCoreDb 資料庫 啟用 專案 migration 機制 透過 nuget 補 安裝 Microsoft EntityFrameworkCore Tools 第一 步驟 先 啟用 初始化 DB Migration 子 才能 EF Core 得知 捨 DB 遷移 變動 額外 補 增加 幾張 Table 既有 DB 當中 開啟 PMC Package Manager Console Tools NuGet Package Manager Package Manager Console 輸入 指令 EF 先 輸入 enable migrations 啟用 migration 機制 EF Core 不用 第二 步驟 程式 中 改為 dbContext Database Migrate 重啟 會 DB 目標 資料 表 既有 table 影響 資料 還在 不想 啟動專 方式 透過 指令 update database 應用程式 部屬 不太可能 類似 專案 中 人工 判斷 有無 初始化 等待 資料庫 遷移 程式 端 藉由 DbContext Database GetPendingMigrations Any 應用程式 做 判斷 最終 Program cs 程式 Ref Automatic migration Entity Framework Core Where should I put Database EnsureCreated EF core creating tables migrate method Database Migrate creating database but tables EF NET Core 2 How where call Database EnsureCreated Database Migrate Can ' t enable migrations Entity Framework VS 2017 NET Core Entity Framework 6 Code Frist 3 Migration commands Migrations Code First 大道 番外 Migrations 本篇 同步 發表 部落 格",
    "文章 同步 更新 官網 網頁 端 地給 存取 資料 功能 驗證 資料 正確 功能 使用者 提供 符合 需求 資料 時 主動 體醒 使用者 方向 改 資料 驗證 功能 這次 echo 官方 推薦 驗證 套件 這是 官網 介紹 validator 透過 宣告 注入 echo 中 同一個 validator 透過 方法 echo router 中 放入 validator 驗證 資料 這次 code 編輯 過程",
    "Swagger 剛 將其 理解 成 網頁 版本 postman 測試 發送 資料 回傳 預設 webapi 專案 WeatherForecastController 新增 post action 一份 json 測試 資料 嘗試 post 專案 中 中斷點 下方 則會 呈現 回應 curl 呼叫 語法 轉譯 Swagger 中若 想 自訂 API 文檔 外部 開發者 廠商 做 移至 Startup cs ConfigureServices 方法 API 官方 文件 會 習慣 寫 中英文 註解 描述 隻 API 功能 C# 專案 透過 XML 函數 method 上方 添加 功能 描述 註解 寫 API 子 呈現 別人 會 曉得 功能 目的 預設 專案 開啟 XML 註解 讀取 機制 開啟 本篇 同步 發表 部落 格",
    "前言 抱歉 打擾 XD 真的 太 想來 分享 厚著 臉皮 po 文了 XD 這次 參加 鐵人 賽 頒獎典禮 XD 得獎者 XD 私心 往下 會 XD 本日 正文 去年 第二次 參加 獎狀 有壓 參賽 題目 驚喜 地方 得獎者 專屬 badge 耶 醉翁之意不在酒 得獎者 千里迢迢 && 千方百計 參加 頒獎典禮 頒獎典禮 辦 輔仁大學 會問 輔仁大學 這次 東京 奧運 好幾個 優秀 選手 輔仁大學 唸書 三次 元 偶像 怡靜 昀 儒 輔大 學生 XD 想 輔大 相關 佈景 拍 XD 剛進 輔大 頒獎典禮 地點 一路上 怡靜 昀 儒 身影 正 小小 失望 ..... 重點 錯 XD 天無絕人之路 天無絕人之路 頒獎典禮 路上 詢問 輔大 學生 告訴 中美堂 會 運動選手 佈景 親切 指導 聖言 樓要 走到 中美堂 補充 捷運 站 會 佈景 循著 指示 終於 找到 太 感謝 這位 輔 大學生 T TTTTTTT 這裡講 看不到 說 妳是 好人 妳 會 一生 平安 課業 嗨 趴 補充 2020 年 鐵人 賽 團體 完賽禮 會 銅牌 XD 真的 太傷 成本 XD 理解 完賽禮 會 拿到 獎牌 XD 獎狀 有多壓 參賽 題目 真的 很棒 計劃性 去年 拿到 兩個 銅牌 帶 輔大 XD 終於 兩個 銅牌 怡靜昀 儒 兩個 銅牌 合照 夢想 回到 捷運 站 發現 真的 佈景 真的 非常感謝 iThome 鐵人 賽 主辦單位 主辦 這次 比賽 頒獎典禮 夢想 始料未及 事 XD 重點 再錯 真的 有種 去年 參加 鐵人 賽是 輔大 偶像 合照 夢想 錯覺 XD 後記 補充 回過 頭看 篇文章 發現 頒獎典禮 本身 描述 太少 XD 當天 獎狀 走 XD 補 一張 當天 照片 集錦 證明 好好 參與 頒獎典禮 事 XD 致謝 我要 先 感謝 參加 iThome 鐵人 賽 每位 參賽者 參與 精采 鐵人 賽 頒獎典禮 X PS 朝聖 有趣 事情 XD 再次 感謝 那位 親切 輔 大學生 妳 沒 辦法 夢想 再次 感謝 iThome 鐵人 賽 主辦單位 幕前幕後 工作人員 您們 辛苦 m m 還讓 參加 頒獎典禮 拿到 餐盒 飲料 這也 太好了 QAQ PS1 回家 吃 餐盒 好吃 很澎派 PS2 拍謝 那天 工作人員 還被 我問 奇怪 XD 希望 這次 鐵人 賽 會 再見 XD 期待 自虐 XDDDDDDDDDDDDDDDD Ado Lin 2022.01 10",
    "先前 Hueman 主題 plugin 花 時間 研究 才能 加進去 推薦 NexT 整合 plugin 修改 設定 檔 想像 美好 做 不少 ... Themes 架構 變更 NexT 主題 主題 會 安裝 themes 資料夾 底下 則是 放到 node modules 修改 樣式 設定 網站 根目錄 建立 config 主題 名稱 yml 檔案 調整 設定值 設定 檔 內容 node modules hexo theme next 資料夾 底下 找 config yml 複製 回 網站 根目錄 改 記得 改 檔名 會 原本 hexo config 衝突 作法 主題 原始 碼 更動 後續 更新 主題 版本 出 本篇 文章 版本 Hexo 5.4 0 NexT 8.8 2 左側 選單 顯示 最新 文章 NexT hexo related popular posts 套件 顯示 最新 文章 列表 功能 套件 沒 辦法 運作 網路上 不少 教學 文章 NexT 架構 檔案 格式 swig 改成 njk 舊 文章 貼 成功 設定 步驟 修改 config next js 設定 定 樣式 檔案 近期 文章 設定 網站 根目錄 source 資料夾 新增 data 資料夾 建立 sidebar njk 檔案 sidebar njk 檔案 段 程式碼 swig 版本 差 toArray 生成 頁面 參考 文章 導入 Google Analytics NexT 做好 相關 配置 config next js 設定 追蹤 ID NexT 文件 中有 UA 開頭 網路 教學 做 只會 拿到 G 開頭 追蹤 碼 參考 下個 步驟 連結 乖乖 申請 UA 開頭 追蹤 碼 沒 分享 不吝指教 謝謝",
    "Update 01 10 EP approved 紀錄 這份 offer 時程 大 公司 關係 很多 relocation 事務 交給 專業 公司 有效率 溝通 順暢 新加坡 簽證 EP Employment Pass 新加坡 最高級 工作 簽證 薪資 至少 5000 新幣 影響 申請 因素 包含 國籍 學校 公司 產業 規模 職業 硬性 標準 MOM 新加坡 人力 部 判定 申請 EP 前會 雇主 做 Self Assessment Tool 都過 不了 送 機會 渺茫 SP WP 工作 簽 不到 研究 WP 真的 做工 LTVP Long Term Visit Pass DP Dependent ' s Pass 想帶 爸媽 LTVP EP 想 申請 薪水 達 門檻 配偶 子女 DP 持有 EP SP 薪水 超過 6k 申請 簽證 想要 工作 都還 申請 offer 後續 時程 【 11 30 】 HIRE RIGHT 背景 調查 開 跑 背景 調查 填 個資 打電話 學校 確認 真有 此人 HIRE RIGHT 有會 說 中文 稍微 知會 校方 【 12 9 】 Offer letter 簽完 送回 【 12 14 】 背調 FRAGOMEN 接棒 VISA 護照 快 到期 新加坡 入境 那天 6 月 效期 辦理 新 護照 延遲 禮拜 加錢 辦速件 ... 窮 【 12 29 】 EP application filed 【 01 10 】 EP approved IPA letter",
    "此次 修正 內容 將在 定義 資料庫 內容 pq schema 中 兩個 model 套用 設計 概念 error 放入 middleware 中 統一 error message 這次 改動 錄影 github 連結 附在 此處 請 自行 取用 測試 此次 更新 內容 留置 篇文章 文章 同步 發表",
    "滿常要 form submit 改成 AJAX 非 同步 送 表單 分享 template 非 Laravel 做 端 Laravel Response 範例 json 前端 status code 參考 建議 無腦 200",
    "1 Grid Optimizer 原本 4 年 資料 回測 改成 5 年 00646 改 00662 2 Gridbot 移除 不到 除錯 程式碼 過度 交易 threshold 改成 max 2000 總資產 0.5% 3 Gridbot 更新 網格 策略 參數 祝 新年快樂",
    "一套 web api 管理 測試 工具 協助 提供 自訂 API 規格 文件 呼叫 回應 方式 描述 台 中 交通 API 案例 2015 年 Swagger 捐贈 OpenAPI 計畫 OpenAPI 別稱 習慣 OpenAPI 視為 一種 規範 Swagger 則是 實踐 規範 工具 OpenAPI 注重 開發者 寫 API 調用 呼叫者 合作 不用 透過 程式碼 存取 OpenAPI 規範 訪問 URL HTTP Method 採用 何種 GET PUT POST ... 參數 資料 型別 用戶端 呼叫 更能 二次開發 無縫 接軌 Swagger 相當於 OpenAPI 規範 發展 一系列 產品 品牌 旗下 諸多 工具 OpenAPIGenerator .... Swagger UI 則是 提供 Web 介面 OpenAPI 規範 提供 資訊 NET Core 開發 框架 則可 透過 middleware 方式 註冊 NSwag Swashbuckle Swagger 3 Web UI Swagger 2 Web UI net core web api Swagger 配置 跑 幾篇 最終 產出 專案 配置 Nuget 套件 下載安裝 NSwag AspNetCore Starup ConfigureServices 方法 註冊 服務 Configure 啟用 OpenAPI SwaggerUI 中間件 見證 奇蹟 時刻 懶得 寫 API 文件 開發者 來說 真的 一大 福音 查看 Swagger API 自動 幫 掃描 API 方法 WEB API Document 預設 路由 swagger 會 自動 跳轉 swagger index html 真的 執行 存取 異動 Ref OpenAPI Specification Swagger OpenAPI ASP NET Core web API 檔 NSwag ASP NET Core 使用者 入門 Swashbuckle ASP NET Core 使用者 入門 本篇 同步 發表 部落 格",
    "數據 表格 陳列 畫面 上時 會 關鍵字 查詢 機制 新增 Search Action By 文章內容 標題 模糊 查詢 前端 畫面 jQuery Ajax 呼叫 查詢 回來 每次 呼叫 前 table tbody 清除 資料 重疊 本篇 同步 發表 部落 格",
    "操作 刪除 編輯 頁面 回填 By NewsId 查詢 Action 擴充 Show html 中 jQuery Ajax 呼叫 程式 畫面 調整 新增 操作 Column 附上 跳轉 Edit 頁面 刪除 功能 差別 在於 刪除 呼叫 js 端 觸發 刪除 一段 js 執行 編輯 則是 跳轉 特定 一頁 News Edit html 畫面 則是 By 特定 NewsId 查詢 回填 畫面 中 文章 分類 下拉 選單 則是 額外 ajax 存取 查詢 回填 type id 吻合 設置 預設 選取 狀態 剩下 編輯 表單 更新 提交 前端 jQuery 觸發 呼叫 效果 before after 本篇 同步 發表 部落 格",
    "幾個 開發方式 漸漸 了解 端 分離 開發方式 新聞 文章 表格 陳列 Controller 新增 Show 查詢 動作 方法 wwwroot News Show html 有個 在於 文章 類別 顯示 ID 流水號 看不懂 改為 中文 定義 顯示 NewsInfo Model 中 擴充 TypeName 並在 NewsController 擴充 方法 GetNewsTypeNameById Show html 簡單 ID 替換成 newsTypeName 本篇 同步 發表 部落 格",
    "新聞 類別 相關 增刪 改查 要來 新聞 文章 增刪 改查 功能 導入 新建 NewsController wwwroot 額外 建立 News 目錄 新增 添加 新聞 文章 頁面 表單 Add html 網頁 UI 元素 中 時常 會 透過 DB 動態 撈取 資料 作 綁定 微粒 綁定 下拉 選單 新聞 類別 藉由 jQuery 呼叫 端 API 方式 GET 查出 綁定 完善 NewsController 新增 insert 新聞 文章 Action Add html 前端 增加 Ajax 呼叫 隨意 挑 一篇 新聞 文章 嘗試 新增 本篇 同步 發表 部落 格",
    "前言 說 useCallback useMemo 時機 模糊 透過 篇文章 釐清 觀念 一點 不用 盲目 反而 更耗 效能 React 底層 記憶 值 消耗 效能 Referential Equality 先 複習 Referential Equality 理解 內容 會 陣列 物件 函式 物件 型別 擁有 call reference 特性 兩個 物件 元素 屬性 函式 內容 做 時 會 false React 關係 useCallback 時機 Referential Equality 案例 1 範例 React memo 包覆 元件 Child 接收 函式 onClick 當作 props 父 元件 渲染 時 同一個 函式 函式 React memo 會以 傳入 props 改變 渲染 Child 元件 加上 useCallback Referential Equality 案例 2 useEffect dependency array 元素 物件 型 別時 物件 會 useEffect 當作 dependency array 改變 例子 useEffect 無限 render 加上 useCallback 範例 類似 例子 pjchender 大大的 提到 興趣 讀者 跳 useEffect dependencies 中 放入 函式 useCallback 段落 閱讀 useMemo 時機 1 Referential Equality Referential Equality 概念 套用 useMemo 留意 useEffect dependency array 2 計算 開銷 較大 值 filter 很多 元素 陣列 數學 運算 參考資料 推薦 閱讀",
    "星期四 12 14 大盤 跌幅 近 百分點 市場 哀嚎 散戶 犯 錯 大漲 找 理由 大跌 狂找 原因 常聽到 美股 大跌 才 拖累 大盤 Fed 主席 鮑爾又講 才 導致 大跌 預設 任何原因 猜 不到 市場 單一 力量 說了算 這時候 因素 一點 意義 反觀 檢視 持股 到達 停損 位階 身為 投資人 認清 一點 一點 賺錢 賠錢 外 次要 一個多月 農曆 過年 關心 大盤 究竟 攻 上萬 八 總共 三次 挑戰 萬八 失敗 坐收 畢竟 萬八是 歷史 高點 順利 站上 沒 失敗 一會 有人 套牢 衝破 關卡 先將 套牢 賣壓 消化 掉 每次 大跌 跌幅 更 跌破 支撐 沒有支撐 14 號這跟 黑 K 一舉 跌破 10 日 月 線 三天 內 站上 月線 會 找 季線 支撐 那天 外資 大賣 好家 官股 進場 護盤 稍微 止血 15 號有 微漲 價量 背離 價漲 量減 至少 賣壓 理想 情況 14 號 下跌 嚇到 導致 15 號 恐慌性 出場 賣壓 危險 15 號 算是 初步 止跌 訊號 16 號有 機會 上攻 收盤 價漲量 增 算是 多頭 走勢 站上 均線 算是 現象 太 靠近 萬 八大關 未 站穩 會 震盪 情況 資金 部位 放太多 心態 陪樣 才 最要 才 每次 大跌",
    "寫 系統 程式 主題 跳進 Software Development 算是 大膽 嘗試 大學 時期 寫過 web 簡單 程式 來說 得獎 名單 作品 真的 又驚又喜 學生 時期 拿到 鐵人 賽 獎項 終極目標 想 為例 鼓勵 跳脫 舒適 圈 或許 不經意 間 生活 驚喜 更新 文章 預計 會 再補 fork wait exit ... 系統 呼叫 文章 執行 緒 程式 做 基礎 鋪墊 鐵人 發文 按鈕 一陣子 會 消失 文章 結構 大 調整 新 文章 會 優先 更新 確保 期望 順序 學習 系統 程式 還請 見諒 廢話 結束 C 程式 中 goto 工程師 之間 熱烈 討論 話題 有人 說 goto 會 破壞 程式 結構 有人 說 迴圈 何必 goto goto 大型 軟體 專案 實驗室 開發 關係 筆者 閱讀 大型 c 語言 專案 碰巧 讀到 篇文章 goto 更 認知 一般來說 goto C 語言 專案 很大 exception handling computed goto 開發者 C 語言 程式 出錯 時 回收 動態分配 記憶體 錯誤處理 確保 程式 下次 該函 式 時 工作 試想 一家 公司 開發 高效能 網路 程式 確保 程式 穩定 持續 工作 軟體 中 發生 錯誤 輕易 放過 2021 年 10 月初 Facebook 斷線 例子 來看 Facebook 長達 六小時 斷線 連帶 損失估計 超過 9 億美元 商業化 軟體 穩定性 後者 computed goto 才 筆者 想要 本文 分享 重點 computed goto 先前 淺談 分支 預測 Hazards 議題 一文 中 歸納 出 重點 分支 預測 失敗 會 導致 流水線 中 排序 指令流 清除 這也 處理器 不止 做 白工 還要 正確 指令 填充 回 流水線 再談 branch prediction 處理器 引入 如上圖 所示 分支 預測 方法 處理器 會以 address 索引 檢索 Pattern history table 歷史紀錄 進一步 做出 預測 computed goto computed goto 適用於 取代 switch case 基底 dispatcher switch 僅會 基底 分派任務 參考 子 說 會 抽象 程式碼 進一步 了解 概念 處理器 分支 預測 方式 來看 一段 程式碼 週期 會 jump 地方 會 導致 分支 預測 成功率 下降 反覆 填充 正確 指令 流水線 computed goto 會 麽 做 function 內 宣告 變數 時 static 關鍵字 變數 生命週期 延長 程式 結束 C C++ 中 地方 static 會 帶來 效果 特別注意 unary operator && gcc 提供 擴展 搭配 label 跳轉 位址 配合 goto 程式 訪問 code 跳轉 操作 做 好處 顯而易見 computed goto jump 操作 分成 好幾 正確 訪問 dispatch table 處理器 更 精準 預測 正確 分支 真實世界 例子 Computed goto efficient dispatch tables 一文 提到 computed goto 知名 軟體 Ruby 1.9 YARV also uses computed goto Dalvik Android Java VM computed goto Lua 5.2 uses a switch Jserv 老師 主導 開發 rv32emu next 引入 computed goto 實作 詳細 手法 參考 前 請 詳閱 公開 說明書 unary operator gcc 特別 提供 擴展 C 語言 專案 gcc 編譯 有人 下載 原始 碼且 採用 編譯器 編譯 會 錯誤 時 寫 makefile 使用者 做出 超出 預期 針對 編譯器 類別 做 偵測 目標 編譯器 非 gcc switch case 編譯 時 fno gcse fno crossjumping gcc 優化 原始 碼 Reference",
    "1 開啟 網格 機器人 流程 改成 1 執行 網格 機器人 2 讀取 money 變數 現金 部位 大小 3 讀 取現 股 部位 大小 4 印出 機器人 總資產 現股 現金 5 問 使用者 加減 碼 money 變數 做 操作 6 執行 機器人 交易 7 下午 兩點 關閉 機器人 money 變數 寫到 檔案 2 改用 機器人 紀錄 成交 回報 金額 計算 機器人 現金 部位 增減 不再 仰賴 帳戶 餘額 交割 金",
    "佳作 承蒙 評審 給予 肯定 感謝 方式 狗尾續貂 一番 沈澱 一個多月 時常 咀嚼 結語 中 故作 輕鬆 豪語 先抓 2025 Q4 釋出 Hoddarla 1.0 版 鐵人 賽畢 回歸 日常 鬆開 鎖 走下 大怒 神 雲霄飛車 座椅 感覺 方才 經歷 瞬間 帶來 極 深刻 感官 體驗 日後 鼓起勇氣 挑戰 足夠 把握 刺激 遊園 設施 經驗 類比 部份 先前 規劃 2025 Q4 時間 盡頭 時間 到達 盡頭 作業系統 典範 概念 工程 原則 破壞 創新 沿襲 有太多 矛盾 本身 隱式 專案 宣言 side project 原始 本能 之中 提取 足夠 能量 核心 動力 而後 才 啟動 設定 目標 階段 一步步 回顧 改善 這份 能量 空乏 也許 需 挪作 他途 也許 資源 耗竭 哪裏 達成 目標 Hoddarla 兩年 生命 本身 類似 向度 思考 大部分 一文 之中 持續 久 非 獨有 沉吟 這末 篇 將會 連狗尾 等級 引 2 來源 希望 讀者 諸君 一同 品味 我將 Hoddarla 1.0 目標 擱置 也許 酐 醉 深處 underflow 恰到好處 醒覺 說不定 這場 演講 來自 開放 系統 架構 論壇 2021 技術 年會 連動 OSDI 研討會 Key Note 講座 精彩 Key Note 需 富含 領域 深度 洞見 這場 講座 不缺 而論 啟 發性 娛樂性 更是 這場 講座 津津樂道 處 一兩個 月 稍微 作業系統 主題 會 這場 講座 參照 延伸 討論 講者 Timothy Roscoe 一位 帶領 ETH Zurich 系統 部門 業界 先進 開場 雞蛋 高牆 式 高 反差 手法 指出 OSDI 作業系統 領域 影響力 一份 刊物 之中 作業系統 本身 學術論文 僅是 論文 之中 Linux 實驗 平臺 之外 作業系統 研究 稀缺 一年 一兩篇 程度 思考 作業系統 相關 哲學 決不會 陌生 作業系統 到底 Linux 講者 給出 很強 斷言 Linux 作業系統 研究 領域 高 佔 見樹 不見 林 實際上 就算 Linux 之外 作業系統 設計 研究 Linux 共享 一項 硬體 假設 ccNUMA 架構 CPU 叢集 來說 記憶體 存取 遠近 親疏 之別 之間 cache coherent 就此 破題 講者 列舉 一點 ccNUMA 系統 方塊圖 說 Linux ccNUMA 架構 而生 作業系統 實際上 控制 真實 硬體 CPU 記憶體 真實 硬體 元件 解離 情境 作業系統 透過 driver 稍微 接觸 邊疆 民 有趣 這也 催生 領域 研究 機會 領域 cross SoC 研究 計算機 架構 研究 來說 改 架構 理解 調整 軟體 層 東西 簡單 領域 研究者 時間 Linux 之外 作業系統 勢必 周邊 硬體 元件 配合 Linux 狀態 講者 順便 抱怨 USENIX OSDI 研討會 大部分 機器 學習 資料庫 領域 研究 作業系統 領域 研究 反而 少 不打緊 子 領域 專屬 高品質 研討會 作業系統 不僅如此 硬是 研究 作業系統 選擇 Linux 務必 實驗 OS 盡量 Linux 運行 ccNUMA 假設 之下 31 分鐘 這場 講座 點 講者 做 最重 批判 現狀 作業系統 設計 研究 遠離 真實 硬體 硬 體長 樣子 這是 無知 停留 舒適 圈裡面 專注 Linux 本來 擅長 這是 否認 現狀 作者 語氣 放緩 提出 建議 一步 作法 包含 寫 系統 控制 真實 SoC 確實 包含 撰寫 系統 降伏 複雜度 本來 天職 過程 中 講者 提出 一篇 他作 作者 論文 2011 年 至今 沒什麼 改變 來說 Linux 大宗 作業系統 排擠 孤立 僅僅 佔據 CPU Memory 一小塊 角落 越來越 作業系統 看不見 東西 延伸 資料 導致 整體性 打造 電腦 計算機 講者 儼然 系統 軟體 禪師 大聲 詰問 理解 電腦 硬體 懂 至少 2011 那篇 論文 制定 規格 打造 工業 級 電腦 簡單 講者 簡單 秀 規格 照片 描述 作業系統 研究者 少 關注 BMC 主機板 控制器 負責 溫度 電量 貼近 原生 硬體 關鍵 控制 回頭 審視 ccNUMA 假設 侷限性 講者 領域 計算機 架構 領域 研究者 關心 關鍵 作業系統 領域 跟上 才 結論 理所當然 硬體 這些年來 變化 工程界 很多 公司 關注 現象 開發 新 作業系統 子 領域 反覆強調 兩個 大宗 架構 關注 項目 作業系統 研究者 跟上 社群 USENIX OSDI 鼓勵 類似 研究 大 環境 否認 Linux 之外 大 真實 硬體 樣貌 呈現 軟體 現狀 缺乏 認知 作業系統 研究 嶄新 機會 真的 新 硬體 構思 新 作業系統 架構 工具 遠比 好多 新 正規方法 語言 新 硬體 ... Hoddarla 賽期 中 接觸 講座 帶來 莫大 鼓舞 結論 講者 鼓勵 新 語言 新 概念 遺憾 筆者 至今 接觸 過的 RISC V 機器 簡單 平臺 再不然 模擬器 新 機器 探索 講者 有頭有臉 研究 單位 居 高職 支配 資源量 才 支撐 作出 告 背後 靠山 現狀 必有 諸多 原因 演化 至今 使然 未來 盈利 主流 當中 Linux 非 Linux 離經叛道 遑論 是非 POSIX 排除 C 語言 說 未來 事項 將會 研究 成形 RISC V 進階 中斷 架構 Advanced Interrupt Architecture 新機制 兩三年 會 普及 取代 現今 PLIC 做法 或許 硬體 本身 控制器 轉為 RISC V 情況 更 有望 支援 類似 講者 期望 那種 作業系統 相較 前 篇 講座 佳評 連連 系列 文 共 四篇 評論 卻是 稍微 負面 有評 論說 作者 點出 一大堆 了解 本身 了解 主題 足以 稱之為 旁邊 熱鬧 也許 眾人 評論 自有 道理 作者 稀疏地 更新 2020 二月 後續 系列 文 停留 架構 構想 階段 部落 格中 作者 部落 格用 藝名 No Bugs Hare 行文 我行我素 美式 口語 幽默 爭議 處採 痛點 前 一篇 講者 爭議 處會 放緩 打預防針 做法 敢 放話 No Bugs 技術 一番 見識 描述 五十年 硬體 軟體 生態系 進展 論述 地基 硬體 改進 差異 至少 數點 效能 無需多說 元件 效能 改進 CPU Memory 之間 資料 速度 越差 越大 context switch 變得 昂貴 NUMA Interrupt 改進 更深 pipeline 分支 預測 軟體 看不到 CPU 改良 軟體 大多 工具 功能 增強 靜態 分析 工具 公共 簽署 實務 增加 使用者 軟體 來源 信心 應用程式 層有 更好 分享 東西 Shared Nothing 訊息 傳遞 Message Passing 式 API 語言 框架 中供 作者 引述 Golang Channel 設計 背後 核心 精神 Do communicate sharing memory instead share memory communicating 非 同步 程式設計 框架 則是 列舉 作者 希望 作業系統 中 改良 八大 項目 增加 彈性 佈署 時 控制 選項 取代 開發 時 編譯 時 控制 選項 無論是 低階 MCU 高階 CPU 藉由 作業系統 介面 共享 應用程式 驅動程式 非 開發 增加 穩定度 測試 性 正式 上線 生產 環境 除錯 經驗 應 提升 一例 很多 生產 環境 crash 掉 難解 決 有個 監控 機制 調度 事發 前 一段時間 系統 狀態 會 更好 認知 很多 工具 提供 是問 作業系統 提供 內 建 容錯 Fault tolerance 擴容 Scalibility 安全性 情境 增加 安全性 解決 公共 財的 悲劇 參見 作者 應是 意指 租戶 使用者 情境 系統 利用 狀態 驅動程式 開發 簡化 增加 效能 且須 分開 HPC 高效能 運算 CPU 負責 絕大部分 互動式 工作 作者 遭受 批評 作者 希望 改進 面向 應 措施 工具 作者 評估 過的 批評 本身 道理 作者 不僅僅 希望 改進 做法 實際上 更 希望 作業系統 核心 應用程式 之間 設定 邊界 無異於 多出 框架 第三方 函式 庫 內心 想望 投射 解讀 篇 更進一步 想要 功能 想法 當初 系列 持續 這篇 藍圖 篇 描述 改良 段落 撰寫 本篇 提出 五個 功能 長 段落 做 結論 不免 破壞性 壓縮 先行 致歉 讀者 諸君 感受 那份 動能 原生 支援 事件驅動 Event driven 式 程式設計 模式 支援 手持 裝置 桌面 系統 伺服器 事件驅動 模式 透過 程式 語言 框架 函式 庫來 支援 支援 方法 應用程式 層 費了 很多 工夫 費工夫 底層 系統 本質 中斷 驅動 Interrupt driven 式 作者 大部分 事件處理 很快 解決 事件驅動 模式 優於 中斷 驅動 模式 考量 執行 緒 切換 維護 作業系統 之中 何等 高 成本 原文 heavy weighted 作者 出發點 更到 細節 處 有限 狀態機 Finite state machine 執行 單元 事實上 很多 嵌入式 作業系統 即時 作業系統 類似 設計 作者 一點 想要 就算 是給 高階 處理器 運行 作業系統 應往 方向 靠攏 才 網頁 伺服器 效能 為例 non blockng nginx 優於 apache 東西 FSM 系統 執行 時 會 deterministic 有助於 檢驗 生產 環境 crash 事件 理論 一臺 機器 記錄下來 log 運行 系統 機器 重現 理想 這也 簡化 遷移 migration 流程 作者 重 定義 作業系統 指涉 核心 指涉 API 提供 應用程式 驅動程式 運行 配備 核心 原 系列 作者 最會 現實 阻攔 設計 原則 個例 子 網頁 伺服器 閱覽 組態 檔 需求 Unix like 系統 有個 open 系統 呼叫 檔案 系統 互動 也許 應用程式 層 API read conf open 伺服器 想要 運行 檔案 系統 微小 系統 read conf 不堪 何不 定 作業系統 API read conf API 分群 應用程式 設計者 用到 足夠 看法 延伸 第三點 應用程式 設計者 角度 出發 提出 兼具 應用程式 僅 API 高層 級 API 底層 作業系統 核心 抽換 解法 延續 第三點 網頁 伺服器 案例 設計者 選擇 read conf sql socket 非 限定 Unix like kernel open read socket API 一點 太 理解 精神 旨趣 作者 倡議 作業系統 程式 語言 編譯器 更 緊密 合作 呼應 第二篇 當中 援引 程式 語言 靜態 分析 工具 優勢 名為 第一份 草稿 比前 篇 更 接近 設計 先 跳過 Hoddarla 原本 反 社會 恐怖主義 作者 No Bugs Hare 相比 傳統 價值 乖乖 牌 系列 文 相比 單純 Golang 語言 比照 以往 作業系統 照顧 貼近 硬體 抽象 層級 XXI 系列 充滿 更 想像 原作者 部落 格下 留言 大多 不以 為然 轉發 Hacker News 眾人 評論 不太優 相 之下 Hoddarla 本身 迴響 驅車 入巷 時 猛吠 狗 引 一瞥 真的 要說 系列 文給 技術 發想 之外 點子 接近 第一 時間 感受 篇文章 這是 Stonemaier 設計師 Jamey 文章 指引 有志於 桌遊 設計 一系列 心法 中 一篇 一言以蔽之 點子 聰穎 無比 沒 做出 東西 實踐 過程 遠遠 構想 出 神妙 點子 困難 當初 乍看 一把 無明火 點子 作出 東西 事實 夢想家 比例 佔 全人類 總數 實際上 不少 實踐者 協調者 會 點子 做 來說 夢想 爛 主意 並無二致 更 極端 說 搞不好 率低 夢想家 價值 更 低 換個 角度看 理解 創業 失敗 受 景仰 程度 會 遠大於 在講 創業 沒 做 流於 功利主義 夢想 盡頭 難道 世界 帶來 更好 改變 這不 純然 過程 夢想 兌現 途中 一部分 成果 重點 做 做 大概 Nike 品牌形象 緣故 本來 期待 系列 會 引導 Hoddarla 尷尬 console 更 高明 東西 一個系列 停止 更新 First draft 難免 惆悵 永遠 站 雞蛋 遺憾 無論如何 高牆 正確 日前 晶心 壯士 隊友 聊聊 技術 路上 夢想 知曉 遠大 夢想 泄漏 祕密 追問 既然如此 做 鐵人 賽 事情 太 循規蹈矩 畢竟 很多 學習 事情 來說 吸收 養分 理解 ... 來說 這是 煎熬 震盪 安排 走 正軌 想要 好好 吸收 養分 不由得 會 太乖 Hoddarla project 做 做 會 該學 東西 還學 夢想 規劃 執行 一年 半 衝刺 三五個 月 沉澱 佳作 沉澱 ... 會 選擇 永遠 Hoddarla 停留 0.1 狀態 幾年 內 做 作業系統 專案 嘗試 典範 典範 歲月 風沙 淘洗 共存 共生 共 演化 人類 面並 唯一 主體 宰制 至多是 腦細胞 player C 語言 Linux Linux Foundation 概念 前輩 腦中 躍出 一本 本長 灰塵 書 電流 血 概念 肉 神物 挑戰 神獸 沒血 沒 魔 沒裝 沒 天命 有何 可戰 作業系統 專案 嘗試 自幹 作業系統 答案 兩件 事情 區分 開 來看 先說 第一件 事 接近 Hoddarla No Bugs Dare 想 做 事情 會 業界 先進 歸類 經驗 一群 傾向 認同 Timothy 講座 中 提到 引用 2011 年 論文 角度 夢想家 想要 挑戰 改動 作業系統 原則 光 軟體 層 做 真的 夠嗎 硬體 假設 之下 會 到頭來 就算 給你 做 差太多 反正 RISC V 開源 核心 只會 越來越 硬體 概念 補 回來 也許 硬 體層 改 軟硬 之間 更 互補 需 會 更 有趣 專案 是從 作業系統 往下 角度 角度 Hoddarla 本身 想要 Golang 執行期 作業系統 一部分 地說 太 醜陋 維護性 至少 Golang 套用 可行性 Golang 至少 付出 像是 TamaGo 專案 等級 心力 才行 再不然 就連 程式 語言 思考 語法 簡潔 節省 開發者 認知 資源 工具 眾多 ... 一件 事情 自幹 作業系統 認知 作業系統 課堂 深 淺 作業 技術 狂 實作 本質 手邊 工具 重現 實務 作業系統 一小部分 想要 走 路 過程 中 學到 缺乏 技術 知識 玩具 希望 做 東西 玩具 話雖如此 光是 駭客 好好 自幹 做 本身 足以 第一種 看起來 像是 逃避 仔 看法 大方 承認 想要 逃避 C POSIX everything a file 企鵝 紅色 惡魔 玩具 倡導 價值 影響力 回事 創業 營利 回事 學習 面向 或許 唯一 創造 玩具 理由 學生 潛入 Linux 大 系統 找到 痛點 修正 聽 很久 時間 學生 經驗 Input Output 效果 會 創造 玩具 學習 認知 有進有出 預期 方法 效果 打造 玩具 學習 法有 一大 原因 節省 日後 接觸 真實 系統 手 時間 而花 了解 玩具 複雜度 花太多 時間 也就是說 教學 心智 模型 深潛 真實 系統 中所 需 時間 遠遠 大於 打造 玩具 過程 中 理解 系統 元件 時間 加上 有過 玩具 經驗 手 真實 系統 學習 時間 出 社會 總覺 潛入 真實世界 未必 壞處 大部分 就學 時期 玩具 都造 不好 沒造過 工作 自由支配 時間 更為 稀缺 這時候 做 玩具 來說 毫無意義 Side project 鐵人 賽 系列 文在 奪獎 劣勢 聊聊 劣勢 恭喜 Software Development 組 冠軍 系列 文 節奏 分配 確實 登 樓梯 感覺 程式碼 實例 夾帶 重構 心法 目標 讀者 群大 易 受益 反觀 幾次 嘗試 大多 自我中心 Side project 東西 本來 關乎 自我 成長 Hoddarla RISC V 面向 透過 實際操作 方式 展露出來 先前 幾次 嘗試 來得 完整 整體 學習 來講 略顯 虛浮 去蕪存菁 感覺 僅僅 參加 目的 優勢 劣勢 興趣 型 專案 獨到 領域 型 專門知識 整理 教學 目的 分享 成 系列 文的料 未來 會 參賽 核心 形式 求 扭轉 劣勢 策略 爭獎 打算 下次 回避 Modern Web Software Development 兩個 一級 戰區 評審 主辦單位 公佈 評量 向度 得獎 系列 文在 向度 分數 評語 如此一來 未獲獎 技術 有個 目標 得獎者 相當於 回饋 增進 傳遞 知識 能力 由衷感謝 讀者 希望 最末 篇 宣告 Hoddarla 1.0 永遠 感到 閱讀 系列 浪費 時間 理論 大部分 RISC V S mode CSR 系統 卻是 Hoddarla 系統 建構 脈絡 之下 邏輯 至少 一點 學習 參考 事實上 一個多月 參考 幾次 PLIC Golang 系統 面向 則是 偏門 往復 搭配 前年 系列 才 比較清楚 閱讀 確實 會 難以 入口 系統 軟體 圈多 C Golang 絕大部分 生硬 形式化 方式 表達 文章 確實 刻意 這是 表達 讀者 尊重 方法 實際上 成效 只能 說 世界 誤會 大得 所有人 會 遺憾 結論 本篇 則是 寬鬆 更 接近 日常 行文 方式 讀來 也許 自溺 有趣 推薦 讀者 諸君 試著 創作 鐵人 賽 部落 格 相遇 更 會 未來 先前 寫作 相遇 那種 經驗 堪比 接觸 陌生人 舉例來說 先前 三個 鐵人 賽 系列 認得 筆調 精神 生命 同等 歲月 遺失 留下來 的則 大部分 程式碼 概念 賴以 為生 技術 感謝 閱讀 閱讀 文字 程式碼 毫無意義 請 接受 過早 佳節 祝福 希望 2022 所有人 來說 帶來 機會 成長 一年",
    "買 哪次 買好 買滿 一步 稽核 最終目標 人員 技術人員 法規 網路 架構 網路 連線 使用者 電腦 伺服器 電臘 頻率 A 級 辦理 二年 辦理 技術 面 分類 提要 網路 架構 檢視 端點 防護 開發 防護 基準 盤點 清查 檢測 掃描 盤點 文件 清查 舊 系統 帳號 安全性 檢測 資通 健診 健診 目 包括 網路 架構 檢視 有將 網路 分區 公私 IP 配置 彼此間 連線 存取 網路 惡意 活動 檢視 會側 錄 網路 分 區間 封包 異常 分析 網路 設備 log 異常 使用者 端 電腦 惡意 活動 檢視 檢測 電腦 中 異常 包含 程式 網路 連線 帳號 還會 作業系統 應用程式 安裝 更新 伺服器 主機 惡意 活動 檢視 使用者 端 一項 不合宜 作業系統 Windows10 目錄 伺服器 設定 防火牆 連線 設定 檢視 檢測 套用 GCB 政府 貼心 打包 好供 選購 請參閱 4531 揪 甘心 價格 僅僅 單一 項目 價格 ... 人天 費用 加總 7 萬之多 還不 包含 GCB 資料庫 檢測 ... 110 年 資安健 診費 最低 費用 1 6 項目 74761.5 1 6 項目 7 GCB 108744 1 6 項目 7 GCB 8 防火牆 131399 應辦 事項 外 健診 列入 先行 作業 提到 執行 項目 包含 GCB 資料庫 會 稽核 時 技術 檢測 建議 選擇 優質 廠商 尋找 中 順利 複測 稽核 目標 文件 庫 參考 資源 延伸 閱讀",
    "接續 昨天 response headers Julia Evans 大大的 可愛 圖 圖片 來源 Set Cookie set a cookie Access Control 呼叫 Cross Origin Resource Sharing CORS cross origin 請求 Content Type body MIME type Content Length body 長度 單位 bytes Content Language body 語言 Content Encoding body 壓縮 方式 Location URL 轉倒 ... Accept Ranges server 告知 client 端 可否 支援 range range",
    "request 常用 headers 接下來 response 常用 headers Julia Evans 大大的 可愛 圖 圖片 來源 Age response cache 多久 s Date response send 出 Last Modified 內文 異動 ETag response body 版本 一串 hash Cache Control cache 設置 Vary req header 而會 變化 accept xxxxx Via proxy server 加上 ex nginx Expires 本次 response 有效期限 Connection close keep alive 判斷 tcp 連線 開啟",
    "context 流程 中 超時 控制器 lib context 常用 context 方法 來看 幾個 例子 例子 中 會 第四 秒 時 發出 cancel 訊號 輸出 第五 秒 時 context cancel 第二個 例子 例子 中 WithTimeout 設定 context 會 第四 秒 時 超時 輸出 第三個 例子 WithTimeout cancel context cancel time out 輸出 context 確保 流程 安全性 thread safe 更 準確 指 goroutine safe context 變動 只能 基於 現有 context 創出 新 子 context",
    "大盤 上周 連漲 四天 週五 小跌 作收 收盤價 均線 之上 型態 來看 算是 止 穩盤 櫃買 指數 遇前 高 關係 會 震盪 處於 高檔 盤整 中 且量 萎縮 跡象 週五 收盤價 站上 均線 以盤 代跌 情況 講完 盤勢 主題 選股 基本面 籌碼 面 技術 面 聽 明牌 之外 做足 功課 最終 會 面臨 我該 選股 將以 案例 來說 明 操作 大 原則 見林 找 樹 先 找 個股 先 國際 盤勢 看美股 美股 表現 足以 影響 全球股市 不用 說 有個 迷思 糾正 台股 美股 連動 性 請 破除 迷思 步驟 至少 台股 盤勢 會 底 櫃買 指數 8 10 月間 呈現 向下 趨勢 進場 賠錢 底部 帶量 W 底 觀察 等待 時機 入場 保險 情況 帶量 站上 季線 突破 下降 趨勢 線 預期 趨勢 向上 持續 觀察 跌破 趨勢 線 若破 就要 出場 看類 股 台股 資金 輪動 快速 昨天 航運 塑化 明天 晶圓 代工 類股 發動 攻擊 當中 幾檔 領頭羊 會齊漲 齊跌 情況 類股 個股 觀念 傑西 李佛摩 這本 書 講到 協力車 概念 櫃買 指數 電子 類股 主 櫃 半導體 指數 櫃買 指數 連動 性 高 才 著眼 個股 選擇 以合晶 6182 為例 11 24 開盤 跳空 突破 區間 整理 均線 漂亮 進場 好時機 觀察 3 天 回檔 續 抱 分類 個股 方式 篩選 型態 強勢 保證 會 一路 漲 方式 會 篩選 2 3 隻 入場 伴隨 而來 風險 趨勢 變 3 隻 齊跌 入場 前為 何要 做好 資金 控管 原因 3 點 我大 略帶 很多 細節 還未講 新手 先 不用 著手 個股 選擇 至少 第二 第三點 做 扎實 連盤勢 類股 趨勢 貿然 進場 割 分",
    "上班 github 紀錄 發現 commit 沒 push 沒 github 上傳",
    "一個月 發 一篇 速度 怕 是還 發完 關賽 ... 人員 技術人員 法規 技術 面 分類 提要 網路 架構 檢視 端點 防護 開發 防護 基準 盤點 清查 檢測 掃描 盤點 文件 清查 舊 系統 帳號 安全性 檢測 弱點 掃描 滲透 測試 資通 健診 如果說 弱點 掃描 列個 清單 好好先生 不痛不癢 的還 賴皮 說 誤判 本篇 滲透 測試 實實在在 暴燥 壞蛋 開心 將您打 回老家 測試 列出 利用 漏洞 外 還會 詳細 攻擊 手法 想賴 賴不掉 糟糕 技術 誤 可知 滲透 測試 更 像是 一種 技術 列出 自動化 軟體 符 ㄥ ˋ 合 ㄈ ㄨ ˋ 規範 metabolic 免費 偏向 軟體 配合 才能 自動化 參考 rapid 7 商業 軟體 收購 metabolic 公司 ... sqlmap 針對 SQL injection 工具 Burpsuite 商業 軟體 謎 之聲 人手 一套 怎麼回事 實在 沒 測試 免費 自動化 軟體 找到 再補 ... 滲透 掃描 適用範圍 弱點 掃描 太大 簡單 區分 淺 深 程度 弱點 掃描 快速 產出 成本 低 頻繁 法規 至少 滲透 掃描 思維 模擬 駭客 攻擊 手法 組合 性 成本 高 情況 2 年 執行 即可 滲透 測試 技術 門檻 高 請 尋找 一家 經驗豐富 廠商 給予 充足 時間 手動 會 可靠 隨之 高漲",
    "完賽 發個 心得 好像 怪怪的 原本 想 系列 補充 完再發 心得 趕稿 壓力 產出 超 低落 人性 ... 才 沒生氣 話 說 上次 鐵人 賽 有幸 出書 機會 礙於 版權 關係 失敗 收場 算是 解鎖 真 鐵人 系列 成就 鐵人 賽斷賽 出書 失敗 ... 打擊 之下 有想過 再次 出發 以能 出書 前提 挑選 題目 收拾 心情 太 考量 反而 分享 樂趣 這次 參賽 題目 一反常態 選 工作 相關 正 聊 題目 也許 寫文章 資安法 受苦受難 善男信女 包含 出書 束縛 版權 考量 下大玩梗圖 說 說 五四三 舒壓 下次 鐵人 賽 題目 會 回到 上次 初衷 好玩 有趣 優先 有沒有 附加 價值 當佛系 作者 XD",
    "ShiojiLogin py 加 contracts timeout 10000 參數 登入 時會 等待 Contracts 資料 下載 完 登入 比較慢 錯誤 Gridbot py 新增 下午 三點 中止執行 money 寫到 檔案 接下來 這周 開關 網格 機器人 會 改成 流程 1 執行 網格 機器人 2 讀取 money 變數 現金 部位 大小 3 讀 取現 股 部位 大小 4 印出 機器人 總資產 現股 現金 5 問 使用者 加減 碼 money 變數 做 操作 6 執行 機器人 交易 7 下午 三點 關閉 機器人 money 變數 寫到 檔案",
    "好久 没有 更新 比较忙 不过 一个 有意思 问题 过来 记录 通过 正则表达式 匹配 文本 并 替换 一个 脚本 中 很多 路径 此时 更改 这个 路径 通过 正则表达式 来 匹配 找到 满足条件 字符串 然后 进行 替换 原始 路径 替换 后 路径 代码 内容 Replace 语法 为什么 说 这个 有意思 理解 匹配 规则 时候 后面 应该 转义 额外 转义字符 应该 将 两个 当成 字符串 进行 匹配 结果 确 不行",
    "2021 年 11 月初 React Router 正式 釋出 v6 版本 身為 React 開發者 按捺不住 好奇心 想 版本 究竟 增加 功能 修改 語法 篇文章 誕生 篇文章 中 我會 介紹 v6 新 功能 v5 哪些地方 1 Switch 元件 Routes 取代 傳遞 props 元件 方式 做 調整 新 props element v5 v6 2 Router 變 聰明 不用 加上 exact 需 透過 exact 設定 完全符合 url 時才 會 顯現 指定 元件 內容 Router 會 抓取 相近 url 呈現 元件 3 NavLink activeClassName prop 移除 提到 activeClassName 移除 v6 className 判定 即可 4 簡化 巢狀 路由 推出 Outlet API 版本 搭配 useRouteMatch 組出 巢狀 路由 寫 想要 子 路由 v5 v6 path 有沒有 加上 ' ' Outlet api 建立 巢狀 路由 一大 利器 官方 提供 範例 Dashboard 元件 內部 會 路由 messages tasks Outlet 地方 呈現 元件 DashboardMessages DashboardTasks 5 useNavigate useHistory useNavigate 第一個 參數 路由 數字 代表 回去 頁數 範例 1 v5 v6 範例 2 v5 v6 useNavigate hook 外 v6 提供 元件 6 useRoutes react router config 7 功能 幾點 之外 變更 像是 React Router v6 bundle size 縮小 輕量 就舉 常用 幾點 來說 明 想 了解 更 點擊 推薦 youtube 影片 官網 閱讀 文件 囉 放上 中 介紹 React Router v5 範例 程式碼 修改 v6 版本 程式碼 範例 提供 讀者 做 範例 中並 文中 功能 讀者 自行",
    "加權指數 W 底 10 19 站上 頸線 一路 狂奔 11 19 歷經 1 月 多頭 格局 一個月 入場 大部分 賺 11 19 回檔 跡象 今日 回檔 再次 跌破 前高 支撐 線 連續 2 天 跌破 10 日線 投資人 會 荒 緊張 不到 空頭 回檔 今日 觀察 重點 會 再度 跌破 支撐 線 跌破 加權 市場 個股 操作 會 傾向 保守 保住 獲利 第一 原則 空頭 瞎猜 紀律 進出 櫃買 指數 相較 加權指數 櫃買 指數 氣焰 可強 一舉 站 上前 高 支撐 未有 回檔 跡象 均線 漂亮 發散 開花 排列 正確 這一波 量 7 10 月 還多 電子 類股 領先 族群 操作 電子 類股 居多 獲利 原則 大 賺 賠 盤勢 很強 盡量 放大 獲利 盤勢 轉弱 懂得 收手 右側 交易 原則",
    "有位 朋友 抱怨 單 績效 差 很多 第一個 直覺反應 沒 做好 資金 控管 先說 三次 資金 控管 資金 控管 資金 控管 資金 控管 沒 做好 就算 標的 賠錢 將用 損益 解釋 到底 賠錢 這張 近 一個月 未 損益 表面 看起來 很漂亮 一檔 賠 會 賠 持股 標的 中 一檔 聯發科 11 23 收盤價 1080 250 這位 朋友 聽 建議 都給 買 一張 感覺 會漲 就給 買 幾張 出 唯一 賠 檔 聯發科 買法 聯發科 佔 整體 資金 比重 太重 大跌 會 拖垮 整體 獲利 正確 做法 平均分配 個股 佔 舉例來說 假設 投資 標的 中有 100 50 20 股票 做 買 一張 100 跌個 10% 20 要漲 50% 才能 打平 100 跌 10% 20 漲 50% 機率 高 正確 做法 100 買 1 張 50 買 2 張 20 買 5 張 核心 觀念 風險 平均 分攤 各股 高價股 大跌 獲利 全吐 正確 投資 心態 長期 穩定 獲利 輸贏",
    "DevFest Hsinchu Taichung 週六 順利 結束 感謝 Ryan 邀請 機會 學生 時期 站上 DevFest 舞台 QQ 這次 議程 中 介紹 RISC V 中斷 異常 作業系統 當中 想 影片 解說 會 滿滿的 文字 更 理解 興趣 朋友 影片 五小時 處 觀看 議程 錄影 排 小弟 前 一場 議程 提到 IC 產業 分工 內容 推薦",
    "接下來 要將 測試 放入 api 中 這次 測試 中 想 測試 mRequest Get 會 回傳 資料庫 request 值 這次 測試 中 mRequest Get 單純 預期 資料庫 會 回傳 值 有沒有 執行 執行 這段 sql 連線 requests 資料 那接 gorm mock lib 大部分 sql 資料庫 mock 不用 製造 輪子 mock method 詳細 用法 連結 中 查詢 這次 ExpectQuery method 幫 檢查 執行 想要 sql 語法 用法 檢查 執行 SELECT FROM requests 這段 內容 說 regexp QuoteMeta method ExpectQuery 中 預設 會 認爲 內容 正規 表達式 這句 sql 語法 中 正規 表達式 符號 衝到 想要 預期 字串 符合 就要 加上 regexp QuoteMeta 這段 內容 相符 判斷句 改為 model 資料夾 執行 外面 執行 這次 測試 摟 附上 這次 commit 紀錄",
    "改成 targetCapital 變數 控制 總部 位 大小 不用 開 機器人 還要 算 加減 多少錢 大小 初始化 會 檢查 帳戶 餘額 交割 金 沒 錢 交割 這部分 沒 特別 帳戶 裡的 錢匯 測試 有沒有 預期 多放 錢",
    "分享 適合 剛 入門 STM32 新手 快速 了解 STM32 開發 生態 昨天 講到 建議 標準 庫學 懂 STM32CubeIDE 這方 法只 適合 走 韌體 開發 工程師 心想 研究 這韌體 領域 適合 那種 想要 快速 開發 功能 OK 功能 別學 標準 庫 開發 STM32CubeIDE 暫存器 看法 函示 配置 方法 腳位 宣告 STM32CubeMX 幫 弄 好好 選好 IC 點 一點 圖片 中 腳位 配置 初始化 函示 接下來 盡量 了解 東西 簡短 方式 懂 先來 介紹 STM32Cube 生態 具 昨天 參加 ST 線上 研討會 第一 介紹 新出 MCU 簡單 整理 詳細資料 ST 官網 查詢 1 STM32MP1 這顆 MPU Cortex A7 核心 Cortex M 系列 大幅提高 性能 支持 Linux 系统 用戶 內部 含有 GPU 下圖 是從 會議 中 截圖 MP1 架構 雙核心 A7 M4 2 STM32H7 性能 MCU 雙核心 M7 M4 480MHz 240MHz 高達 2Mbytes 內部 Flash 3 STM32U5 新出 的極 低功耗 MCU 更 高度 安全性 ADC 提升 14 bit 再來 聊聊 STM32Cube 軟體 開發工具 系列 STM32CubeMX 圖形化 設定 工具 STM32CubeIDE 整合 開發 環境 IDE STM32CubeProgrammer 燒錄 程式 STM32CubeMX 選定 開發 MCU 型號 MCU 圖片 點選 腳位 初始化 設定 STM32CubeMX 支援 最新 MP1 系列 MPU STM32CubeMX 周邊 init C project HAL 庫 LL 庫 使用者 自行決定 提到 HAL 庫是 標準 庫 精簡 版本 LL 庫則 是從 HAL 衍生 精簡 版本 暫存器 操作 大幅 縮小 原本 程式 容量 IDE 好處 不用 受限於 Keil5 免費 版本 程式 大小 限 太大 不讓 燒入 困擾 STM32CubeIDE compiler tools 開新 專案 整合 CubeMX 進去 就算 下載 STM32CubeMX STM32CubeIDE 裡 會 連結 STM32CubeMX 昨天 沒 下載 STM32CubeMX 發現 IDE 連結 MX 會 卡頓 想 軟體 時 內部 建立 MX 做 連動 導致 些微 卡頓 下載 STM32CubeMX 分開 順暢 點 分開 影響 原本 專案 MX 視窗 設定 好腳 會後 Generate code IDE 軟體 初始化 會 設定 先放上 截圖 設定 UART2 來看 標準 庫 設定 差別 是點 完 Generate code UART 初始化 函式 來看 標準 庫 開發 UART 初始化 函式 IDE 點 一點 省去 很多 時間 昨天 用到 很想 跳來 IDE 開發 標準 庫 經驗 自動 程式碼 陌生 大概 瞭 地方 做 事 能力 韌體 開發 具備 能力 會 來用 IDE 昨天 發表 QA 問答 問到 STM32L 系列 提供 標準 庫 開發 資料 回答 提供 HAL 庫 LL 庫 聽到 這回 答 ST 不在 提供 新 標準 庫 程式 LL 庫 來說 會 標準 庫 效率 更高 LL 庫 操作 暫存器 線上 研討會 提到 MCU AI 出 STM32Cube AI 軟體 這方面 沒 這套 軟體 適合 原本 AI 訓練 經驗 套用 訓練 Mode C code 燒給 MCU 做 附上 相關 教學資料 研討會 有人 問 有沒有 相關 中文 學習 資料 回答 STM32Cube AI 影片 教學",
    "分享 適合 剛 入門 STM32 新手 閒聊 STM32 生態 11 月 09 日 11 月 10 日 參加 ST 線 研討會 聽 ST 介紹 生態 感想 了解 STM32CubeMX STM32CubeIDE 開發 模式 標準 庫 開發 差別 原本 沒 STM32CubeMX STM32CubeIDE 聽說 兩個 功能 模糊 印象 STM32CubeMX 自動 配置 初始化 函式 STM32CubeIDE 包含 MX 設定 功能 編譯 配置 環境 模糊 方向 大致 但還 觀念 接下來 會 兩天 了解 知識 STM32CubeMX STM32CubeIDE 差別 HAL 庫 LL 庫是 東西 第一次 STM32CubeMX STM32CubeIDE 感想 ... 東西 太 想 轉過 STM32Cube 系列 XD 這方 便 感想 建議 學完 標準 庫 開發方式 學著 STM32CubeMX STM32CubeIDE 分享 完就會 我會 說 剛聽 完線 研討會 立馬 載 STM32CubeMX STM32CubeIDE 剛剛 想來 分享 事情 明天 說 說 STM32CubeMX STM32CubeIDE HAL 庫 LL 庫 差別",
    "建立 簡單 RESTful api 接下來 就要 測試 放到 程式 中 golang 中 原本 有將 測試 框架 包 進去 原生 函示 庫 網路上 很多 測試 框架 接下來 會實 做 測試 方式 參考 gorm mock 篇文章 實作 方式 留言 交流 先 安裝 測試 套件 測試 框架 mock 框架 gorm mock 補充 mock 用途 簡單 測試 中 程式 中 只會 input output 撰寫 測試 寫 即可 程式 依賴 其他人 測試 上方 寫 每次 測試 會 這時候 就要 rand Intn 產出 內容 控制 function 控制 動作 mock 原始 程式 測試 一篇 就要 測試 內容 放到 程式 中",
    "Day 38 AWS Lambda 中 YOLO 推估 Inference YOLO 自訂 資料集 訓練 方法 YOLO 推估 彼此之間 關係 下圖 所示 使用者 透過 API Gateway 上傳 PUT 圖片 儲存 貯體 A 事件 會 驅動 AWS Lambda 函數 AWS Lambda 函數 會 事先 訓練 YOLO 模型 圖片 YOLO 推估 Inference IAM 角色 B 身分 偵測 物件 畫出 方塊 框 存 儲存 貯體 B 使用者 圖 1 S3 驅動 Lambda 函數 YOLO 辨識 架構圖 這份 專案 中 提供 OpenCV YOLO 推論 案例 試著將 案例 佈署 AWS Lambda 測試 前期 工作 上傳 YOLO 相關 檔案 S3 訓練 權重 檔 yolov3 backup 推論 圖片 02 frame 608x608 0090 jpg 建立 IAM 角色 執行 AWS Lambda 並有 存取 S3 許可 建立 AWS Lambda 函數 設定 環境 變數 AWS Lambda 建立 OpenCV 層 撰寫 AWS Lambda 函數 測試 步驟 1 上傳 YOLO 相關 檔案 S3 AWS Lambda 函數 大小 256 MB YOLO 權重 檔 yolov3 backup 推論 圖片 02 frame 608x608 0090 jpg 存 S3 中 下圖 所示 圖 2 上傳 YOLO 相關 檔案 S3 步驟 2 建立 IAM 角色 建立 IAM 角色 執行 AWS Lambda 並有 存取 S3 許可 IAM 管理 控制台 選擇 新增 角色 接下來 下圖 所示 選擇 Lambda 案例 點擊 許可 按鈕 圖 3 建立 角色 選擇 Lambda 案例 搜尋 文字 框中 輸入 basic 找到 AWSLambdaBasicExecutionRole 連接 這將 角色 寫入 CloudWatch 記錄 檔 全縣 程式 除錯 之用 下圖 所示 圖 4 連接 基礎 CloudWatch 除錯 許可 政策 先前 設定 後並 輸入 角色 名稱 建立 角色 下圖 所示 圖 5 檢閱 設定 建立 角色 編輯 新 政策 內容 下圖 所示 給定 讀取 GetObject 儲存 貯體 A 寫入 物件 PutObject 權限 PutObjectAcl 儲存 貯體 B 圖 6 新增 政策 角色 設定 畫面 新建 政策 連接 角色 下圖 所示 圖 7 新增 政策 連接 先前 角色 步驟 3 建立 AWS Lambda 函數 AWS Lambda 管理 控制台 選擇 建立 Lambda 函數 設定 內容 下圖 所示 執行 時間 務必 選擇 Python 3.7 OpenCV 函式 庫層 執行 角色 記得 選擇 步驟 設定 角色 選擇 選項 建立 函式 從頭開始 撰寫 函式 名稱 opencv45Func 執行 時間 Python 3.7 架構 x86 64 執行 角色 現有 角色 圖 8 建立 Lambda 函數 設定 畫面 Lambda 函數 中 點擊 組態 頁 籤 點擊 環境變量 新增 三個 環境變量 所示 modelbucket 存放 權重 儲存 貯體 儲存 貯體 B 儲存 貯體 A 做 寫入 會 引發 驅動 Lambda 事件 modelweight yolov4cfg yolov3 backup putbucket 儲存 貯體 B 圖 9 新增 Lambda 函數 組態 中 環境變量 步驟 4 AWS Lambda 建立 OpenCV 層 建立 Lambda 函數 選擇 AWS Lambda 函數 設定 畫面 畫面 底端 為本 函數 新建 Layer 下圖 所示 圖 10 Lambda 函數 新增 Layer 新增 Layer 畫面 選擇 層 來源 自訂 Layer 選擇 先前 建立 opencv45 函式 庫層 下圖 所示 圖 11 選擇 opencv45 函式 庫層 步驟 5 撰寫 AWS Lambda 函數 測試 先 建立 目錄 cfg 目錄 內 新增 檔案 yolov3 cfg 檔案 內容 參考 推論 程式 service py 內容 service py 圖 12 AWS Lambda 程式碼 建立 新 測試 事件 事件 範本 選擇 hello world 事件 名稱 輸入 fromS3Bucket 內容 下圖 所示 這是 用來 模擬 S3 觸發 Lambda 函數 傳過來 參數 內容 記得 INPUT BUCKET 改成 輸入 儲存 貯體 名稱 INPUT OBJECT 確保 檔案 圖 13 設定 Lambda 函數 測試 事件 拉 畫面 下方 修改 執行 時間 設定 常式 指定 service handler 下圖 所示 圖 14 修改 執行 時間 設定 中 常式 點擊 Test 測試 下圖 所示 推論 時間 約 1.75 秒 需 記憶體 990 MB 圖 15 OpenCV YOLO 推論 接受 解決方案 表 1 列出 為止 YOLO 辨識 部署 解決方案 表 1 EC2 Lambda SageMaker YOLO 辨識 EC2 Lambda darknet SageMaker Lambda OpenCV 成本 USD 0.736 hour 0 1.0304 hour 0 時間 秒 0.1 秒 60 秒 1 秒 1 3 秒 可用性 較差 AWS 托管 AWS 托管 AWS 托管 參考資料 Simple Inference Scripts YOLO OpenCV Day 34 實作 S3 驅動 Lambda 函數 Yolo 物件 辨識 Day 35 Amazon SageMaker 簡介 Day 36 Container 建立 Amazon SageMaker 端點 Day 37 AWS Lambda 建立 OpenCV Layer yolov4 SageMaker Pytorch YOLOv4 YOLO v4 v3 CPU Inference API Windows Linux pytorch YOLO OpenVINO demo Real time Object Detection CPU",
    "Day 37 AWS Lambda 建立 OpenCV Layer OpenCV 影像 視覺 中 時常 用到 嘗試 AWS Lambda 中 建立 一層 OpenCV 並將 AWS Lambda 操作 流程 打包 Python OpenCV 函式 庫 AWS Lambda 建立 OpenCV 層 打包 程式 圖片 傳到 S3 AWS Lambda 執行 步驟 1 打包 Python OpenCV 函式 庫 動作 務必 Linux 環境 操作 Windows macOS 會 執行 失敗 推論 AWS Lambda 執行 OpenCV Container Linux based 這又 奇怪的是 Python 函式 登錄 Amazon Linux 2 主機 執行 程式 操作 內容 創建 新 Python 虛擬環境 檢查 Python 版本 更新 pip 安裝 opencv 安裝 套件 壓縮 python 目錄 檢視 壓縮 內容 壓縮包 針對 Python 3.7 opencv 版本 4.5 3.56 numpy opencv 相依 包 會 一併 安裝 進來 檔案 大小 72 MB 圖 1 Python OpenCV 壓縮包 相關 版本 上傳 壓縮 檔到 S3 記得 先 aws configure 使用者 認證 圖 2 Python OpenCV 壓縮包 傳到 S3 步驟 2 AWS Lambda 建立 OpenCV 層 AWS Lambda 管理 控制台 選擇 建立 Layer 輸入 Layer 名稱 上傳 先前 建立 壓縮 檔 選擇 相容 架構 x86 64 相容 執行 時間 指 希望 版本 python 中 執行 只能 選擇 Python 3.7 選 版本 會 出錯 建立 鍵 建立 Layer 下圖 所示 圖 3 建立 OpenCV Layer 設定 畫面 步驟 3 打包 程式 圖片 傳到 S3 登錄 EC2 創建 目錄 將相 關 檔案 放入 目錄 中 壓縮 傳到 S3 存儲 桶 內 相關 指令 yoloDrawLabel py 程式碼 請 參考 下圖 EC2 執行 畫面 圖 4 EC2 中 建立 Lambda 壓縮 檔 yoloDrawLabel py 步驟 4 AWS Lambda 執行 AWS Lambda 管理 控制台 選擇 建立 Lambda 函數 設定 內容 下圖 所示 選擇 選項 建立 函式 從頭開始 撰寫 函式 名稱 opencv45Func 執行 時間 Python 3.7 選項 選 Python 版本 會 錯誤 架構 x86 64 執行 角色 建立 具備 Lambda 許可 新 角色 圖 5 建立 Lambda 函數 設定 畫面 建立 Lambda 函數 選擇 opencv45Func 函數 設定 畫面 畫面 底端 為本 函數 新建 Layer 下圖 所示 圖 6 Lambda 函數 新增 Layer 新增 Layer 畫面 選擇 層 來源 自訂 Layer 選擇 先前 建立 opencv45 函式 庫層 下圖 所示 圖 7 選擇 opencv45 函式 庫層 上傳 程式碼 Lambda 函數 代碼 傳到 S3 需 函數 設定 主 畫面 右邊 找到 上傳 按鈕 點擊 選擇 Amazon S3 位置 指定 位置 s3 ap southeast 1 amazonaws com lambda zip 畫面 所示 圖 8 S3 壓縮 檔 建立 Lambda 函數 打開 yoloDrawLabel py 檔案 插入 AWS Lambda 呼叫 函數 handler 修改 完畢 記得 點擊 Deploy 下圖 所示 圖 9 修改 Lambda 函數 拉 畫面 下方 修改 執行 時間 設定 常式 指定 yoloDrawLabel handler 下圖 所示 圖 10 修改 執行 時間 設定 中 常式 透過 點擊 Test 執行 AWS Lambda 函數 第一次 執行 設定 測試 組態 不需 更改 需 給定 名稱 即可 點擊 會 執行 輸出 EC2 輸出 方塊 框 左上角 右下角 座標 下圖 所示 證明 OpenCV 層 運作 圖 11 執行 AWS Lambda 函數 參考資料 建立 共用 Lambda 層 zip 封存 檔 部署 Python Lambda 函數 Day 33 實作 S3 驅動 Lambda 函數 鏡像 Day 12 標籤 圖片 方法 實作 AWS S3 CP Examples – How Copy Files S3 CLI",
    "Day 36 Container 建立 Amazon SageMaker 端點 是將 訓練 YOLO 權重 轉為 SageMaker 節點 Lambda 調用 用到 AWS 資源 Amazon EC2 Amazon Simple Storage Service S3 Amazon Elastic Container Registry ECR AWS Lambda Amazon SageMaker Identity Access Management IAM 彼此之間 關係 下圖 所示 使用者 透過 API Gateway 上傳 PUT 圖片 S3 事件 會 驅動 AWS Lambda AWS Lambda 中 會 呼叫 Amazon SageMaker 端點 endpoint 事先 訓練 YOLO 模型 YOLO 模型 EC2 中 製作 容器 映像 檔 Container Image 並上 傳到 Amazon Elastic Container Registry 中 儲存 圖 1 S3 驅動 Lambda 函數 YOLO 辨識 架構圖 建立 Amazon SageMaker 端點 步驟 EC2 中 建立 容器 映像 檔 上傳 容器 映像 檔到 ECR Amazon SageMaker 筆記本 中 建立 Amazon SageMaker 端點 AWS Lambda 中 Amazon SageMaker 端點 呼叫 步驟 1 EC2 中 建立 容器 映像 檔 專案 建立 容器 設定 專案 下載 EC2 建立 YOLOv4 推論 容器 映像 檔 登錄 事先 建立 EC2 個體 g4dn.2 xlarge 參考 篇文章 並將 事先 訓練 權重 檔 複製到 指定 目錄 即可 參考 相關 指令 參考 操作 確認 yolov4 SageMaker 目錄 結構 下圖 所示 圖 2 yolov4 SageMaker 目錄 結構 修改 推論 程式 predictor py 容器 內 用來 圖片 辨識 程式 預設 參數 修改 成 自定義 參數 修改 94 96 行 source yolov4 endpoint predictor py 圖 3 修改 自行 定義 圖片 辨識 程式 接下來 建立 容器 映像 檔 組態 改成 GPU 基礎 建立 映像 檔 會 編輯 成 GPU 版本 建立 過程 會 緩慢 大概 數個 小時 會 建立 Docker Image 並將 image 放到 ECR 中 AWS CLI 認證 一部分 參考 一篇 文章 圖 4 建立 YOLOv4 容器 檔案 建立 成功 Amazon Elastic Container Registry ECR 中 建立 容器 映像 檔 下圖 所示 圖 5 建立 容器 映像 檔 步驟 2 建立 Amazon SageMaker 端點 專案 中有 create endpoint py 檔案 用來 建立 Amazon SageMaker 端點 代碼 代碼 利用 Amazon SageMaker 筆記 本來 運行 觀察 運行 修改 get arguments 方法 指定 端點 名稱 容器 映像 檔 指定 端點 運行 機型 代碼 下圖 所示 圖 6 建立 Amazon SageMaker 端點 yolov4 gpu 步驟 3 AWS Lambda 中 Amazon SageMaker 端點 呼叫 建立 角色 Lambda 函數 執行 執行 Amazon SageMaker 端點 許可 授權 IAM 管理 控制台 選擇 新增 角色 接下來 下圖 所示 選擇 Lambda 案例 點擊 許可 按鈕 Attach 許可 政策 中 輸入 sagemaker 接著選 AmazonSageMakerFullAccess 政策 確保 角色 透過 AWS Lambda 執行 Amazon SageMaker 端點 圖 7 建立 角色 選擇 Lambda 案例 AWS Lambda 管理 控制台 選擇 建立 Lambda 函數 設定 內容 下圖 所示 輸入 函數 名稱 執行 時間 選擇 Python 3.8 執行 角色 務必 選擇 畫面 中 角色 圖 8 建立 Lambda 函數 設定 畫面 輸入 程式碼 所示 bucket image uri 兩個 變數 改成 環境 中 值 測試 下圖 所示 圖片 辨識 0.8 秒 圖 9 建立 Lambda 函數 設定 畫面 想要 事實上 Amazon SageMaker 端點 建立 實體 之上 實體 計費 EC2 規格 還要 貴 g4dn xlarge 實體 類型 小時 端點 EC2 計價 1.0304 Endpoint ml g4dn xlarge 0.736 per On Demand Linux g4dn xlarge 務必 記得 關閉 Amazon SageMaker 端點 下圖 所示 關閉 Amazon SageMaker 筆記本 這也 實體 運行 圖 10 關閉 Amazon SageMaker 端點 三個 方案 表 成本 推論 時間 實驗 中 得知 系統 在乎 可用性 EC2 內 服務 開發者 自行 建置 會有 維運上 系統 負荷 導致 服務 表 1 EC2 Lambda SageMaker YOLO 辨識 EC2 Lambda SageMaker 成本 USD 0.736 0 1.0304 時間 秒 0.1 秒 60 秒 1 秒 可用性 較差 AWS 托管 AWS 托管 參考資料 yolov4 SageMaker How run a python file inside a aws sagemaker using dockerfile Day 16 影像 辨識 訓練 Real time Object Detection API using Amazon SageMaker Amazon API Gateway Call Amazon SageMaker model endpoint using Amazon API Gateway AWS Lambda",
    "Day 35 Amazon SageMaker 簡介 中 AWS Lambda 物件 辨識 辨識 時間 長達 一分鐘 中 g4dn 類型 EC2 辨識 時間 不到 0.1 秒 差距 太 大 不適 合作 為線 辨識 觀賞魚 試著 AWS 服務 中來 找尋 節省成本 服務 人工智慧 AI 雲端 AWS 提供 很多 這方面 服務 簡列 表 電腦 視覺 – 圖像 影片 提供 物體 臉部 識別 圖像 中 提取 文字 語音 文字 轉換成 語音 則是 錄音 檔 轉換成 文字 語言 利用 NLP 技術 找到 文字 中 意義 相關性 則是 翻譯 多種不同 語言 對話 機器人 一項 構建 語音 文字 交互式 對話 應用程序 服務 預測 機器 學習 時間 序列 數據 附加 變量 相結合 構建 預測 推薦 利用 機器 學習 客戶 創建 個性化 推薦 服務 圖 1 AWS 提供 人工智慧 服務 服務 針對 需求 資料 分析 人員 使用者 使用者 打算 建立 機器 學習 模型 並將 部署 雲端 AWS 推出 Amazon SageMaker 這項 服務 使用者 需求 AWS 官方網站 Amazon SageMaker 服務 定義 Amazon SageMaker 透過 整合 ML 建置 一組 功能 協助 資料 科學家 開發人員 快速 建置 培訓 部署 高品質 機器 學習 ML 模型 下圖 Amazon SageMaker 登錄 畫面 首頁 Amazon SageMaker 服務 包含 資料 建置 訓練 調整 部署 管理 圖 2 Amazon SageMaker 服務 概覽 訓練 資料 佈署 入口 透過 Amazon SageMaker Studio 這是 AWS 2020 年 re invent 推出 適用於 機器 學習 整合式 開發 環境 IDE 使用者 輕鬆 建立 訓練 偵錯 部署 監控 機器 學習 模型 專注 開發 機器 學習 模型 非 環境 設置 開發工具 轉換 包含 功能 Jupyter 筆記本 中 編寫 執行 程式碼 建立 訓練 機器 學習 模型 部署 模型 監控 模型 預測 性能 調校 改進 機器 學習 模型 成效 Amazon SageMaker Studio Notebooks 操作 平時 常用 Jupyter Notebook Jupyter lab 請 運行 實體 之上 啟用 Amazon SageMaker Studio Notebooks 就要 收費 觀念 EC2 開著 不用 收錢 下圖 2021 10 Amazon SageMaker Studio Notebooks 收費 情形 主機 位於 新加坡 地區 ap southeast 1 機型 ml t2 medium 開 138.77 小時 小時 收費 0.0584 美元 很多 忘 關機 時間 遠 少於 138 小時 帳單 來看 分鐘 來算 才 會 小數點 權重 檔案 放在 Studio Notebooks 中 才 會 第一筆 硬碟 空間 錢 月 1G 使用費 0.168 美元 圖 3 Amazon SageMaker Studio Notebooks 收費 接下來 操作 Amazon SageMaker Studio Notebooks 參考 內容 建立 筆記本 執行 個體 操作 筆記本 接下來 這句 話 教學 建立 資源 符合 AWS 免費 方案 資格 請 記得 終止 資源 AWS 將向 帳戶 收取 費用 步驟 1 建立 筆記本 執行 個體 Amazon SageMaker 主控台 並在 左邊 功能 列中 點擊 筆記本 筆記本 執行 個體 右邊 主 畫面 中 點擊 建立 筆記本 執行 個體 下圖 所示 圖 4 啟動 Amazon SageMaker 筆記本 建立 筆記本 執行 個體 頁面 筆記本 執行 個體 名稱 欄位 中 輸入 名稱 教學 ithomeSM 做 執行 個體 名稱 選擇 名稱 筆記本 執行 個體 類型 保留 ml t2 medium 預設 IAM 角色 欄位 中 選擇 建立 新 角色 建立 IAM 角色 視窗 中 預設值 不需 改變 點擊 建立 角色 按鈕 Amazon SageMaker 建立 角色 許可 並將 分配 執行 個體 帳戶 中 選擇 現有 IAM 角色 點擊 建立 筆記本 執行 個體 按鈕 下圖 所示 圖 5 建立 筆記本 執行 個體 新建 筆記本 執行 個體 等待 數分鐘 才 會 待處理 pending 轉換 服務 中 InService 狀態 狀態 變為 服務 中 選取 ithomeSM 動作 下拉 式 功能表 將其 開啟 選擇 服務 中 狀態 旁 開啟 Jupyter 下圖 所示 圖 6 透過 Jupyter 筆記本 執行 個體 開啟 Jupyter 畫面 右手邊 單擊 New 按鈕 下拉 選單 選擇 conda python3 下圖 所示 圖 7 透過 Jupyter 筆記本 執行 個體 步驟 2 操作 筆記本 簡單 KNN 近臨 案例 體驗 Amazon SageMaker 筆記本 操作 相 觀賞魚 辨識 模型 操作 將於下 一篇 文章 中 示範 這是 KNN 算法 一組 電影 分類 電影 數據 包含 10 條數 據集 測試 集 2 條數 訓練 集 這批 電影 共有 兩個 畫面 動作 鏡 頭數 接吻 鏡 頭數 兩個 特徵 每部 電影 分類 標籤 值 共有 “ 動作 ” “ 愛情 ” 兩個 類別 程式碼 運行 圖 8 筆記本 執行 個體 中 Jupyter AWS 提供 很多 Amazon SageMaker 筆記本 範例 頁 簽中 Amazon SageMaker Examples 中 找到 開發者 試著 找到 相關 案例 參考 圖 9 Amazon SageMaker 筆記本 範例 集合 參考資料 Amazon SageMaker CreateEndpointConfig AWS Pricing Calculator 建立 訓練 部署 機器 學習 模型 Amazon SageMaker",
    "前天 龍 雀斑 公主 音樂 真的 好聽 劇情 烘托 的還 不錯 網路 分身 題材 時 會 興趣 作者 搜集 資訊 描述 裝置 近期 兩個 動漫 86 戰區 龍 雀斑 公主 說 知覺 共享 說 日本 很多 很多 技術 玩 很多 礙於 語言 障礙 辦法 觸及 相關 最新 資訊 86 作者 找 不到 太 訊息 龍 雀 採訪 細田守 找 相關 技術 研究 人員 訪問 制定 5G 網路 人員 永田 聰 Human Computer Interaction 研究 人員 玉城繪 美 Emi Tamaki 說 更 進階 VR 視覺 聽覺 之外 還要 觸覺 模擬 受器 感覺 訊號 電腦 模擬 號 經電 刺激 轉給 人體 而玉城 繪美 公司 開發 產品 手部 互動 之外 貌似 虛擬 物體 會 給予 人體 感覺 模擬 產品 連結 發售 我要 先 兩個 論文 先 放在 有空",
    "存 文字 檔 log 取代 print 解決 網格 分母 部位 過小",
    "Day 34 實作 S3 驅動 Lambda 函數 YOLO 物件 辨識 這是 微 服務 架構 需將 AWS Lambda 函數 改變 成 YOLO 物件 辨識 模型 達成 YOLO 物件 辨識 功能 圖 1 S3 驅動 Lambda 函數 YOLO 辨識 架構圖 github 找到 專案 非常簡單 上傳 事先 壓縮 darknetmin zip Lambda 函數 中 運行 專案 事實上 是將 事先 LInux 環境 編譯 YOLOv3 執行 檔 darknet 相關 參數 檔 壓縮 darknetmin zip 中 流程 所示 實際操作 一遍 下載 程式碼 上傳 相關 檔案 S3 建立 IAM 角色 執行 AWS Lambda 並有 存取 S3 許可 建立 AWS Lambda 函數 修改 佈署 程式 測試 步驟 下載 程式碼 網站 中 下載 darknetmin zip 下圖 所示 圖 2 下載 darknetmin zip 步驟 二 上傳 YOLO 相關 檔案 S3 AWS Lambda 函數 大小 256 MB YOLO 權重 檔存 S3 中 給定 數據 集 權重 訓練 檔案 傳到 S3 先前 下載 Lambda 程式碼 圖片 下圖 所示 圖 3 上傳 YOLO 相關 檔案 S3 步驟 三 建立 IAM 角色 建立 IAM 角色 執行 AWS Lambda 並有 存取 S3 許可 IAM 管理 控制台 選擇 新增 角色 接下來 下圖 所示 選擇 Lambda 案例 點擊 許可 按鈕 圖 4 建立 角色 選擇 Lambda 案例 搜尋 文字 框中 輸入 basic 找到 AWSLambdaBasicExecutionRole 連接 這將 角色 寫入 CloudWatch 記錄 檔 全縣 程式 除錯 之用 下圖 所示 圖 5 連接 基礎 CloudWatch 除錯 許可 政策 先前 設定 後並 輸入 角色 名稱 建立 角色 下圖 所示 圖 6 檢閱 設定 建立 角色 編輯 新 政策 內容 下圖 所示 給定 讀取 GetObject 儲存 貯體 A 寫入 物件 PutObject 權限 PutObjectAcl 儲存 貯體 B 圖 7 新增 政策 角色 設定 畫面 新建 政策 連接 角色 下圖 所示 圖 8 新增 政策 連接 先前 角色 步驟 四 建立 AWS Lambda 函數 AWS Lambda 管理 控制台 選擇 建立 Lambda 函數 設定 內容 下圖 所示 執行 時間 務必 選擇 Python 3.8 這是 github 專案 執行 角色 記得 選擇 步驟 設定 角色 圖 9 建立 Lambda 函數 設定 畫面 建立 Lambda 函數 自行 撰寫 上傳 壓縮 檔 第二個 步驟 中 Lambda 函數 代碼 傳到 S3 需 函數 設定 主 畫面 右邊 找到 上傳 按鈕 點擊 選擇 Amazon S3 位置 指定 位置 s3 ap southeast 1 amazonaws com darknetmin zip 畫面 所示 圖 10 建立 Lambda 函數 設定 畫面 步驟 五 修改 佈署 程式 測試 修改 地方 建 資料集 相關 檔案 物件 檔 obj data obj names 用來 辨識 物件 名稱 組態 檔 yolov3 cfg 需將 組態 檔 改名 放入 新 組態 檔 Lambda 函數 執行 環境 調整 Lambda 函數 本身 需求 調整 建 資料集 相關 檔案 相關 三個 檔案 純 文件 檔 需 AWS Lambda 操作 畫面 中 新增 檔案 操作 檔案 內容 請 參照 畫面 圖 11 Lambda 函數 中 新增 建 資料集 相關 檔案 Lambda 函數 執行 環境 程式碼 頁 簽中 下方 執行 時間 設定 選項 設定 上圖 中 Lambda 函數 函數 點是 service py 執行 時間 設定 中 設定 常式 service handler 畫面 圖 12 執行 時間 設定 中 設定 常式 組態 頁 簽中 選擇 組態 記憶體 MB 設定 2048 5120 M 逾時 設定 2 分鐘 畫面 圖 13 組態 頁 簽中 設定 組態 Lambda 函數 本身 修改 指定 權重 檔 測試 圖片 所在位置 並將 原本 執行命令 改成 darknet detector test cfg obj data cfg yolov3 cfg 才 預設 coco data 標籤 圖 14 修改 service py 內容 修改 完畢 佈署 Deploy 設定 測試 test 計畫 內容 測試 即可 確認 會 約 60 幾秒 才 會 影像 辨識 下圖 所示 圖 15 執行 YOLO Lambda 辨識 功能 輸出 整行 輸出 複製到 編輯器 中 辨識 下圖 所示 圖 16 YOLO 辨識 反應速度 批次 即時 反應速度 太慢 找 工具 需求 參考資料 YOLO Lambda Day 15 YOLO 相關 設定 Day 16 影像 辨識 訓練 Day 33 實作 S3 驅動 Lambda 函數 鏡像",
    "篇 內容 中 資料庫 連線 字串 放進 程式碼 中 並寫 死 常規 程式 開發 中 程式 會 連線 內容 放到 環境 變數 中 程式碼 中 這類 帳號密碼 程式 放到 很多 環境 時 才能 改動 程式 情況 修正 環境 變數 快 速將 程式 部署 環境 中 環境 變數 整體 電腦 台 電腦 中 透過 修改 變數 部署 同一個 電腦 環境 變數 一同 改掉 這次 會 套件 套件 檔案 中 設定 環境 變數 不用 先將 環境 變數 設定 電腦 中 套件 提供 功能 將他 autoload 放在 import init 功能 預設 env 載入 env 放到 gitignore 建立 env example 未來 建立 檔案 先 env example 找到 環境 變數 設定 透過 env 檔來 設定 操作步驟 git 連結 放在",
    "繼 前天 新創 apple id developer 沒 付費 狀態 好像 personal team 狀態 github 找到 先選 計算機 程式 試試看 程式 下載 說 做 做 差別 示範 App 製作 ios13 ios 版本 15 修改 改完 ios 版本 跳出 修正 AppIcon 指示 少 1024x1024 軟體 圖示 簡單 原本 60x60 圖示 預覽 程式 調整 大小 另存 修正 資料夾 內 contents json 驚嘆號 修正 嘗試 APP build 進 i7 手機 裡 不行 Unable prepare iPhone development Please check connection device review errors Devices Simulators window 手機 iPhone 7 本來 xcode 13 i7 不合 改成 先 simulator i8 i7 都行 app 只能 介面 按鍵 計算機 沒 本來 App 做 介面 樣子 幾個 懷疑 usbTypeA 母 轉 usbTypeC 公 支援 數據傳輸 這不 有用 轉接頭 傳輸 資料 進 隨身 碟過 iPhone 7 支援 Simulator 先放著 Xcode 登入 新 apple id 已登記 developer personal team 手機 原本 apple id 改成 新 apple id 才能 寫入 手機 ios 15.1 版本 更新 更新 才能 打算 先 手機 apple id 登出 改成 新 apple id 試 這步 不行 會 先 改回 apple id 執行 ios 版本 更新 原本 apple id 新 apple id 各試 ok 結論 apple id 做 3 更動 順利 APP build 進 手機 打開 程式 尚未 信任 開發者 說 設定 中 APP Apple 官網 教學 指示 操作 手機 裡 描述 檔 選項 寫 VPN 裝置 管理 點 進去 信任 就行 補充 本身 手機 教學 安裝 developer APP 登入 新創 apple id 做 寫 進去 試試看 中途 APP 寫 進去 手機 程式 卡住 開機 手機 解決 Bug 幸運 5 會 持續 帶來 充滿 bug 解決 方式 參考 瘋",
    "本來 參考 Nano 腳位 板子 寫 程式 內 數字 差 3 號 也就是說 板子 D8 腳位 程式 裡要 寫 11 這張 圖 買 副 廠板 試出來 腳位 板子 digital 腳位 名稱 程式 內要 寫 數字 應 說 原本 參考 腳位 只能 說 前 幾天 試 成功 那次 蝦 成功 剛好 插 腳位 囧 附個 副 廠板 說明書 我能 說明書 訊息 能看懂 Pin 13 LED Yellow 紀錄 腳 位圖 所說 訊號 D13 抓 Bug 板子 燈號 Red Yellow 本來 想 試試看 RX0 TX1 等於 D0 D1 我剛 插上去 RX0 會 麵 包板 LED 常亮 板子 4 LED 右邊 寫 RX 燈號 常亮 TX1 則是 會 麵 包板 LED 閃爍 板子 上右 2 LED 會 閃爍 看不出 Blink 成功 先 放棄 搞 究竟 參考 文章 副 廠板 設定 奇怪 買 副 廠板 試出來",
    "Hello iT 邦 幫忙 粉絲 本篇 Re 從零開始 Xamarin 技術 來複 刻過去 開發 App TopStore 系列 文 EP32 本篇 EP32 要來 介紹 EP1 EP21 的雙 平台 TopStore App 利用 Xamarin Forms 轉換成 接下來 NET 開發技術 中 頗受 矚目 NET Multi platform App UI MAUI 撰寫 方式 唷 要將 Xamarin Forms 轉換成 NET MAUI 撰寫 幾個 需 考量 條件 App 開發 中 利用 Xamarin Forms 第三方 套件 支援 NET 6 MAUI App 成長性 遷移 MAUI 必要性 做 發展 NET 6 微軟 接下來 NET 版本 NET MAUI NET 6 正式 釋出 2021 11 8 時間 點而 正式 釋出 2022 年 Q2 才 機會 正式 釋出 興趣 朋友 參考 時間 點要 Xamarin Forms 專案 遷移 NET MAUI 本篇 介紹 介紹 法 囉 撰寫 本篇 EP32 時間 點 來看 最新 釋出 或許 捧 友會問 EP1 EP21 EP22 會 這篇 介紹 SQLite 介紹 sqlite net pcl 套件 作者 GitHub 2021 11 13 補充 更新 MAUI 專案 當中 SQLite 微軟 官方 伴隨 NET 6 釋出 EF Core SQLite 參考 文件 微軟 文件 Xamarin 當中 EFCore EF Core GitHub EF Core SQLite Nuget 裝 Visual Stuido 2022 version 17.0 RC3 Preview 7 版本 理論 記得 透過 Visual Studio Installer 安裝 記得 勾選 NET MAUI 元件 安裝 Visual Studio 2022 當中 選擇 MAUI 專案 範本 新增 專案 專案 範本 中 搜尋 MAUI 建立 MAUI 設定 Visual Studio 2022 建立 MAUI 專案 範本 預設 空白 專案 範本 當中 會 MainPage xaml 預設 頁面 TopStore App XAML 放進來 MainPage xaml 刪除 刪除 完畢 EP21 TopStore App Xamarin Forms 專案 中 程式 複製 csproj App xaml cs AssemblyInfo cs 複製 皆 複選 複製 MAUI 專案 資料夾 當中 貼 貼 檔案 總管 呈現 貼 Visaul Studio 2022 方案 總管 呈現 開啟 文字 替換 窗格 並將 替換 設定 方案 文字 替換 窗格 中將 xmlns 點選 取代 替換成 xmlns 此次 TopStore App 專案 中 文字 替換 共有 6 替換 文字 替換 窗格 中將 Xamarin Forms Xaml 點選 取代 替換成 Microsoft Maui Controls Xaml 此次 TopStore App 專案 中 文字 替換 共有 4 替換 文字 替換 窗格 中將 Xamarin Forms 點選 取代 替換成 Microsoft Maui Controls 此次 TopStore App 專案 中 文字 替換 共有 13 替換 兩個 替換 OrdersPage SettingsPage XAML 標記 當中 Label 標記 設定 Text 顯示 文字 記得 改 文字 替換 窗格 中將 Xamarin Essentials 點選 取代 替換成 Microsoft Maui Essentials 此次 TopStore App 專案 中 文字 替換 共有 1 替換 打開 App xaml 原本 ResourceDictionary XAML 標記 內部 包含 XAML 標記 圈選 刪除 並貼 原本 TopStore App Xamarin Forms 當中 App xaml 撰寫 Resource 補上 其所 需 引用 XAML 命名 空間 Application Resources XAML 標記 撰寫 Application MainPage XAML 標記 設計 Shell XAML 標記 打開 AppShell xaml 並將 當中 撰寫 TabBar XAML 標記 複製 貼入 剛剛 App xaml 中 設計 Shell XAML 標記 當中 補上 其所 需 引用 XAML 命名 空間 打開 App xaml cs MainPage 指定 MainPage 程式碼 移除 原本 AppShell xaml cs 當中 路由 指定 設定 Visual Studio 方案 總管 當中 Assets 資料夾 當中 FontAwesome5 otf 檔案 搬移到 Resources 底下 Fonts 資料夾 搬移 沒 Assets 資料夾 AppShell xaml 檔案 刪除 打開 MauiProgram cs 檔案 找到 ConfigureFonts 將其 原本 設定 字型 檔 換成 TopStore App 當中 所用 FontAwesome5 otf 相容性 當中 透過 右鍵 選單 選取 新增 參考 選取 Maui Plugin BaseBindingLibrary dll 先前 透過 Nuget 安裝 Xam Plugin BaseBindingLibrary 替換成 Maui Plugin BaseBindingLibrary dll 參考 會 平台 組件 增加 Maui Plugin BaseBindingLibrary 會 發布此 DLL 透過 Nuget 安裝 版本 文字 替換 窗格 中將 Xam Plugin 點選 取代 替換成 Maui Plugin 此次 TopStore App 專案 中 文字 替換 共有 2 替換 編輯 會 編譯 快取 XAML cs 順利 整合 作法 關閉 Visual Studio 開啟 專案 關閉 Visual Studio 時 記得 儲存 變更 再次 開啟 TopStore App MAUI 專案 相關 錯誤 訊息 發生 方案 總管 當中 透過 選取 右鍵 選單 重建 方案 選項 等待 一段時間 建置 成功 上圖 截圖 當中 眼尖 捧友 會 Visual Studio Mac 做 連線 MAUI 官方 預設 建置 平台 會 建置 iOS Android macOS Windows 應用程式 iOS Simulator Android Emulator NET MAUI Android 微軟 官方 努力 改進 2022 02 13 補充 更新 MAUI Preview 12 當中 已能 顯示 List 客 製 化 項目 內容 2022 04 16 補充 更新 MAUI Preview 14 當中 已能 顯示 App Title MenuItem 內容 操作 ListView 項目 調整 撰寫 XAML 跑 版 macOS MacCatalys Windows 10 參考 文件 Announcing NET MAUI Preview 9 Migrate your app Xamarin Forms Xamarin Essentials 1.7 introducing NET MAUI Essentials",
    "Hexo 架設 Blog 僅僅 幾秒鐘 時間 細部 調整 時 會 不少 困難 記錄 排除 簡介 Hexo 主題 做出 個人化 配置 修改 1 啟動 本地 伺服器 hexo server 時 告警 版本 Hexo 5.4 0 錯誤 訊息 參考資料 爬 文章 大概 2020 年 相關 資訊 後續 改版 會 修正 不得而知 參考 解決 發生 原因 Hexo 依賴 nib 1.1 2 套件 指定 舊版本 stylus 套件 停止 維護 修改 解決 解決 方式 編輯 package json 專案 設定 檔 設定 指定 最新 stylus 版本 執行 指令 yarn install 安裝 完 npm install 無效 注意事項 透過 指令 安裝 主題 設定 會 覆蓋 再次出現 告警 再次 執行 yarn install 修復 2 Hexo Github Page 專案 中 檔案 共存 Hexo 發佈 Github 時會 覆蓋 掉 專案 目錄 想要 放 寫 靜態 頁面 專案 根目錄 存放 README md 打造 華麗 頁面 參考 會 deploy 動作 蓋掉 解決 方式 先 將要 部署 Github 檔案 放到 source 資料夾 修改 config yml 設定 檔 找到 skip render 字眼 檔名 資料夾 名稱 3 Hexo 套用 主題 尋找 喜歡 版型 點 進去 發現 連結 失效 就換 範例 頁面 主題 Github 連結 本次 Hueman 主題 為例 找到 小貓 圖示 順利 到達 找 文件 Hueman 放在 Github 首頁 底下 主題 撰寫 擺放 位置 太 找到 安裝 方式 主題 放在 首頁 寫 文件 裡 安裝 主題 git clone 方式 你將 專案 複製 npm install 方式 安裝 文件 寫 還要 以下幾點 git clone 方法 會 終端機 切換 當前目錄 位置 需 看清楚 文件 安裝 步驟 額外 設定 請將 文件 完 確保 遺漏 修改 Hexo config yml 設定 檔 theme 內容 改成 主題 名稱 修改 先 執行 hexo cl && hexo g && hexo s 重建 頁面 並啟 動 本地 伺服器 檢查 成功 4 Hexo 個人化 樣式 設定 佈景 主題 設定 方式 大致 兩種 編輯 themes 主題 名稱 config yml 檔案 git clone 下載 主題 網站 根目錄 建置 config 主題 名稱 yml 編輯 npm 安裝 主題 類型 主題 安裝 完 網站 資料夾 新增 檔案 套件 放在 node modules 到裡面 找到 主題 config yml 檔案 複製到 網站 根目錄 變更 檔名 config 主題 名稱 yml 做 修改 本次 介紹 Hueman 主題 開啟 themes hueman config yml 檔案 修改 修改 方式 參考 顏色 想 改掉 配置 主題 資料夾 搜尋 關鍵字 variable 會 名稱 存放 顏色 單位 樣式 Hueman 為例 找到 variables styl 檔案 大部分 顏色 更改 版面 配置 想要 做 顏色 調整 搜尋 關鍵字 style Hueman 為例 找到 style styl 檔案 想 設定 樣式 具備 自行 撰寫 css 能力",
    "摘要 前言 工具 流程 前言 提及 Windows YOLOV4 呼叫 本地 端 GPU 時 出現異常 部署 Colab 訓練 免費 Colab GPU 訓練 時 訓練樣本 數量 超過 3000 張 上傳 檔案 耗費 時間 40 60 分鐘 訓練 一半 Colab 斷線 導致 前功盡棄 變相 樣本 數量 近期 參考 網路上 分享 文章 嘗試 Windows 編譯 Darknet 本地 端 訓練 YOLOV4 模型 提高 訓練 樣本數 模型 訓練 效率 YOLOV4 Darknet 環境 部署 時 BUG 頻發 整整 踩 2 天 坑 想 一陣 後怕 此次 撰文 分享 YOLOV4 部署 Windows 本地 端 遭遇 解決 方法 做 筆記 下次 部署 時 坑 不想 踩 2 次 工具 更新 顯卡 驅動程式 詳細 請參閱 Visual stutio 2019 Microsoft Visual C++ 2015 2019 建議 先 安裝 Visual stutio 2019 Microsoft Visual C++ 2015 2019 安裝 CUDA cuDNN 2.1 下載 請 點擊 2.2 安裝 點擊 安裝 Visual stutio 2019 勾選 C++ 桌面開發 CUDA cuDNN CUDA 版本 10.1 cuDNN 版本 7.6 詳細 請參閱 OpenCV 版本 4.5 4 4.1 下載 請 點擊 4.2 安裝 記下 安裝 路徑 4.3 新增 環境 變數 系統 變數 OpenDIR C Users 88691 Desktop YOLOV4 opencv build Path C Users 88691 Desktop YOLOV4 opencv build x64 vc15 bin Cmake 請 點擊 下載 ZED SDK 請 點擊 下載 AlexeyAB darknet 請 點擊 下載 流程 建立 專案 1.1 開啟 Visula Studio 2019 點擊 建立 新 專案 1.2 點擊 空白 專案 1.3 點擊 新增 項目 新增 C++ 檔 cpp 供 後續 驗證 OpenCV 成功 設定 設定 OpenCV 路徑 2.1 點擊 左下方 屬性 管理員 右鍵 點擊 release X64 點選 新 屬性 專案工作 表 2.2 設定 屬性 專案工作 表 點擊 PropertySheet 開啟 屬性 → V C++ 目錄 → Include 目錄 → 新增 3 路徑 上圖 編號 3 C Users 88691 Desktop YOLOV4 opencv build include C Users 88691 Desktop YOLOV4 opencv build include opencv C Users 88691 Desktop YOLOV4 opencv build include opencv2 V C++ 目錄 → 程式庫 目錄 → 新增 路徑 上圖 編號 4 C Users 88691 Desktop YOLOV4 opencv build x64 vc15 lib ※ Visula Studio 2015 選擇 vc14 Visula Studio 2017 2019 選擇 vc15 連結 器 → 輸入 → 相依 性 → 新增 路徑 opencv world454 lib 驗證 OpenCV 啟用 將待 驗證 圖片 放入 Project2 程式碼 剛剛 新增 C++ 檔 cpp 中 輸入 程式碼 執行 選取 Release x64 點擊 本機 Windows 偵錯 工具 成功 顯示 影像 2.3 執行 錯誤 解決 方法 找 不到 opencv world454 lib 新增 系統 環境 變數 C Users 88691 Desktop YOLOV4 opencv build x64 vc15 lib 找 不到 opencv world454 dll 新增 系統 環境 變數 C Users 88691 Desktop YOLOV4 opencv build x64 vc15 bin 編譯 Darknet 3.1 AlexeyAB darknet 下載 darknet master zip 解壓縮 3.2 開啟 Cmake 設定 路徑 3.3 點擊 ConFigure → 輸入 x64 → 點擊 finish 3.4 Looking a CUDA compiler – NOTFOUND 解決 方法 確認 改善 時 記得 開啟 Cmake Delete Cache 再次 點擊 ConFigure → 輸入 x64 → 點擊 finish 重新安裝 先 安裝 Visual Stutio 安裝 CUDA 控制台 → 新增 移除 程式 → 查看 安裝 NVIDIA Tools Extension SDK NVTX 確認 路徑 中 4 檔案 路徑 1 檔案 複製到 路徑 2 路徑 1 C Program Files NVIDIA GPU Computing Toolkit CUDA v10.1 extras visual studio integration MSBuildExtensions 路徑 2 C Program Files x86 Microsoft Visual Studio 2019 Community MSBuild Microsoft VC v160 BuildCustomizations 嘗試 安裝 版本 CUDA 3.5 點擊 Generate 產出 新 Darknet sln → Open Project 3.6 生成 解決方案 選取 Release x64 點擊 建置 → 建置 方案 3.7 生成 解決方案 時 拒絕 存取 點擊 方案 總管 → 點擊 滑鼠 右鍵 建置 ALL BUILD INSTALL 3.8 成功 生成 解方 方案 build darknet Release5 中 5 檔案 複製到 build darknet x64 執行 Darknet 訓練 模型 4.1 事前 按此 下載 解壓縮 成 train 資料夾 資料集 放進 train VOCdevkit VOC2021 JPEGImages LabelImg 標記 XML 檔 放進 train 底下 VOCdevkit VOC2021 Annotations train 資料夾 移到 C Users 88691 Desktop YOLOV4 darknet master build darknet x64 4.2 執行 gen train val py 分配 訓練 集 測試 集 4.3 執行 voc label py datasets 預處理 標記 Train Test Val 資料集 4.4 開啟 obj data 路徑 修改 成 絕對路徑 4.5 開啟 cmd 視窗 輸入 指令 cd C Users 88691 Desktop YOLOV4 darknet master build darknet x64 4.6 輸入 指令 darknet detector train C Users 88691 Desktop YOLOV4 darknet master build darknet x64 train obj data C Users 88691 Desktop YOLOV4 darknet master build darknet x64 train yolov4 tiny myobj cfg C Users 88691 Desktop YOLOV4 darknet master build darknet x64 train yolov4 tiny conv.29 map 4.7 執行 時 錯誤 解決 方法 找 不到 pthreadVC2 dll 前往 C Users 88691 Desktop YOLOV4 darknet master 3rdparty pthreads bin 複製 pthreadVC2 dll 複製到 C Windows System32 C Windows System64 資料夾 內 找 不到 opencv world454 dll 前往 C Users 88691 Desktop YOLOV4 opencv build x64 vc15 bin 複製 opencv world454 dll 複製到 C Users 88691 Desktop YOLOV4 darknet master build darknet x64 資料夾 4.8 YOLOV4 模型 訓練 4.9 模型 預測 程式碼 執行 成功 框選 字串 小結 久違 原以 這篇 寫到 一半 會 偷懶 擱置 畢竟 Debug 夠累 出乎意料 回過 神 寫 完 想 參加 鐵人 賽 一個月 養成 學習 撰文 分享 習慣 ... 參考資料",
    "試試看 做個 簡單 手機遊戲 先 build 流程 理順 再來 開發 這次 參考 Unity Learn 教程 Windows 安裝 Unity 基於 MacBook 雙系統 錯誤 mac 雙系統 windows10 安裝 unity 選擇 dev tools android build ios build 沒 辦法 安裝 unity 軟體 會 錯誤 改成 分批 安裝 先 安裝 android build 再來 ios build 再來 visual studio 成功 0.0 註冊 IOS 開發者 前 先 建立 Apple ID 教程 開發者 網頁 certificate 拿到 東西 Apple ID Apple ID 開發者 才行 IOS 開發者 開發者 付年費 ... 想 嘗試 開發 窮學生 代價 高 還好 好像 免費 開發 方式 條件 Mac 電腦 用到 Xcode 創建 新 Apple ID 混用 走 正規 路 這部 影片 免費 開發 路線 走 走到 Appuploader 時換 走 先 結束 確認 工具 安 方法 接下來 理論 上要 做 事 Windows build ios project project 丟 mac Xcode 編譯 ... 一條 路 mac 嘗試 想 做 project 光是 iOS APP 編譯 上傳 手機 中 就要 費功夫 感覺 不想 花 7500 元去 正式 開發 員 .... 參考",
    "先說 mac 雙系統 win10 本來 想 mac os 做 下載 說明書 裡有 驅動程式 exe 結尾 只好 改用 windows 副 廠板 下載 說明書 下載 IDE 安裝 打開 IDE 開發板 選擇 Arduino Nano 調整 序列 埠 序列 埠 灰色 我用 說明書 附帶 驅動程式 安裝 找 序列 埠 上傳 空白 程式 失敗 嘗試 插拔 Nano 關掉 IDE 沒 辦法 錯誤 處理器 切換 成 帶有 Old Bootloader 上傳 LED 亮亮 可惜 遵照 接法 先接 5V 電路 先 LED 杜邦 線 成功 LED 會常亮 範例 程式 Blink 悲傷 插 pin 腳 D8 程式 內寫 11 成功 LED 閃爍 詭異 再也 重現 pin 腳 D2 D5 D8 試過 D8 成功 洗掉 成功 期間 插回 5V 確認 電路 運作 .... Sad 11052021 更新 digital 腳位 找到",
    "二元 樹 展開 成 linked list 順序 preorder traversal 三種 traversal 模式 每次 preorder inorder 會 搞混 這題 圖片 先 找父 節點 找 子點 每次 模式 記成 inorder 這題 提示 說 寫成 O 1 寫法 思路 回傳 值 void 懞 cout cout print preorder 順序 cout 空 陣列 沒 概念 想到 O n 解法 創建 linked list 變數 Preorder traversal 一遍 樹 巡到 值 塞入 list 中 結束 C++ 筆記 程式碼 void 基本上 原本 給的 變數 內容 改成 答案 本來 想想 O 1 解法 睡著 說 O 1 空間 時間 postorder 方式 原本 樹 拆解 參考",
    "系列 昨天 流逝 45 天 時間 期間 會 懷疑 寫 文章 夠不夠 所學 知識 好像 拿來 教學 強迫 學習 麻煩 事物 這也 第一次 下定決心 認真對待 某件事 情 接下來 來回 顧 45 天 文章 介紹 系列 前 15 天 介紹 物件 原型 相關 方法 藉此 找回 收納 記憶 藏 寶箱 中 知識 接下來 10 天 打造 專屬 函式 庫 滿意 函式 這是 需求 打造 第一個 函式 系列 20 天 函式 庫 範例 當中 想不出 主題 不想 放棄 開賽 前 成熟 學習 更 知識 對待 事情 完 賽後 學習 程式 語言 指標 會 再次 參賽 差不多 尾聲 文章 疑問 下方 提問 建議 Felix 下次 再見",
    "接下來 內容 中 會 gorm 接上 postgreSQL 過程 補充 golang 兩種 用途 main go 執行 檔案 中 會 執行 這段 function main package 中 import package import 前放上 會 執行 內容 log log go main go 輸出 會 log message main message",
    "篇 回顧 講到 會議 很煩 冗長 沒 重點 還要 開 幾次 不熟 域 連對 認知 落差 講到 說 故事 聽者 快速 了解 流程 講到 敏捷 宣言 裡 鼓勵 互動 協作 Cost Change Curve 一篇 講到 敏捷 開發 宣言 Waterfall TDD Agile 面臨 需求 變更 錯誤 修復 成本 Waterfall TDD 開發 前 先寫 Test 設計 開發 軟體 Agile Reduce feedback cycle Agile 兩種 顏色 Green Red Red 成本 高 作法 文化 習慣 Green 則是 低 成本 透過 Model Storming DDD Domain storytelling event storming other medeling methods ... 減少 設計 需求 梳理 理解 錯誤 透過 Stackholder 協作 互動 減少 設計 需求 梳理 理解 錯誤 兩個 階段 提早 發現 及早 Feedback 浪費 後期 才 發現 盡量 消弭 浪費 則能 面對 變化 錯誤 時 敏捷 But 公司 沒 Waterfall 浪費 硬 改變 What Domain DDD 作者 Eric Evan 提出 Domain 定義 A sphere knowledge influence activity The subject area user applies a program domain software 字 sphere Eric Evan 描述 維度 XD 同義字 Domain knowledge influence activity 用戶 圍繞 三個 主題 範疇 軟體 滿足用戶 用戶 執行 軟體 支持 滿足用戶 需求 軟體 支持 Domain Storytelling 來說 Waterfall 流程 搭配 文字描述 不難 看得懂 用講 搭配 畫面 播放 XD Domain Storytelling 來說 Stakeholder 參與 協作 流程 差別 先請 規劃者 來說 故事 開發者 聽 當下 開發者 快速 畫出 業務流程 請 規劃者 閱讀 協作 修正 提倡 提早 認知 規劃者 協作 交互 溝通 業務流程 認知 拉其 一種 方法 介入 時機 點 Benefits Telling Storeis Visualize Business Flow Designer 針對 理解 Domain 範疇 一部 份 快速 假設 出 Prototype 驗證 Q 開發人員 Domain 剛好 Designer 認知 範疇 一模一樣 Q 開發 軟體 早點 假設 部份 給具 現化來 討論 驗證 快速 給出 Telling Storeis Visualize Business Flow 好處 懶得 細細 描述 出自 Domain Storytelling 一種 協作 建模 工具 目的 來自 背景 與會 人員 透過 可視化 故事 說 故事 方式 學習 領域 範疇 Pictorgraphic Language 進 書本 第二章 講 畫布 內容 文法 Actor 句子 裡的 主詞 一群 系統 外部 服務 Work Object 句子 裡的 受詞 Actor 之間 戶通 有無 東西 實體 事物 虛擬 事物 資訊 說 故事 特別 地去 區別 數據 事物 資訊 Activity 句子 內 動詞 剛剛 Actor Work Object 名詞 方向性 指向 接收 方 Sequence Number 標示 Activity 數字 故事 中會 一堆 句子 數字 用來 故事 裡的 句子 順序 舉例 7 號 句子 會 6 號 句子 被講 廢話 廢話 數字 了解 前後文 關聯 方向 Annotation 想 補充 資訊 Actor WorkOjbect 狀態 條件 表達 想講 寫 Activity 想 做 補充 別寫 散文 這就 蠻多 元素 類似 Grammar 故事 中 句子 表示法 文法 學習 門檻 低 Avoid Grammar Loopbacks 描述 API User 做出 動作 本來 期望 會 預期 資訊 更 在意 業務流程 Conditional 在畫 講故事 描述 流程 業務 運作 方式 Domain Storytelling User Story 做 產品 會 UserStory 描述 需求 快速 講 轉換 語法 Domain storytelling 慢慢 拆解 映射 User story mapping 實戰 工作坊 合適 講解 Domain Storytelling 轉換 Pictorgraphic Language User Story 大致 上到 Domain Storytelling 故事 講完 軟體 設計 想 才 疑惑 流程 大概 故事 流程 中 針對 角色 流程 方向 事物 用途 設計 出 邊界 邊界 Zoom In 分析 討論 也許 分工 各組 討論 嘗試 界 場景 內 找出 sub domain aggregate 再來 小組 玩 User Story Mapping 找出 價值 優先權 高 story 拆分 出 task 再來 各組 搭配 Example mapping 規格 Rule 規格書 會給 假設 出 情境 給出 期望 答案 展開 內容 做 整合 測試 UnitTest Gherkin 語法 還能 轉成 BDD 測試 案例 OO Analysis Design OOAD 拆成 Analysis Design OOA 辨識 What do OOD 辨識 出要 做 How do 流程 雷同 Divide Conquer 持續 repeat 細化 精化 ProblemSpace 拆解 梳理 過程 Project 投射 Requirement Layer 開發者 最愛 談 分層 設計 梳理 分析 再來 投射 Design 設計 設計 規格書 TableSchema UI 寫扣 投射 Implement 佈署 發布 一層 驗收 條件 上線 QA 背鍋 XD 工作 快 10 年 合作 不少 PM SA 說 很會 做 軟體 設計 沒 UML 圖 做 分析 設計 UI Prototype Table Schema 數十頁 文字 檔 月 工時 估算 每次 開會 我問 各層 驗收 條件 傻 住 講不 QQ 當下 回應 內容 這次 系統 沒 CRUD 日後 QA 跑 去問 測試 案例 常 回答 沒 辦法 畫面 資料庫 推斷出 流程 當初 設計 沒 給寫 視覺 化 日後 問時 會 忘 XD ... 真的 開發人員 腦補 XD QA 暗 只好 慢慢 探索性 測試 真有 公司 子 跑 流程 嘴裡 喊 敏捷 會 困惑 QQ 無形中 一堆 浪費 沒 改善 想 壓榨 時間 公司 軟體 系統 設計 Table Schema API Doc PM SA 寫 開發人員 真的 按表操 課 新 同事 前輩 後輩 只能 腦補 文件 想像 右 半邊 圖 OOAD 流程 懶得 細說 沒 驗收 條件 假 QQ 責任 QA 使用者 拋 有人 常講 以終 為始 角度 解讀 這句 有人 User 想 有人 資料 流在 想 身為 開發人員 更 喜歡 以中 為始 那層 業務 邏輯 變得 這的 業務流程 真的 變 資料庫 變動 API 協議 變動 畫面 變動 影響 業務 外部環境 領域 業務 外部環境 影響 影響 測試 保護 這層 只講 UI TableSchema 難怪 公司 沒 寫 測試 開發 團隊 問 測試 資料庫 裡阿 CRUD 只講 UI TableSchema 開會 時 爭執 細節 XD More Thinking Reference ps Domain Storytelling 淺顯易懂 好書 讀書會 開團 跑 工作坊 QQ",
    "挑戰 鐵人 賽 讀者 疑問 關閉 瀏覽器 時 發出 警告 阻止 瀏覽器 關閉 原本 寫 文章 付諸流水 明白 畢竟 經歷 切身 之痛 不止一次 下方 儲存 草稿 功能 總 完 字 按鈕 我花 五分鐘 思考 終於 想出 解決辦法 主題 離開 網頁 時 自動 發出 警告 主題 程式碼 實測 範例 連結 製作 中 差不多 尾聲 文章 疑問 下方 提問 建議 Felix 明天 再見",
    "空置 兩個 禮拜 我要 延畢 說 說 延畢 世界末日 接受 說法 希望 廢物 快點 出 社會 思路 說 反轉 一個二元 樹 看起來 像是 本來 Preorder 這棵樹 數值 會 由小到大 答案 Preorder 會 由大到 回傳 樹 root 乍一看 想 說 感覺 拜訪 左 child 右 child 想想 感覺 亂 盯 著樹 感覺 試試 點的 link child 交換 child 為止 程式碼 說 開心 刷 圖論 題目 第二 直覺 解法 這題 簡單 參考",
    "前 陣子 升級 作業系統 Big sur 失敗 導致 重灌 那種 資料 救 回來 那種 懶人 論文 資料 留 備份 一律 備份 近期 備份 空間 全數 吃掉 無奈 之下 才 備份 全數 刪除 掉 本來 想 說 沒 衰 ... 弄成 雙系統 Big sur 也給 信心 Big sur 雙系統 超 輕鬆 需用 隨身 碟 會試 windows 作業系統 unity unreal 說 Mac 不好 至少 真的 喜歡 螢幕 喇叭 也許 硬體 兩種 作業系統 切換 挺 會 簡單 簡單 更新 紀錄 嘗試 時 心得 碰到 狀況",
    "新增 訂單 callback 計算 交割 金 功能 這部分 整合 進 機器人 跑 兩支 交易 機器人 跑 兩支 機器人 會 機器人 記錄 交易 紀錄 帳戶 交割 金",
    "本書 聽到 協作 方法 書本 第一章 講到 Telling stories 好處 將前 兩 章節 內容 做成 投 影片 簡單 部門 分享 這幾天來 文字 形式 分享 前言 常見 會議 情況 情境 1 專案 產品 Kickoff 時 會議 報告 形式 討論 價值 時間 很少 浪費 掉 會 沒 結論 方式 說 下次 會議 情境 2 會議 中 有人 報告 時 很多 報告 內容 解決 很多 領域 專有名詞 情境 3 會議 對著 畫面 操作 動線 爭論 針對 細節 做 討論 有的則 會議 討論 資料庫 表格 設計 分析 見解 情境 1 會議 聽 PM 企劃 畫面 草稿 行銷 手段 介紹 也許 創新 產品 沒 針對 既有 需求 畫面 草稿 行銷 企劃 很難 與會 人員 理解 完整 域 相關 業務流程 情境 2 與會 人員 理解 完整 域 相關 業務流程 背景 專長 常見 狀況 人講 講會 講到 API Table ... 與會 人員 一半 管理 企劃 行銷 在講 情境 3 針對 細節 展開 爭執 這是 認知 理解 程度 自然而然 想像出來 蕭煌奇 眼 眼前 黑 黑 說 白 白 說 天空 藍 記憶 中 那團 白雲 背後 藍天 書上 第一篇 講到 觀點 conversations cannot adeqquately replaced written formal specifications attempts do so even widened gap between business software development 交談 溝通 取代 書寫 正式 規範 只靠 交談 溝通 只會 業務 軟體 開發人員 之間 gap 更深 consider software development approaches like agile Domain Drivent Design BDD these philosophies foucs feedback stackeholder involvement nevertheless making great bussiness software hard but rarely because technical problems because software developers need understand how day day busniess operates they need become domain experts themselves whole domain but least part they build software 像是 Agile DDD BDD 更 鼓勵 回饋 stackholder 參與 構建 出 商業 服務 頗 難 難 部份 技術 更 業務 開發人員 了解 日常 業務 運作 方式 試圖 負責 部份 領域專家 書上 引述 一段 ' s developers mis understanding expert knowledge gets released production 發布 軟體 認知 開發人員 理解 誤解 領域 專業知識 講 白話 點 開發人員 規格書 理解 分析 加上 書上 這段 論點 溝通 協作 更 有效率 討論 領域 認知 快速 建立 認知 這時候 說書人 說 故事 簡單 成效 方法 說 故事 前 召集 會議 日常 還蠻 活動 會議 形式 展開 類似 小團體 圍成 圈 討論 形式 像是 Campfires 營火 夠大 圈 營火 圈 少點 營火 則是 目光 聚集 對象 這類 活動 會 主持人 說書人 旁邊 講述 事情 形式 很快 融入 上圖 主持人 做起 動作 聚焦 主持人 身上 事情 一堆 才能 帶動 做出 動作 想 不必 上圖 這張 想 營火 聚會 聚集 來自 背景 膚色 性別 愉悅 溝通 討論 凡事 總有 But 開會 老闆 想要 聽到 結論 But 開會 形式 有效率 會議 中 結論 我想給 台詞 大多 長官 會後 招開 會議 討論 下次 結論 這另開 會議 開發 團隊 天時 程 ... 開發 團隊 業務 之間 gap 依然 時間 經驗 消弭 搞不好 下次 長官 想法 稍微 變化 順序 重複 Loop 回到 情境 1 結論 ... 開發 團隊 X 只會 時程 做 業務 單位 x 開發 團隊 能力 給了 厚厚的 文件 每次 做錯 Campfires 示意 描述 開發 團隊 Stakeholder 業務 單位 聚在一起 請 Stakeholder 業務 單位 說 故事 方式 開發 團隊 接觸 真實 客戶 無訪 反正 業務 單位 窗口 Story Telling 說 故事 總 有人 說書 小明 進到 市場 低於 1 斤 20 橘子 則買 一斤 吐司 特價 則買 一條 三 英打 呂布 關羽 擋住 呂布 刺擊 張飛 劉備 則從 砍擊 描述 事實 描述 事實 順序 正好 業務 順序 時間 線上 關係 小明 進到 市場 冬季 快 關門 買 1 斤 18 橘子 買 一條 特價 吐司 虎牢關 三英 呂布 關羽 擋住 呂布 刺擊 張飛 劉備 發現 呂步 側門 大開 立刻 砍擊 扯 一堆 幹話 沒 講到 討論 是舉 論點 來講 幹話 敏捷 開發 宣言 裡說 Individuals interactions over processes tools Working software over comprehensive documentation Customer collaboration over contract negotiation Responding change over following a plan Individuals interactions over processes tools 成員 互動 比起 工具 做 抽象 流程 這的 指 效率 呼應 主題 討論 Customer collaboration over contract negotiation 客戶 協作 討論 比起 文件 合約 協商 想 轉個 角度 想 成 傳統 SA PM 文件 公司 希望 到位 等到 文件 寫 符合 客戶 需 大概 來來回回 數次 修改 協商 確認 版本 沒 說 這不 來來回回 找 客戶 當場 確認 修改 會 簡易 討論 宣言 發現 成員 互動 客戶 協作 討論 想必 會 省去 初期 投入 一堆 時間 寫 文件 邀請 Domain expert 開發人員 講解 故事 這張 圖 想 表達 說 故事 方式 傳達 業務 領域 知識 比起 一堆 流程圖 傳達 更為 簡單 懂 不費 太 功夫 文件 補上 事後 追加 進去 先 開發人員 理解 足以 理解 貼合 業務流程 所需 一篇 寫 Domain Storytelling 這方 法 工具",
    "實作 輸入 網址 RSS 閱讀器 主題 程式碼 實測 範例 連結 製作 中 差不多 尾聲 文章 疑問 下方 提問 建議 Felix 明天 再見",
    "習慣性 地點 一杯 手搖 飲 咖啡 喝完 杯子 ... 喝 飲料 裝 友 A 外帶 飲料 裝 友 B 杯子 嘞 友 A 哪種 杯 友 B 店家 提供 杯子 友 A 喝完 杯子 友 B ... 垃圾桶 回收 桶 友 A 喔 ... 有沒有 更好 做法 友 B 自備 環保 杯 友 A 聽 不錯 沒帶 環保 杯 出門 友 B 只能 店家 杯子 ... 日常 看起來 平凡 無所謂 對話 ... 卻是 成爲 環境 劊子手 大自然 輕易 分解 消化 掉 杯子 ... 有個 提供 循環 杯 平台 服務 ... 店家 提供 租借 杯子 使用者 完後將 杯子 放 回 歸還 站 回收 杯子 清洗 提供 店家 續用 會 提供 循環 杯 平台 平台 服務區 臺灣 台北 新竹 台 中 台南 借用 Line QRcode 提供 型態 借 杯杯 店鋪 借杯 自助 借杯機 愛 地球 外送 杯杯 店鋪 還杯 自助 歸還 站 業者 開發 宣傳 平台 FB Line google 表單 Notion Figma 平台 服務區 臺灣 台北 台大 校區 周邊 店家 借用 Line QRcode 台大 學生證 提供 型態 借用 方式 借用 學生 社團 借用 公司 行號 借用 還杯 方式 店家 還杯 甲 店租 乙店還 集點 換物 活動 平台 服務區 歐盟 北美 借用 戴 Android IOS APP 提供 型態 借用 方式 店家 借用 外送 平台 還杯 方式 自助 歸還 站 預約 到府 收杯 平台 服務區 德國 借用 戴 Android IOS APP 提供 型態 借用 方式 客戶 需先 支付 押金 返回 杯後可 退金 換杯 店家 借用 還杯 方式 店家 還杯 甲 店租 乙店還 締造 連結 ✣ 資訊 ⚙ ︎ 參考資料",
    "昨天 表 格式 表單 新增 資料 列 輸出 JSON 格式 主題 樣式 程式碼 實測 範例 連結 製作 中 差不多 尾聲 文章 疑問 下方 提問 建議 Felix 明天 再見",
    "Always keep your hand level your eyes 腦中 浮現 一句 話 歌劇 魅影 中 一位 教 舞蹈 夫人 提醒 著眾 魅影 繩索 襲擊 養成 文化 人才 參與 工程 團隊 深刻 體會 沉住氣 才 出手 失準 體會 決策 慢 執行 快 參雜 擔心 毀於一旦 心 會 節奏 過慢 產品 經理 承上 啟下 開左闢 右 角色 慢 拿捏 度 會 轉離 團隊 會 團隊 轉離 方向 警戒 節奏 決策 慢 執行 快 狀態 難言 喻 或許 更 合適 說法 決策 穩 心中 會 節拍器 穩定 節奏 突發事件 轉瞬間 調整 步調 希望 表現 受 主管 給予 波動 加上 情緒 敏感 現象 會 昨天 發生 事件 主管 討論 過程 之中 彆扭 提出 拋出 想法 拉長 收集 訊息 區間 才 主管 達成 共識 過程 來說 新 表現 嘗試 習慣性 會 拋出 想法 更 難聽 一點 表述 過程 之中 呈現 自我中心 會 話題 嵌入 好聽 一點 樂於 分享 缺少 引導 傾聽 難 關鍵點 執行 會 難 正中 紅心 難怪 工具書 會 問個 警戒 不符 目標 小看 錯誤 會 公司 馬上 損失 持續 傷害 文化 錯誤 解讀 原因 歷史 老師 拍桌 故事 用力 拍 桌 沒 機會 問 緣由 幸好 工程 團隊 還小 推動 高等級 工程 團隊 經驗 還在 歷練 一對一 工程師 深聊 龐大 團隊 真的 會 發生 傷害 損及 團隊 文化 累積 就會 文化 毒瘤 這是 很大 學習 差點 就讓 動能 強 特質 工程師 緩慢 忙碌 身為 產品 經理 心中 永遠 記得 目標 商業 效益 目標 團隊 文化 目標 越想 越 團隊 才 機會 目標 靠攏 我要 加油 內 化成 直覺 Always keep your hand level your eyes 狀況 套索 拋擲 來時 才能 開啟",
    "實作 新增 刪除 資料 列 主題 樣式 程式碼 實測 範例 連結 製作 中 差不多 尾聲 文章 疑問 下方 提問 建議 Felix 明天 再見",
    "鐵人 賽後 一下子 放鬆 FIGHT 人員 技術人員 法規 技術 面 分類 提要 網路 架構 檢視 端點 防護 開發 防護 基準 盤點 清查 檢測 掃描 盤點 文件 清查 舊 系統 帳號 安全性 檢測 弱點 掃描 滲透 測試 資通 健診 安全性 檢測 目的 清查 系統 弱點 威脅 試圖 找出 並對 修補 實施 簡單 利用 軟體 工具 弱點 掃描 滲透 測試 即可 困難 地方 在於 事後 報告 弱點 修補 建議 工具 選擇 多多 一套 判讀 擁有 低 誤判 率 技術人員 建議 越早 階段性 掃描 提早 發現 弱點 加速 修補 過程 弱點 掃描 分為 主機 應用程式 網頁 找出 已知 弱點 廣義 來說 會 影響 資產 價值 機密性 完整性 可用性 可稱 弱點 執行 工具 則以 CVE 資料庫 比對 項目 風險 等級分 高 中 低 核心 資通 系統 會 至少 修補 高 中 風險 主機 弱點 掃描 工具 AP 網頁 弱點 掃描 工具 Acunetix Web Application Security Scanner 試用版 AppScan 滲透 工具 留在 一篇 ... 參考 資源",
    "實作 非 同步 請求 上傳 進度條 主題 程式碼 實測 範例 連結 製作 中 差不多 尾聲 文章 疑問 下方 提問 建議 Felix 明天 再見",
    "實作 向下 滾動 網頁 時 自動隱藏 頁 手 導覽 列 效果 主題 樣式 程式碼 實測 範例 連結 製作 中 差不多 尾聲 文章 疑問 下方 提問 建議 Felix 明天 再見",
    "完美 辦到 事 多難 次次 達標 件 好事 完美 Scope 定義 情況 才能 機會 願景 想要 會 到處 充滿 未知 到處 充斥 挑戰 能將 功能 完美 開發 背後 付出 努力 大 做 有時候 腳步 就會慢 event 快速 學習 加快 經驗 累積 子彈 飛 一會兒 是從 技術 脫口而出 卻是 幾天 著墨 一句 話 急著 想要 成果 步調 急躁 耐性 沉住氣 去年 主管 討論 過程 中 會 想著 沒 辦到 稍 目標 追 會 不耐煩 會 想要 趕著 羊群 找 簡單 直覺 做法 羊 想當然 會 反撲 遠離 會 急躁 想 恐懼 恐懼 達標 恐懼 失敗 恐懼 失控 至少 想 時機 點 感受 慢 或許 花 心思 展開 雷達 收集 訊息 加上 主管 給予 空間 心中 中心思想 錯誤 中 快速 學習 記住 慢 感覺 規劃 慢 執行 快 Event 價值 event 馬上 拿捏 原則 就要 當下 觀察 則是 放著 發酵 時機 event 做 上週 所待 IT 團隊 繼 第一次 成功 迎來 第二次 成功 第一次 失敗 本來 擔心 Retro 會 偏離 軌道 幸運地 前一天 接連 event 機會 體現 Event 看法 愛 event 過於 失控 衝擊 團隊 主 核心 在意 event 所在 意 是從 event 中 萃取 出 一步 更好 週五 經歷 一場 略微 成功 retro 失敗 better 成功 會議 過程 中 接受 失敗 顯得 氣餒 卸責 或咎責 氣氛 有要 目標 團隊 責任 希望 更好 這還蠻 鼓舞 期待 event 真的 會 變更 訂下 這週作 雪恥 希望 一切順利"
]