[
    "哈囉 哈囉 时间 过得 快 不知不觉 2022 铁人 赛 我要 参赛 • ̀ ㅂ • ́ و 还在 想要 做 内容 想 有没有 推荐 想 主题 想 去年 作品 逛逛 给我 建议 罢拖罢 拖",
    "这次 铁人 赛 完有 出书 厂商 想要 协助 我出 教学 书 想 一阵子 答应 合约 内容 详细 想 这问 碰 STM32 学习 管道 市面 STM32 书籍 缺少 没有碰过 STM32 朋友 说 说 想法 打算 出 一本 适合 入门 偏 进阶 内容 这届 铁人 赛 更 详细 完整 撰写 会 从无到有 STM32 开发 版 制作 底层 暂存器 操作 原理 标准 库 开发 简单 实例 这里会 详细 步骤 搭配 数据 手册 参考手册 发现 市面上 STM32 教学 书 没 分析 手册 查找 解说 书 没错 做 手册 一页 想法 说 写 一本 厚重 书籍 开发 过程 讲解 搭配 数据 手册 参考手册 做 解析 做 内容 但读 会 底子 很多 想法 延伸 会 有人 想 想 听听 想法 问 说不定 我会 想到 编写 教学 书籍 内容 想法 写 1 2 章 1 万多个 字 标准 库 开发 流程 知识 交代 详细 提到 手册 重点 目录 1 章 做 一块 开发板 1.1 STM32 1.2 STM32 开发板 制作 2 章 暂存器 开发 2.1 暂存器 映射 2.2 STM32 GPIO 介绍 2.3 开发 环境 创建 Keil5 2.4 操作 暂存器 控制 LED 闪烁 讲解 2.5 随便 截 几章 暂存器 章节 内容",
    "系列 发表 本页 后记 喔 iThome 呼 总算 地盘 发表 完整 内容 实际上 内容 当初 有计划 写 好像 不算 完整 内容 翻看 内容 发现 不算 太 精确 太 算是 严重错误 部份 反正 这次 没 修改 XD 近期 工作 规划 相关 验证 授权 内容 学习 不少 提供 高可用性 服务 HA 反向 代理 负载平衡 Load Balance 熔断器 Circuit Breaker 服务 探索 Service Discovery 回来 Keycloak 接触 14 15 版 18 版 释出 大概 理解 CIBA 流程 运作 方式 很酷 WebAuthN FIDO Kerberos Client Authenication x509 进一步 了解 Cookie 存储 方式 更 储存 资讯 -- 储存 access token refresh token 接触 很多 新鲜 有趣 相关 事情 会来 规划 授权 管理 服务",
    "Media Query 讲到 快 烂掉 搭配 Grid 说 实在话 不好 做 地方 Grid 方格 系统 撇开 Float Position Flexbox 那种 流向 思维 这是 令人 苦恼 像是 打开 Grid 预设 关闭 揪 竟 人会 打开 ... Grid RWD 盲点 困难 的点 在于 数 三声 数 四声 复习 RWD 事情 先 复习 Grid 定义 方式 弹性 单位 Grid 尺寸 底下 会 弹性 4x4 网格 系统 内 很棒 很棒 全家 很棒 网格 系统 弹性 尺寸 设定 尺寸 会 保有 最小 空间 min content 设计 排版 来说 未必 一件 好事 举例来说 想要 2 3 位置 当中 元件 强制 换行 做 假设 4x4 位置 恰恰好 放 1x1 方块 找 2 3 位置 方块 找到 2 3 元件 我要 断行 找 找 Google StackOverflow 有没有 grid layout break row 这篇 最佳解 不用 找 澄清 一件 事情 网格 系统 断行 这件 事情 查询 断行 操作 类似 作法 利用 Auto placement 特性 做 来看 事情 想要 2 3 位置 发生 断行 动作 3 3 元件 下放 先 提醒 会 副作用 网格 系统 摆放 空间 势必会 隐性 网格 定义 自动 填满 栏 列 尺寸 请留 意 会 min content 填充 原本 负数 轨道 请 会 改变 实际上 操作 有没有 崩溃 解释 何用 Auto replacement 类似 事情 先决条件 网格 系统 强迫 定义 元件 网格 位置 也就是说 自然 排列 位置 排列 要将 2 3 位置 元件 换到 一行 会 找到 断行 解法 利用 Auto placement 规则 加上 span 关键字 位置 元件 跨栏 动作 自然 元件 就会 栏位 关系 挤 一行 说真的 断行 断行 现行 格线 系统 来看 想要 麻烦 定义 元件 位置 只能 做 命名 方式 grid template areas 做 不行 才 会 说 这是 数数 工作 要命 数错 有没有 作法 前提 这是 作法 不好 请 留言 骂 没 请 往下 RWD 来说 一种 合适 Grid 结构 方式 情况 来说 不太可能 页面 设计 弹性 尺寸 做 客户 弹性 很大 像是 石墨 烯 裤子 会 固定 尺寸 固定 位置 需求 例子 来说 以样 4x4 网格 容器 定义 几个 区块 会 像是 结构 思考 Media Query 做 装置 sidebar 放到 main 下方 实际上 操作 方式 会 请 记得 网格 设定 固定 尺寸 装置 变小 变化 也就是说 设定 套用 手机 iPhone 13 尺寸 装置 Viewport 宽度 390px 情况 容器 弹性 空间 会 压缩 也就是说 扣掉 sidebar 本身 固定 200px 扣掉 gap 10px main 剩下 180px 可用 这是 弹性 空间 计算出来 剩馀 尺寸 手机 会 侧边 栏位 栏位 还要 大 情况 回到 Media Query 到底 做会 例子 理解 到格线 系统 断行 概念 全部都是 矩型 矩阵 排 位置 想像成 围棋 棋盘 想像 摆放 东西 位置 座标 涵盖 大 来看 比较复杂 例子 元件 排列 没 单纯 顺序 情况 制作 Grid Flexbox 搞不好 更 快 延续 例子 想要 main 加上 广告 手机 广告 sidebar 下方 不想 main 夹在 广告 先 来看 手机 呈现 方式 HTML 内容 来看 大 尺寸 呈现 看起来 好像 完美 实务 操作 挺 累人 网格 系统 中 断行 概念 定位 排序 做 装置 CSS 最少 设定 大概 换到 大 装置 发现 网格 系统 尺寸 略微 调整 Media Query 到底 做 玩 拼图 格线 系统 中 并不像 Flexbox 会 文件 流要 的点 说 只能 说 少 考量 的点 扣除 掉 定位 position absolute 带来 状况 先前 Flexbox 并不需要 定位问题 这是 差异 与其说是 Mediq Query 做 RWD 倒不如说 利用 Media Query 划面 换掉 重做 感觉 搜寻 css grid media queries 一堆 告诉 Media Query 去换 Grid Layout 操作 先 一般来说 划面 换掉 事情 AWD Adaptive Web Design 范畴 最一 初衷 规划 出 换掉 Grid Layout 才 重点 来说 网格 系统 规划 Media Query 诚心 建议 找个 方格纸 笔记本 元件 排上去 尺寸 顺序 大小 位置 HTML 语意 结构 放到 2 顺序 就要 计算 最小 装置 先 摆出来 做 慢慢 装置 放大 并在 breakpoint 元件 顺序 大小 位置 一种 breakpoint 规划 Grid 容器 利用 弹性 尺寸 弥补 预测 边界 尺寸 真的 不行 回去 Flexbox Flexbox 何不 小结 说 Grid 好像 很潮 地方 蛮 现行 诸多 套件 基本上 当作 类 Flexbox 操作 没 在乎 在乎 痛苦 目录 小节 部落 格 同步 放送",
    "前言 系列 看过 Vue 官方 文件 或学过 Vue 下手 重构 网站 规划 系列 文章 整理 Vue 重构 很多 网站 经验 分享 读者 单元测试 当你 接触 开发 专案 一段时间 会 渐渐 听到 专业术语 就让 我来 了解 单元测试 影片 搭配 文章 学习效果 会 更好 喔 单元测试 简单 来说 程序码 最小 单位 测试 确保 程序 逻辑 团队 维护 过程 中 出错 维护 程序码 品质 最小 单位 我用 个例 子来 举例 主 功能 A Ｂ 两个 功能 两个 功能 所说 最小 单位 撰写 测试 重点 针对 A Ｂ 测试 主 功能 测试 中 包含 A Ｂ 测试 测试 所说 单元测试 单元测试 我先 列出 几个 优缺点 优点 确保 团队 跌代 影响 原本 功能 确保 品质 准确 程序码 切割 最小 单位 降低 耦合度 程序 return 预期 重构 程序码 测试 规格 走 缺点 初期 撰写 单元测试 消耗 时间 会 大于 开发 时间 迭代 性高 很常 写 测试 重写 久 会 浪费 很多 时间 测试 相关 配置 繁琐 配合 开发 细节 设定 很多 从优 缺点 说 撰写 单元测试 初期 开发 效益 并不高 先 撇开 熟悉 测试 来说 光 公司 会 需求 改变 就要 来来回回 改写 程序 就要 再花 时间 重写 测试 想 时辰 压力 专案 来说 划算 会 放弃 写 测试 初期 会 修改 需求 先写 测试 笑 情况 下该 写 单元测试 产品开发 中期 基本上 中期 平台 规格 差不多 补 单元测试 会 做好 功能 新 功能 预期 外 错误 专案 同事 接手 改坏 功能 同事 透过 测试 了解 测试 没 案子 给推 上线 写 Vue 单元测试 前 写 测试 前 先 了解 透过 何种 技术 撰写 测试 Jest Jest Facebook 开发 维护 一款 JavaScript 测试 框架 简洁 语法 测试 function Vue Test Utils Vue Test Utils Vue 官方 推出 组件 单元测试 框架 简化 组件 测试 提供 方法 区分 挂载 组件 之间 交互 会 透过 两种 测试 框架 针对 vue component 测试 Vue Test Utils 负责 解析 component 透过 build 模拟 DOM 渲染 透过 Jest 撰写 test case 验证 符合 预期 安装 jest Vue Test Utils Vue cli 新 建立 专案 请 选择 Unit Testing Jest 专案 预设 会 安装 jest Vue Test Utils 建立 专案 选择 Unit Testing 输入 指令 现有 CLI 专案 jest Vue Test Utils 语法 介绍 describe test 先来 带 来看 语法 describe 类似 群组 概念 用来 多个 相关 测试 包再 test 测试 项目 单位 test 别名 两个 东西 expect 测试 项目 内容 toBe 断言 检查 expect 回传 内容 符合 预期 多种形式 断言 语法 jest 语法 API 接下来 Vue Test Utils 负责 解析 Component shallowMount 方法 渲染 Component 透过 text 方法 Component 文字 内容 做 比对 简单 单元测试 先 告一段落 还想 更 单元测试 情境 购买 新课程 Vue 单元测试 vue test utils 入门 课程 网址 原价 新台币 2200 元 预购 价新 台币 1800 元 输入 折扣 码 PAJNBFUNO300 马上 再折 300 元 优惠 订阅 Mike 频道 享受 精彩 教学 分享 MIke 官方 line 帐号 好友 搜寻 mike cheng",
    "Shadow React Native 这门 学问 专案 中 卡牌 阴影 css3 中 box shadow 属性 发现 设定 没 效果 发现 双 平台 显示 竟然 统一 31 天 接续 纪录 写 这篇 原因 P Platform 先 react native 有个 平易近人 跨平台 装置 判断 请 这篇 学会 判断 平台 ... 回事 style 实作 iOS android code 结论 ... 会 发现 两个 装置 样式 写法 做 平台 判断 合并 写 即可",
    "tags swfLAB ⚠ ️ Of course only my personal thoughts don ' t too serious haha ... ⚠ ️ Final Updated 2022 3 17 Table Contents Intro event Cast eye over contract What Foundry Testing Time Conclusion Reference Synchronization Link Tree Intro iParking NFT What happened 简单 来说 事件 起因 过程 深度 了解 接收 资讯 来源 附上 连结 自行 参考 Motivation 发现 好像 选择 合约 部属 前 会 测试 角度 来看 这次 事件 错误 发生 肉眼 观察 合约 找到 讲 要说 评论 这件 事情 前辈 夥伴 错 开发 团队 做好 事后 MOD 这次 错误 肉眼 清晰可见 水汪汪 大 眼睛 大脑 确实 比手 程序码 好用 哈哈哈哈 Testing 职业 工程师 槛 自认 距离 工程师 不小 距离 想要 借此机会 陈品 告诉 Foundry 撰写 测试 篇文章 主轴 学习 Foundry 小小 笔记 嘟嘟 房 活例 D 先回到 文章 最一 宣告 ⚠ ️ Of course only my personal thoughts don ' t too serious haha ... ⚠ ️ 发现 文中 错误 想法 请 不吝 大方 告诉 还在 学习 中 我会 无条件 接受 意见 想法 Cast eye over contract 参考 前辈 媒体 资料 大 概率 先 技术 层面 定位 array 资料 结构 实作 白名单 系统 Gas Limit 设定 来看 程序码 The path Contract Inheritance 基本上 猜 嘟嘟 房 工程师 特别 改 继承 而来 合约 内容 我先 道歉 OpenZeppelin 不到 东西 变数 资料 结构 宣告 删掉 借此 Gas Fee 降低 写 Project 会 习惯 继承 Github 内容 东西 贴过来 改成 想要 样子 OpenZeppelin 安全性 便利性 称许 科学家 工程师 菜鸡 半个 来说 细细的 斟酌一下 东西 蛮 随便 乱改 合约 反而 Bug 确实 石头砸 脚 很常 ... 毕竟 工作 收 薪水 继承 函式 库 呼叫 API 更 小心 更 了解 这门 技术 才 发现 很多 程序码 Copy Paste 简单 CarMan 继承 历代 先祖 先烈 遗产 迎来 人生 曙光 主 合约 我并 仔细 一一 讲解 合约 变数 函式 细节 大概 摸 出 合约 东西 希望 文中 引用 程序码 到底 写 宣告 版本 宣告 合约 继承 进 合约 先 宣告 常数 马上 第一个 鞭 小夥伴 array 型态 whitelistedAddresses 负责 接收 初始化 参数 建构 子 指 NFT Metadata baseURI IPFS CID VIP mint 函式 预售 mint 函式 公售 mint 函式 判断 讯息 传递 交易 mint msg sender 自然 消费者 白名单 成员 NFT 合约 tokenURI 铸造 函式 启动 关闭 条件 拥有 管理权 才能 呼叫 函式 函式 越 越 中心化 一切都是 透明 明白 写 程序码 sign 代表 同意 接受 合约 控制权 合约 算是 管理权 人员 管理 函式 赚了钱 记得 钱 withdraw 函式 What Foundry Unit Testing Smart Contract 过往 Testing 无非 Hardhat Truffle DappTools 撰写 Javascript Typescript 语法 测试 搭配 Ganache Infura 服用 药物 还会 包含 ethers js mocha waffle chai blablabla 自行 体会 D 写过 node modules 充满 各式各样 dependencies 做 开发 先来 一套 删 套件 重载 套件 降 版本 环境 变数 组合拳 算是 够 恼人 ... Javascript 人手 一把 利器 但身 撰写 Solidity 工程师 测试 语言 写 会 怪怪的 更 不用说 Big Number 套件 还会 Solidity 剂 打天下 疫苗 效果 快狠准 Foundry 掌声 Introduction Rust 建置 开发工具 自称 以太 坊 开发 环境 中 最快 最有 弹性 扩充性 最强 一款 官方 github 中 拿来 知名 工具 dapptools 理所当然 大胜 Foundry 从众 工具 中 脱颖而出 快速 之外 Solidity 撰写 测试 特质 会 会 机会 细细品味 Comparison 基准 相关 叙述 翻译 Foundry 官方 文件 Forge 利用 编译 测试 表现 快 速度 Project Forge DappTools Speedup 28.6 s 2m36s 5.45 x 6s 46s 7.66 x 11s 40s 3.63 x 1.4 s 5.5 s 3.9 x 着名 函式 库 时 Hardhat 耗费 15.244 s 时间 编译 Forge 9.449 s 4s cached What features use Foundry 平常 开发工具 Ethereum 测试 框架 支援 多种 客户端 功能 像是 EVM 智能 合约 互动 传递 交易 链上 资讯 一把 瑞士刀 官方 文件 写 来自 官方 Foundry 特性 Fast flexible compilation pipeline Automatic Solidity compiler version detection installation under svm Incremental compilation caching Only changed files re compiled Parallel compilation Non standard directory structures support e g Hardhat repos Tests written Solidity like DappTools Fast fuzz testing shrinking inputs printing counter examples Fast remote RPC forking mode leveraging Rust ' s async infrastructure like tokio Flexible debug logging Dapptools style using DsTest ' s emitted logs Hardhat style using popular console sol contract Portable 5 10MB easy install without requiring Nix any other package manager Fast CI Foundry GitHub action Download Foundry 作业系统 Linux macOS 简单 方法 方法 下载 Foundry 下载 执行 foundryup 会将 Foundry 更新 最新 版本 想要 返回 指定 版本 指令 foundryup v VERSION Windows 下载 方式 下载 Foundry 先 Rust Cargo rustup rs 下载 rust 执行 Rust Cargo 打开 CMD 指令 成功 安装 Foundry 下载 过程 中像 错误 就要 下载 选择 C++ Build Tools 重 开机 解决 下载 大小 约 6 GB First Foundry Test init 初始化 专案 进 hello foundry 初始化 资料夹 forge CLI 将会 创建 两个 档案 目录 lib src lib 包含 testing contract lib ds test src test sol 各式各样 测试 合约 实作 demo lib ds test demo demo sol src 放 写 智能 合约 测试 原始 码 编译 测试 More Foundry Test iParking foundry hello foundry src Contract sol 中 合约 修改 成 想要 撰写 合约 档案 test Contract t sol 中 测试 熟悉 require 之外 方式 测试 更多酷 炫 assertions 语法 用来 测试 合约 lib ds test src test sol 中 找到 逻辑运算 assertTrue 十进制 assertEqDecimal 大于 小于 assertGt assertGe assertLt assertLe More features use Foundry 支持 测试 因为当 函式 测试 时 成功 PASS 边际 测 资中 会 导致 Under Overflow RE ME 错误 测试 函式 中 增加 参数 Fuzzing Solidity test runner 随机 选择 参数 输入 函式 例子 中 fuzzer 会 自动 x 尝试 随机数 发现 输入 会 导致 测试 失败 便会 回传 错误 这时候 debug 测试 错误 发现 参数 输入 57896044618658097711785492504343953926634992332820282019728792003956564819968 会 错误 来到 贴 数字 会 发现 数字 5.789 10 76 2 255 听 x 型态 uint256 程序 势必 函式 增加 型态 异常 叙述 未来 Foundry Fuzz Testing 之外 还会 支援 Invariant Testing Symbolic Execution Mutation Testing Give me more information Give me more more more documentation ⚗ Testing Time Initialization Preparation 打开 空 资料夹 init 初始化 专案 继承 OpenZeppelin 合约 先将 导入到 专案 src 感觉 子 做 正确 做法 拜讬 提供 给我 iParking foundry src Contract sol 中 合约 修改 成 嘟嘟 房 NFT 合约 记得 import 继承 列祖列宗 先 Contract t sol 档案 中 测试 合约 建置 测试 专案 编译 有没有 Unit Testing 目标 preSaleMint 函式 运作 状况 说到底 一种 马后炮 懒得 写 测试 哈哈哈 废话 不多 说 开测 先 宣告 版本 主 合约 宣告 进来 之外 宣告 DEPLOYER ADDRESS 来存 合约 deployer 地址 temp 暂存 增长 白名单 这段 程序码 多个 重点 DEPLOYER ADDRESS carman owner 叙述 中 msg sender deploy 合约 owner 方法 msg sender foundry toml 中 环境 变数 全域 变数 设定 档 预设值 二 carman addController DEPLOYER ADDRESS 这是 阵列 存 白名单 外 弔 诡 地方 主 合约 owner 建构 子里面 设定 Controller 大部分 功能 函式 居然 require Controller onlyOwner modifier 帮 deployer 宣告 三 增长 白名单 重点 合约 中 随机 制造 帐户 地址 加进去 temp 阵列 push whitelistedAddresses 中 接下来 程序码 苦恼 超级 久 实作 checkOnERC721Received 宣告 safeMint 会 疯狂 错误 我查 资料 checkOnERC721Received verification logic 地址 合约 EOA 实作 body 才 ERC 721 接口 回传 正确 4 bytes hash 第一个 测试 先 试试 水温 Deployer 能不能够 铸造 几个 NFT 第二个 测试 Foundry 提供 很酷 功能 身分 转变成 帐户 借此 角度 测试 合约 宣告 CheatCodes 接口 测试 合约 宣告 cheats 想要 测试 合约 加上 cheats prank address 0 角度 转成 address 0 测试 Gas Report Foundry 有趣 功能 Gas Report Gas 消耗 惊人 发现 错误 foundry toml 中 gasLimit 设定 成 想要 大小 控制 办法 D Conclusion Why do I correct contract 市面上 实作 例子 无论是 mapping 酷炫 Merkle Tree Hash Tree 稍微 中心化 更 易于 管理 节省 开销 Backend Signature Whitelist Data Base 多查 一点 资料 会 选择 掉 array 资料 结构 来存 白名单 菜鸟 会 写 Solidity 人里面 99% 强 哈哈哈 修正 智能 合约 事情 我先 躲开 做 Auditing 大师 不少 D My point view array 遍历 子 演算法 寻找 白名单 称得上 诡谲 Web2 跨足 Web3 公司 很多 东西 学习 才刚 蓬勃发展 产业 技术 中 还在 摸索 技术 模式 商业模式 也许 改善 机会 累积 越来越 先例 某种程度 产业 迈向 更好 发展 希望 多多 多多 多多 增进 写 测试 实力 毕竟 写出 会动 合约 不难 写出 出错 难如登天 Reference Foundry ERC 721 Contract Unit Testing",
    "提到 做 一块 开发板 要来 分享 PCB 淘宝 送洗 经验 动手做 一块 玩 成就感 先想 办法 注册 淘宝 帐号 要过 电话 认证 手机 下载 EZway 手机 认证 软体 实名 认证 确保 电话 淘宝 攸关 海关 货物 实名 认证 手机 下载 淘宝 APP 会 说 用途 电脑 下载 阿里 旺旺 大陆 卖家 沟通 软体 下载 手机 淘宝 APP 做 沟通 设定 淘宝 送货 地址 步骤 淘宝 买 想要 东西 䁖 找 一家 淘宝 PCB 厂家 找 捷配 找到 卖家 卖家 商场 首页 点选 联络 客服 客服 说 PCB 打样 这时候 卖家 会 传 文件 给他 IP 位置 阿里 旺旺 传给 客服 这时候 就问 卖家 发邮件 我会 大陆 说法 台湾 说法 OK 看得懂 这时候 他会给 信箱 PCB 元件 寄给 只收 PcbDoc 档案 这时候 会问 工艺 工艺 卖家 网页 写 兴趣 䁖 不介意 规格 说 常规 工艺 会 说 常规 工艺 截 对话 纪录 最少 片数 5 片 喔 会 确认 传过来 文件 有没有 卖家 会 说 没 卖家 会 传个 付款 连结 选择 下单 再来 选择 运送 方式 运送 方式 多种 两种 货物 集运 仓在缴 运费 送来 台湾 这有 好处 多个 卖家 商品 全都 送到 XX 集运 仓 统一 附 邮件 费 送来 台湾省 运费 卖家 说顺 丰直 发台湾 会 快 价钱 差不多 了解 在问 卖家 接下来 方式 付款 两种 7 点 ibon 输入 付款 条码 说 下载 手机 淘宝 APP 这时候 手机 付款 条码 去年 改 原本 网页 只能 手机 APP 软体 小七 付款 号码 信用卡 付款 完后跟 卖家 说 新 客户 淘宝 卖家 会 身分证 字号 提供 喔 货物 进不来 海关 实名 认证 大致 等货 回来 喔 淘宝 APP 查看 货物 状态 假设 货都 没来 压 退款 退款 会退 玉山 银行 详细 玉山 客服 询问 喔 淘宝 交易 管理 这时候 电路板 到来 已将 重点 列出来 没 办法 花太多 时间 做 一步步 教学 提 喔",
    "这篇要 补充 少 useLayoutEffect hook useEffect 语法 执行 时机 不太 useEffect 差异 先 假设 划面 toggle 按钮 绑定 事件 state 那当 点击 瞬间 DOM 四个 步骤 做 改变 state 状态 更新 划面 变化 建构 新 virtual dom tree 旧 virtual dom tree 透过 diff 演算法 找出 更新 更新 更新 real dom 第四 步骤 结束 时 useEffect 才 执行 放在 它里面 函式 useLayoutEffect 第三 步骤 会 执行 useLayoutEffect 同步 它会 拖延 划面 呈现 时机 操作 DOM 时 发现 闪烁 情况 时 范例 中 点击 按钮 会 跳出 一段 文字 图片 useEffect 弹 出 文字 残影 图片 不易 读者 点 范例 做 尝试 useEffect useLayoutEffect 注 也许 跳出 文字 开发 中有 写法 想 差别",
    "公司 内部 分享 公司 20 年老 系统 传统 组织 正 面临 数位 转型 中 团队 管理 开发 定义 SLO 目标 DevOps 文化 带给 传统 开发 团队 新思维 习惯 纪录 监控 观测 性 带给 开发 维运 团队 好处 Talking About DevOps Observability Outline 运维 盲区 Operational Blindness 监控 Monitoring 纪录 Logging 指标 Metrics Observability 前言 针对 公司 内部 现况 做 分享 站 DevOps 右侧 偏运维 角度看 事情 Observability 介绍 Operational Blindness War Story Note 天 中午 运维 组内 暴发 出 警报 通知 一堆 讯息 湧现 跳 发现 网站 瘫痪 外部 监控 近 几次 健康检查 没过 触发 警报 Note 发现 网站 瘫痪 Black Box Monitoring Note 登入 主机 监控 系统 发现 网站 系统 指标 记忆体 CPU 没到 100% Disk IO 还在 容许 内 资料库 活着 Note 原因 只好 开发 团队 主机 网站 服务 进程 本身 看起来 算 Note 开发 团队 登入 正式 环境 主机 权限 所有人 权限 主机 管理 成本高 资安 风险 高 Note 开发 团队 只好 运维 团队 工作 只能 发号施令 最终 资料库 发现 一堆 慢 查询 一堆 连线 处于 CLOSE WAIT 状态 Web 服务 数量 进程 推测 Web 服务 容量 停止 响应 新 request healthcheck db query session 砍掉 Web 服务 请求 队列 清空 Note 查找 根源 浪费 很多 时间 升级 时 波及 没 足够 权限 查看 找 有用 主机 资讯 服务 资讯 最终 依赖 运维 团队 情境 一分钟 服务 停机 时间 要钱 运维 团队 只能 主机 监控 指标 Question Dev Ops 团队 分离 组织 沟通 方式 间接成本 Note 传统 结构 一条 红线 开发 运维 职责 划分 开 运维 团队 负责 主机 基础设施 应用程序 交付 Note Developer Operations 组织 结构 合作 方式 职责 分 太开 会 拔河 分散 力道 相互 拉扯 中 复原 时间 流逝 Note 可怕 使用者 平台 提供 服务 品质 没 信心 跳去 竞品 平台 DevOps Note Developer Operations 相互 拉扯 拔河 分散 众人 力道 Note SLI service level indicator 指 指标 QPS TPS Duration 准确性 延迟 性能 metric 视为 SLI 选择 尽可能少 SLI SLI 服务 稳定 可靠 SLO service level objective 服务 等级 目标 指 一段时间 内 目标 1 月 内 QPS 99.99% 响应 时间 10ms SLO 一组 值 值 SLI 定义 服务 级别 数值 自然 SLO 定义 SLI 情况 小于 某值 处于 大小 值 之间 选择 合适 SLO 一件 事情 并不需要 设定 SLA service level agreement 服务 等级 协议 指 协议 协议 内容 包含 SLI SLO 恢复 方式 时间 一系列 协议 基于 时间 可用性 基于 时间 可用性 系统 运行 时间 系统 运行 时间 停机 时间 SLO 99.95% 一年 来看 佔 4 小时 22 分钟 SLO 99.99% 一年 来看 佔 52 分钟 基于 次数 合计 可用性 基于 合计 可用性 成功 请求 数 请求 数 总和 SLO 99.99% 接受 2.5 M 请求 错误 个数 应 250 基于 延迟 SLO 99% 前台 每秒 User 访问 延迟 300ms Monitoring Types Monitoring Monitoring Layers Logging Deal discrete events Application debug error messages Audit trail events Request specific metadata Specific events Note 应用程序 错误 讯息 稽核 事件 HTTP 请求 事件 Log Monitoring Troubleshooting Monitor Clearly log level Good log message Log aggregation Note Show Loki 单行 Log JSON 格式 针对 各种类型 服务 定义出 固定 metadata key Defect Log Monitor Low value density Note 价值 资讯 密度 太低 很多 第一行 价值 资讯 这部 影片 讲了 很多 Log Cetralize Monitor 好处 Log 表达 Write log into RDBMS log 并发 写入 高 写入 资料库 RDBMS 并发 事务 量 高 就算 buffer pool 加大 极限 建议 log 栏位 很多 种类 索引 选择 困难 DB 真 出事 想 登入 log 没法 搞不好 还没 写进去 压死 DB 那根 树枝 DB 回归 业务 状态 资料 存储 存取 Metrics 4 Golden Signals Latency time serivce a request Traffic requests second Error error rate request Saturation fullness a service Note 用户 体验 衡量 系统核心 性能 系统 时间 作业 计算 系统 作业 时间 系统 服务 量 请求 数 发出 接收 网路 封包 大小 发现 定位 故障 错误 总量 调用 服务 失败率 系统 饱和度 负载 系统 佔用 内存 作业 队列 长度 Prometheus metric name label sets Note label sets 代表 metric name 维度 多个 维度 做 聚合 操作 Metric Types Note counter 只增 不减 用来 request 总量 数量 错误 发生 次数 计算 段时间 内 rate 变化率 事前 透过 压力 负载 测试 预期 上限 做 监控 警告 查询 系统 中 访问量 前 10 HTTP URL gauge 即时 变化 情况 时间 变化 用来 记录 cpu mem 用量 coroutine 数量 pool usage 并发 请求 数 ... 透过 计算 样本 线性 回归 模型 数据 变化趋势 预测 Histogram 会 观测 数据 取样 观测 数据 放入 数值 上界 桶 中 记录 各桶 中 数据 个数 数据 个数 数据 数值 总和 请求 时延 样本 数据 用来 区分 平均 慢 长尾 慢 快速 了解 监控 样本 分布 情况 Summary Histogram 类似 会 观测 数据 取样 数据 个数 总和 还会取 滑动 视窗 计算 视窗 内 样本 数据 分 位数 Archetecture Observability Note Monitoring tells whether system works observability lets ask why ' s working Pilliars Obersvability News Reference Thank You find me",
    "▲ AR12 TUF 采用 导热管 CPU 接触 热导管 直触 技术 HDC 4 根 Ø 6mm 全铜 热导管 搭配 全铝 散热 鳍 片 液相 作动 流体 吸热 端 蒸发 成汽相 相变 吸收 热量 流体 高速 流向 放热 端 放热 端遇 冷凝 结成 液相 相变 释放出 热量 借由 重力 毛细 力 离心力 回流 吸热 端 反复 循环 由此可知 吸热 端 位于 下方 理想 ▲ 12 公分 高效能 九 叶片 风扇 PWM 风扇 主机板 透过 控制线 调整 风扇 转速 使用者 自行 调整 效能 静音 风扇 中央 带有 8 颗 ARGB LED 各家 主机板 连动 软体 协作 同步控制 灯效 设定 接头 4 pin PWM 4 1 pin ARGB 5V LED 安装 主机板 4Pin 接脚 集线器 更 aRGB 装置 偕同 运作 ★ ★ ★ ★ Ardiuno 控制 ★ ★ ★ ★ ▲ 装 机壳 偕同 运作 貌 主机板 4Pin 接脚 文章 药 草草 结束 aRGB 风扇 电力 输入 5V DC 手边 光好 想到 Arduino 开发板 5V 输出 便 想 Ardiuno 控制 SilverStone AR12 TUF 散热器 呼吸 灯 ▲ 面 包版 结构 请 自行 参考 网站 面 包版 好处 aRGB Hub 并联 方式 控制 aRGB 装置 随时 调整 价格 便宜 尺寸 30 元 即可 入手 固定 双面胶 即可 ▲ 杜邦 长度 插不进 控制线 孔径 附上 盖子 一截 排针 直 插 面 包版上 ▲ 板子 小抄 5V 接地 资料 线 安排 第五 针 改动 define DATA PIN 5 一行 下载 程序码 安装 FastLED 函式 库 Arduino IDE 安装 请 自行 google -- ▲ 编译 上传 更 执行 官方 提醒 字样 务必 确认 所欲 接 控制 盒 主机板 RGB 连接端口 排列 定义 AR12 TUF 连接 正确 连接端口 损毁 再三 电表 确认 电阻 脚位 成功 想像 简单 Youtube 影片 连结 此供 参 风扇 机上 电后 自然 会 ★ ★ ★ ★ 心得 ★ ★ ★ ★ 灯控 软体 简单 易用 好处 会 吃 一点 系统资源 开发 版 玩家 想要 灯校 展现 展现 音乐 拨放 同步 白天黑夜 切换 程序 控制 比灯控 软体 弹性",
    "本文 同步 刊 目录 前言 铁人 赛 系列 文 提到 项目 比赛 结束 区块 链 近期 规划 未来 规划 结语 前言 会 写 这篇文 原因 参加 2021 铁人 赛 说不定 意义 改变 人生 哈哈哈 哈哈哈 讲并 要给 铁人 文章 冠上 荣耀 深度 层面 很多 先来 听个 歌 铁人 赛 平常 习惯 写文章 纪录 学习 内容 心得 习惯 过往 当作 宣洩 心情 一种 方式 分享 近状 发在 FB IG 铁人 赛 想太多 参加 毕竟 从小到大 喜欢 写东 写西 挤出 一点 内容 铺满 三十天 太 困难 想 说 得奖 前 从来没 想过 肯定 新 媒介 分享 学习 历程 颇 有趣 铁人 赛是 极度 意义 活动 身边 很多 朋友 会 寒 暑假 规划 要学 东西 动力 Push 比赛 团体 完赛奖 借由 同侪 组员 压力 督促 砥砺 有心 对得起 会 多花 一点 心力 写文章 参加 比赛 达 质量 为防 意外 获 肯定 为求 舒适 累积 存稿 真的 不可避免 累积 文章 数量 会 意外 组员 一阵子 痛苦 至极 至少 组员 开赛 累积到 20 25 篇 看起来 严厉 队长 但过 暑假 大学生 真的 超级 悠閒 实在 理由 先存 稿 硬 拖 开学 才 写 自以 安排 几天 冲刺 那为 前 几个 寒暑假 还会 毫无 收获 结束 系列 文 提到 项目 项目 胎死腹中 成本 获利 奇形怪状 扑朔迷离 现象 成功 要说 真的 Deploy Mint E 真不知道 猜 回本 没 区块 链 领域 技术 统治 世界 科学家 工程师 真的 太多 太多太多 事情 交易 MainNet TestNet 透明 导致 单和锁址 机器人 横行 熟悉 熟悉 区块 链 夥伴 钓鱼 网站 骇客 攻击 损失 资产 更 不用说 充斥 一堆 假 博士 骗子 无脑 推 公链 生态系 项目 老鼠会 没 两样 崭新 领域 项目 衡量 Developer Marketing Artist 努力 多寡 功过 真的 评量 准则 既定 模式 唯一 确认 做 项目 合夥 钱 事情 讲好 讲到 钱 很多 六亲不认 呵呵 半年 接触 越来越 同行 前辈 夥伴 便 听到 越来越 奇闻 轶事 卖不出去 想要 怪 Marketing 分钱 想 专利 回 Artist 手中 写出 Bug Developer 道歉 没 项目 说 公司 组织 经营 确实 一门 大 功课 组织 稳定 会 影响 社群 信心 向心力 NFT 价值 水平 非 同质化 代币 发行量 吞吐量 通膨率 代币 模型 估值 顶多 持有 几位 最终 回到 社群 营运 福利 向心力 艺术 价值 品牌形象 要说 反正 世界 有缘 做 没缘 就算 做好 事情 做好 那就好 比赛 结束 半年 接收 不少 合作 讯息 信件 不免 诈骗 看起来 稍微 诡谲 内容 大部分 兴趣 请原谅 小弟 不常 iThome 网站 信箱 有时候 会 漏掉 资讯 很多 中文 创作者 社群 开发 NFT DAPP 参考 文章 对此 开心 厉害 至少 当初 写 系列 文 菜 能给 一丁点 像是 当初 很多 厉害 慷慨 大神 手中 差别 大神 厉害 比赛 结束 充实 找到 一份 蛮 喜欢 工作 接触 好多好多 厉害 工程师 收到 很多 工作 面试 邀约 重的点 赚 多少钱 没 我能 借由 机会 更 印象 深刻 收到 面试 规模 公司 开出 七 八个 技术 门槛 勉勉强强 才能 一半 光是 案例 就够 努力 一阵子 区块 链 来说 区块 链是 极度 迷人 技术 之中 庞大 市场 像是 迷幻 魔法 中心化 概念 像是 革命 号角 高深莫测 底层 技术 电脑 科学 密码学 像是 人类 时代 推进 产物 身为 反骨 青年 很多 现行 社会制度 资本 横行 现象 中间人 信息 对称 垄断 金融业 央行 诡异 感到 舒适 想要 一股脑 推翻 这项 技术 带来 更 改变 喜欢 原型 东西 区块 链 底层 技术 兴趣 数学 密码学 网路 学 计算机 学科 都给 非 本科 系 学生 带来 不少 麻烦 这也 导致 此时此刻 还在 层面 伫足 底层 钻 未来 会发 更 学习 区块 链 底层 技术 笔记 心得 近期 规划 近期 规划 归类 7 月 暑假 学期 课业 助教 工作 之外 两份 出版 品 两场 表演 一场 Tech Meet Up 一份 实习 带队参加 ETH Global Hackathon 未来 规划 铁人 赛 要往 Blockchain Developer 决心 上文 平常 会挂 嘴边 一句 话 非电资 科系 自信 说 小小的 佳作 飞 上天 赢过 本科 系 训练 学生 比赛 体会 很多 向往 事情 挑战 像是 原本 没 办法 写出 合约 串上 API 规划 DAPP 架构 才 发现 做出 能动 东西 倒 真 没 难 或许 能动 东西 好用 东西 东西 学会 东西 公司 开 技术 门槛 弄 机会 我修 资料 结构 演算法 NTU CSIE 当的 助教 NTU IM 实在 没理由 尝试 放弃 当我 想法 面对 挑战 好像 没 害怕 直视 可怕 科目 时 会 怨声载道 地想 放弃 哈哈哈哈 哈哈哈 结语 回首 超过 半年前 三十篇 文章 说 槽点 满满 我并 这是 多幺 羞耻 事情 内容 漏洞百出 地方 想 出 更 棒 写法 某种程度 证明 比赛 结束 虚度光阴 写 铁人 赛 文章 本来 想 说 60 90 篇 2 3 部 系列 文 算了 真的 没 时间 ㄚ 先不讲 主题 嘿嘿 但会 喜欢 内容 衷心希望 重现 Blockchain 组 不用 摆在 SWE 组 MW 组了 DevOps 组 组别 系列 文有 大部分 重点 Unit Testing CI CD 自动化 工作 流 特别感谢 共事 好友 支持 心灵 支柱 给我 无数 机会 肯定 每位 老师 前辈 无偿 提供 资源 产出 大神 2022 IT 铁人 见",
    "文章 发布 过程 中 建立 request command 预计 规划 透过 command 触发 多个 request 功能 多个 command 触发 同一个 request 触发 顺序 定义 那要 需求 预计 多开 一张 表 名为 commands requests 这张表 目的 要将 commands requests 建立 关联 规划 栏位 name type uuid uuid commands uuid uuid requests uuid uuid 触发 顺序 栏位 中要 顺序 栏位 name type uuid uuid commands uuid uuid requests uuid uuid order int commands requests commands uuid command uuid commands requests requests uuid requests uuid 将相 关的 栏位 做 foreign key 关联 做 资料库 帮 保证 commands requests 中 两个 uuid 存 在于 两张 表中 资料库 语法 发现 commands requests primary key 也将 建立 Primary Key 语法 补上去 怕 自动 uuid extension postgresql 中 没 建立 建立 extension 功能 放上 补上 没写 down 档 影片 code",
    "测试环境 登入 囉 如何是好 登入 先前 测试环境 测试 帐号 登入 程序码 商品 类别 资料 登入 成功 近期 回应 连线 进去 程序 内部 错误 探究 原因 才 测试环境 关闭 测试环境 测试 只能 正式 环境 方式 开发 测试 小心 别乱 下单 喔 正式 环境 登入 想要 正式 环境 登入 先 永丰 开户 登入 帐号密码 正式 环境 shioaji 正式 环境 登入 方式 参考 sj Shioaji simulation True 改成 api sj Shioaji 即可 程序 参考 范例 后记 在过 这么久 有人 讨论 才 发现 测试环境 真 可惜 只能 实单 希望 开放 开发 怕 ...",
    "以下内容 同步 更新 程序 先到 资料库 语法 建好表 程序 新增 属性 会 新 环境 将你 程序 部署 两个 月 前 资料库 型态 这时候 会 发生 执行 sql 语法 晓得 两个 月 前 资料库 长 资料库 定期 备份 情况 有个 机制 资料库 状态 纳入 git 版本控制 帮 资料库 版本控制 选择 gorm migrate 语法 原因 资料库 gorm 写到 extension extension 放到 程序 中 才 会 选择 语法 资料库 表 版本控制 migrate 工具 方式 还蛮 简单 地方 放上 指定 规则 sql 档案 version 持续 变多 第一个 1 第二个 2 跳 10 数字 变多 up down 版本控制 会 说 原本 程序 升级 v2.0 0 版 发生 很大 bug 退回 v1.9 7 版 资料库 会 资料 v1.9 7 形状 up down 基本上 相辅相成 up 创表 create table ... down 就要 删表 drop table ... 教学 写 蛮 详尽 点进 github 阅读 readme 喔 这次 写 过成 程序码",
    "某人 会 迟到 从不 缺席 没 x 失踪 很久 故事 原点 正式 参加 铁人 赛 从不 活动 说 逛过 iT 邦 帮忙 网站 第一次 意义 铁人 赛 学校 UNIX 作业系统 时 瓶颈 着急 地到 网路上 寻找 其他人 学习 恐龙 书 所写 心得 缘分 使然 无意间 黑马 作业系统 教室 统整 铁人 赛 系列 文 下架 QQ 令 十回 学习 信心 心中 浮现 下次 铁人 赛 参赛 计划 2021 13 届 恐龙 书 图源 初次 参加 铁人 赛 选择 报名 自我 挑战 组 或许 自由 关系 想 30 天要 写些 原始 想法 想 写 接触 网页 心得 像是 网页 三本 柱 前期 踩 坑 有人 分享 JS30 课程 心得 刚好 30 天 课程 当下 写 JS30 学习 日记 系列 文 故事 伊始 铁人 赛 正式 开赛 2021 09 01 思考 该不该 写稿 放 铁人 赛 开赛 没 几天 有人 文章 中说 写 完 30 天 文章 自爆 XD 时间 安排 弹性 开赛 前屯 10 篇 稿子 说 每天晚上 12 00 刚过 丢 篇文章 打卡 简单 前辈 稍微 看过 写 系列 文 会 发现 JS 真的 很菜 依赖 网路上 查 算是 常识 资料 查资料 时间 课程 影片 写 学习心得 时间 还要 长 故事 途中 前期 准时 发 心得 文 确认 发表 前 会 确认 内容 尽量 文章 错字 写 文章内容 观看 教学 影片 查 资料 中 平静 度过 故事 转折点 发生 开学 课业 大学生 ing 铁人 赛 事情 刚好 重叠 只能 零碎 时间 写 铁人 赛 系列 文 故事 转折 大学生 开学 第一周 思考 整 学期 课程 安排 选到 带走 东西 课 每学期 挑战 我会 仔细 地看 课程 大纲 课程 评价 参考 万恶 必修课 XD 想当然 耳 说 只能 零碎 时间 发文 过程 中 想要 放弃 毕竟 剩 几天 完赛 浮现 那份 甘愿 促使 我要 稍微 体会 优质 系列 文会 挑战 成功 真的 会 很多 突发状况 时间 写 完 一篇 优质 文章 或许 短短 不到 10 分钟 快速 阅读 完毕 作者 花 数倍 时间 写 整理 相关 资料 故事 尾声 Stack Overflow 前人 JS30 课程 笔记 MDN Web Docs 支援 JS30 学习 日记 系列 文就 顺利 开学 文章 写 随便 完赛 瞬间 真的 带给 满满的 感动 成就感 浏览 次数 Like 数 订阅 数的 跳动 认同 感觉 真的 非常感谢 网路上 前辈 更新 2022 02 28",
    "想 纪录 STM32CubeMX 经验 适合 没用过 开发 经验 不用 第一次 STM32CubeMX 开发 STM32 标准 库 方式 做 开发 兴趣 13 届 铁人 赛 幸运 Arm Platforms 类组 优选 文章 提到 标准 库 开发 STM32CubeMX HAL LL 库 开发 差异 重复 说 差别 学 标准 库会 嵌入式 单晶 片 这块 领域 更 Sense 学完 再来 深入探讨 进阶 功能 程序 执行 快 更 有效率 标准 库 衔接 HAL 库 没 说学过 标准 库 过后 碰 STM32CubeMX 配置 专案 陌生 眼里 标准 库 删掉 一堆 功能 函示 作 精简 版本 STM32CubeMX 安装 描述 建立 1 新 专案 GPIO 点亮 LED 点 开来 STM32CubeMX 软 体会 划面 上图 ACCESS TO MCU SELECTOR 创建 专案 开 完后会 下图 选择 MCU MPU 型号 列表 假设 身边 ST 官方 出 开发板 选择 第二项 开发板 型号 做 创建 专案 选择 STM32F030CC MCU 型号 选择 身边 开发 版 MCU 型号 做 选择 影响 亮 LED 范例 左 半边 MCU MPU 规格 做 筛选 选择 好后后会 反黑 再点 右上角 Start Project 专案 会 配置 函示 接口 要来 配置 烧入 程序 IO 口 SWCLK SWDIO 1 点选 SYS 2 点选 Debug Serial Wire 配置 烧录 口 3 会 显示 两个 角位 框框 绿色 两个 选项 作用 用来 唤醒 MCU MCU 休眠 IO 口 不到 先 选取 再来 选取 左边 GPIO 选项 对着 右边 MCU 选择 配置 GPIO 口 1 点选 GPIO 2 点选 IO 口 会 跳出 1 选单 再选 功能 选 PA1 GPIO Output 选完 接口 会 跳出 进阶 设定 下图 左上方 界面 1 PA1 一排 规格 下方 则是 PA1 初始化 1 GPIO output level GPIO 口 默认 状态 配置 High Low 2 GPIO mode GPIO 口 模式 配置 成 Output Push Pull Output Open Drain 模式 差别 文章 提到 3 GPIO Pull up Pull down GPIO 口 内部 上拉 VDD 下拉 GND 不上 拉 不下 拉 4 Maximum output speed GPIO 口 输出 速度 配置 高速 中速 低速 数值 查看 参考手册 GPIO 章节 5 User Label 这是 定义 IO 口 名称 宏 定义 define LED TEST 则会 MCU 接口 注解 感觉 程序码 部 分则 会 专案 里的 main h 下图 GPIO 口 配置 再来 开启 RCC MCU 震盪 才 会 工作 点开 左边 RCC 选项 会 下图 接口 1 点选 RCC 2 选择 想 开起 外部 时钟 两个 外部 时钟 焊上去 选择 外部 高速 时因 震盪 3 显示 两个 角位 配置 成 外部 高速 石英 震盪 Clock Configuration 要用 IO 口 开好 再来 Clock Configuration 时钟 树 RCC 详细 设置 点选 上方 Clock Configuration 1 点选 上方 Clock Configuration 配置 时钟 树 2 设定 外部 石英 震盪 速度 4 32 代表 说 只能 挂 石英 开发 版 3 PLL 数据 多工器 选择 HSE HSI 选择 HSE 4 选择 6 倍频 想 这颗 MCU 工作频率 48MHz 每颗 mcu 工作 频率 一点 高阶 一点 MCU IO 口 工作频率 会 喔 Datasheet 里的 调 7 框框 会变 红色 提示 错误 配置 5 系统 Clock 来源 选择 PLLCLK 6 PCLK1 APB1 总线 速度 48MHz 原因 APB1 GPIO 口上 控制线 Project Manager 再来 创造 专案 设定 点选 上方 Project Manager 1 Project Settings 专案 设置 Project Name 专案 名称 设置 h01 GPIO 设置 中文 Project Location 专案 要放 路径 选择 D 槽 创建 1 STM32CubeMXLib 空 资料夹 Application Struture 应用程序 结构 这里 包含 两个 选项 Basic 基础 结构 包含 中间件 RTOS 文件系统 USB 设备 Advanced 包含 中间件 针对 一点 工程 设定 Basic 模式 Toolchain Folder Location 这会 Project Location 专案 路径 建立 资料夹 名称 Project Name Toolchain IDE 选择 编译 软体 选择 MDK ARM Keil5 习惯 Keil5 喜好 䁖 版本 选 2 Linker Settings 堆栈 设置 这部分 预设 牵扯 程序码 运行 速度 入门 这行 先 玩 地方 动到 s 档 组合 语言 完过 再来 理解 设置 用意 3 Thread safe Settings 官方 使用手册 完 懂 Keil5 STM32CubeIDE 勾选 Enble multi threaded support 4 Mcu Firmware Package 不用 动 预设 选择 要用 HAL 库 版本 Code Generator 来点 选 左 半边 Code Generator 代码生成 器 地方 设定 代码 样子 1 STM32Cube MCU packages embedded software packs Copy used libraries into project folder 过的库 复制到 项目 文件夹 中 地方 勾 工程 才 会 包含 功能 库 查看 功能 样 函示 Copy only necessary library files 复制 库 文件 CAN SPI I2C 外设 功能 新增 相关 库 文件 工程 Add necessary library files reference toolchain project configuration file 工具 链 项目 配置文件 中 添加 库 文件 作为 参考 勾选 HAL 库 驱动 文件 只会 配置 初始 函示 我要 点亮 1 LED 勾选 选项 就要 写 操作 暂存器 赋予 值 像是 暂存器 开发 刚 勾 1 快速 基本功能 2 Generated files 生成 文件 需求 选择 习惯 功能 函示 地方 居住 勾选 1 选项 像是 标准 库 开发 方式 兴趣 铁人 文章 再来 2 不想 每次 生成 程序 备份 旧 3 个则 每次 新 文件 时 取代 掉 原本 程序 Generate peripheral initialization a pair ' c h ' files per peripheral 外设 生成 独立 ' c h ' 文件 勾 初始化 代码 生成 main c 勾选 初始化 代码生成 外设 文件 UART 初始化 代码生成 uart c 中 Backup previously generated files when re generating 生成 时 备份 生成 文件 生成 代码 时 会 相关 目录 中 生成 Backup 文件夹 源文件 拷贝到 Keep User Code when re generating 生成 时 保留 用户 代码 main c 中 添加 一段 代码 生成 时 会 main c 中 保留 添加 这段 代码 前提 这段 代码 写 位置 BEGIN END 之间 会 删除 Delete previously generated files when re generated 删除 生成 生成 文件 假设 生成 i2c c 重新配置 i2c c 则会 删除 i2c c 文件 3 HAL Settings HAL 库 设置 Set free pins analog optimize power consumption 空閒 引脚 设置 为 类比 输入 做 低功耗 产品 时 选项 勾选 nable Full Assert 使能 断言 参数 检查 Template Settings 模板 设置 预设 兴趣 参考 最新 用户手册 6 节 Custom code generation 内容 Advanced Settings Driver Selector 选择 库 做 驱动 HAL 库 LL 库 两个 差别 做 解释 不在 描述 Generated Function Calls 调用函数 两个 选项 Not Generate Function Call Visibility Static 1 Do Not Generate Function Call 生成 函数调用 代码 调用 初始化 函数 GPIO 项勾选 Do Not Generate Function Call main c 函数 中 调用 MX GPIO Init 函数 选择 调用 设定 GENERATE CODE 完过 一下子 会 视窗 选择 左边 1 开启 专案 资料夹 点开 MDK ARM 会 下图 点开 h01 GPIO 专案 写 程序 main c 4 行 插上 LED PA1 会 闪烁 花 半天 这篇文 会想 整理 好处 想 传承 实验室 学弟 妹 传承 包跨 铁人 赛 文章 操作 疑问 提",
    "以下内容 同步 更新 接下来 内容 要将 测试 案例 变得 更 测试 案例 建立 资料 输入 正确 资料 则回 成功 资料 回传 400 并跟 使用者 错 未来 针对 属性 会 go playground validator 功能 这段 内容 透过 validator 错误 透过 validator 转换 使用者 输入 内容 还缺 这次 code 转写 影片",
    "网格 机器人 改成 一周 开启 周五 机器人 会 自动 关闭",
    "文章 同步 更新 接下来 测试 势必 建立 interface 新增 mock interface 未来 interface 扩增 输入 指令 gomock 官网 中 提到 想要 批次 建立 mock file 透过 批量 go generate 原理 透过 注解 方式 执行 语法 搭配 mockgen 根目录 执行 ... 当前目录 ... 目录 字串 路径 参考 做 资料夹 中 档案 go generate 跑 一遍 未来 会 忘记 这段 指令 这时候 就用到 工具 Makefile 工具 帮 很多 系统 使令 统一 放到 档案 中 透过 执行 档案 写法 存放 Makefile 路径 执行 会 帮 执行 PHONY Makefile 执行 指令 拿来 做 compile 会 建议 执行 指令 指令 档案 放到 PHONY 放在 PHONY 里的 内容 Makefile 执行 才 会 辨别 有没有 改变 举 个例 子 刚好 有个 档案 generate 第一次 执行 他会 实行 go generate ... 第二次 执行 时 generate PHONY 中 Makefile 判断 会 generate 变动 执行 go generate ... 详细 内容 网路上 查看 更 资料 仅用 执行 指令 附上 这次 comment 纪录",
    "文章 同步 更新 大致 api 开设 这次 专案 中 预计 会 实作 测试 request 完整 执行 实作 测试 案例 写 程序 中 频繁 测试 向下兼容 这次 测试 到来 测试 范本 这次 写 测试 案例 http request input output 参考 echo 官网 测试 案例 撰写 这次 gomock mock 来将 程序 中 有用 依赖 interface 做 替换 测试 案例 中 自由选择 method 预期 输出 这次 测试 案例 中 IRequest 中 换成 gomock struct 然 程序 中 Get 变得 自由 控制 预期 输入 输出 详细 参考 golang 中 想要 mock 内容 种 方式 附上 找到 的还 不错 参考 这次 code 编辑 影片 过程 参考 备注 撰写 程序 当下 释出 第二 版 想 v2 ginkgo 先 专案 执行 专案 go mod ginkgo 升级成 v2 再来 来将 系统 cli 更新",
    "上架 打包 APK 1 选 Buile Generate Signed Bundle APK 2 选 APK 一步 3 签章 档 4 存放 位置 5 输入 档名 只能 英文 副 档名 jks OK 6 文件 密码 123456 7 Alias key0 别名 预设 8 Validity years 代表 key 多久 代表 25 年 9 填 O 疴 金钥 10 一步 一步 11 12 选 release 才 上架 13 apk 档案 上架 14 google play 网站 15 建立 应用程序 16 名称 中文 17 V 18 长 资讯 主页 19 写 一连串 .... 20 存取 权 开放 储存 储存 21 ... 广告 不含 广告 分级 填 问捲 对象 剩下 图片 22 锁住 代表 有没有 做 完 23 选取 国家 24 放上 刚刚 做 APK 建立 版本 7 天审 核才 有没有 上传 ... 从 2021 年 11 月 开始 新版 应用 必须 API 级别 30 更 高 版本 为 目标 运行 环境 一篇",
    "先前 文章 中 探讨 中断 异常 UNIX Like Shell 实作 方式 本篇 文章 中 作者 会 尝试 实作 系统 呼叫 Shell mini riscv os 当中 透过 Shell 学习 fork exit 系统 呼叫 系统 呼叫 System Call 作业系统 提供 User space 应用程序 调用 系统 呼叫 作业系统 便会 User space 切换 Kernel space 作业系统 完该 系统 呼叫 才 会 切换 回 User space 上图 取自 精简 UNIX Shell 流程图 Shell 会 读取 来自 使用者 输入 命令 呼叫 fork 作业系统 复制 状态 母 程序 子程序 On success PID child process returned parent 0 returned child -- 子程序 作业系统 母与子 程序 会 fork return value 判断 程序 后者 执行 母 程序 呼叫 wait 系统 呼叫 等待 子程序 结束 执行 执行 子程序 则将 刚刚 分析 完 使用者 命令 带入 exec 系统 呼叫 载入 执行 指定 档案 子程序 结束 母 程序 会 循环 等待 使用者 下达 新 命令 补充 Copy On Write 作业系统 接受 fork 系统 呼叫 会 将母 程序 内容 复制 子程序 母 程序 子程序 持有 Stack 并非 一块 若要 fork 时 完整 Copy 整份 Stack 内容 浪费 效能 针对 作业系统 采用 Copy On Write 技术 假设 母 程序 Stack 存放 counter 变数 呼叫 fork 子程序 参考 一块 记忆体 状况 会 持续 一方 尝试 修改 counter 变数 修改 方会将 counter 内容 放到 新 记忆体 位址 修改 持有 一份 做 节省 记忆体 空间 fork 带来 额外 开销 正题 实作 系统 呼叫 简易 Shell 尚未 实作 fork 系统 呼叫 下方 身影 先 略过 实作 系统 呼叫 刚刚 提到 User space 应用程序 调用 系统 呼叫 作业系统 便会 User space 切换 Kernel space 需求 系统 中断 Interrupt 0 Exception 11 描述 Environment call M mode Environment call ecall 即可 组合 语言 几个 函式 提供 C 语言 呼叫 呼叫 列出 函式 函式 会将 系统 呼叫 号码 放入 a7 暂存器 执行 ecall Machin mode Environment call 会 交由 do syscall do syscall 会以 a7 暂存器 储存 号码 判断 系统 呼叫 做出 exec exit 为例 exec 呼叫 系统 会将 希望 执行 程序 位址 参数 传入 复写 掉 pc 位址 exit 呼叫 系统 会 Task 移除 并将 pc 复写 os kernel 位址 会将 希望 执行 程序 位址 参数 传入 exec 函式 作业系统 完整 档案 系统 实作 执行 档案 概念 弥补 缺陷 选择 事先 构造 app table 作业系统 开机 执行 user init 时 先 注册 User Program Program 简易 函式 透过 函式 指标 方式 注册 OS 实作 mini shell 实作 mini shell 笔者 发现 lib puts 执行 时 使用者 还没 输入 命令 Shell 发生 时间 中断 等到 完 中断 回到 Task 时 会 正确 执行 小心 存取 记忆体 空间 作业系统 会 Fault load Fault store 状况 系统 还没 实作 fork file system unix shell 一套 方法 拿来 笔者 花 一点 时间 解答 lib puts 执行 时 需 特别 关闭 开启 interrupt enable BTW 请 先将 exteral handler 中 UART 中断 handler 移除 使用者 输入 字符 当下 系统 会 uart register 内容 印出来 等到 shell 要用 读 不到 内容 Program counter 执行 一条 指令 中断 异常 Program counter 继续执行 发生 异常 指令 会 死循环 稍微 修改 trap handler 即可 改用 task create 替代 刚刚 提到 笔者 构造 user table 用来 存放 简易 user program 读取 命令 找到 命令 函式 丢给 task create 当作 fork 替代 方案 确保 使用者 输入 命令 系统 立刻 需求 缩短 作业系统 排程 切换 时间 lib delay 保证系统 会 马上 切换 user program 这次 实验 使用者 体验 mini riscv os 互动 快乐 更动 还没 patch back 回 mini riscv os 之中 修改 专案 底下 原因 几点 改动 幅度 大 系统 呼叫 shell 完整 应 改以 方式 排程 非 Timer Interrupt UART 中断 当下 uart register 内容 buffer 等到 lib puts 要用 时 存取 buffer 专案 诸多 缺点 但作 学习 作业系统 敲门砖 价值 赏我 Star 感谢 贡献 gethid 实作 构建 系统 呼叫 雏形 Reference",
    "前言 想不到 草稿 还能 写 代码 重构 情况 回头 修 文章 bug 机率 不大 reCAPTCHA google 推出 机器人 服务 帮忙 过滤 机器人 流量 V3 版本 为例 google 会 使用者 判断 使用者 机器人 使用者 花 时间 去点 图形 先到 reCAPTCHA 官网 申请 帐号 网域 地方 输入 网域 有趣 想 本地 测试 输入 127.0 0.1 会 两组 金钥 一组 用于 前端 另一组 则是 放在 server 随意 公开 描述 reCAPTCHA 绑订 按钮 这方 法较 弹性 一种 方法 假设 希望 发出 登陆 请求 使用者 机器人 打开 sign js 将登入 地方 改写 解释 当按 送 出 表单 会先 请求 发给 google 检查 是否是 机器人 google 会 回应 一组 token 接着将 这组 token 使用者 资料 送到 台 台 要将 这笔 token 送给 google 这位 使用者 分数 过程 另一组 金钥来 认证 middleware auth go 补上 router package 选择 想要 检查 是否是 机器人 路径 接上 middleware serve auth go 补上 发送 请求 google google 回应 google 判断 分数 CheckRobot 内 补上 分数 以此 做 逻辑 无视 掉 太 机器人 分数 小于 自订 score 值 请求 CheckRobot 内 补上",
    "光看 图片 发现 ST 提供 各式 划图 function 方形 外框 全 填满 DrawRect FillRect 圆形 外框 全 填满 DrawCircle FillCircle 三角形 外框 全 填满 DrawPolygon FillPolygon 椭圆形 外框 全 填满 DrawEllipse FillEllipse 划线 DrawLine 垂直 水平 DrawVLine DrawHLine 测试 过后 才 三角形 ... 光看 英文 多边形 才 只能 划 三角形 导致 我划 出 啾 啾 BSP LCD DrawPolygon Points 3 BSP LCD FillPolygon Points2 3 原本 两行 划出 那种 三角形 依样划葫芦 才 改成 直角三角形 Polygon 多边形 改 参数 BSP LCD FillPolygon Points4 4 Point Points4 260 150 260 170 290 150 290 170 错 不信邪 改 划图 区块 Point Points4 260 150 290 150 260 170 290 170 function 适合 三角形 ..................................... 想 会 错误 思考 顺序 图案 这才 发现 给的 x y 顺序 像是 调整 顺序 Point Points4 260 150 290 150 290 170 260 170 认知 四边形 试试看 Point Points4 260 150 290 150 290 170 275 185 260 170 结论 给的 X Y 座标 顺序 围起来 区块 才 它划 算是 还他 清白",
    "参加 铁人 赛 用意 开发 版 STM32F746 开发 版 好康 事情 参加 开赛 前 统计 报名 人数 初期 统计 参加 人数 统计 完赛 人数 好不容易 撑 完 30 天 发现 完赛 没 这块 板子 铁定 到手 正题 这块 板子 送到 光看 这面 发现 SPDIF 接头 CAMERA uSD 右边 两个 按钮 user 操作 reset 右边 jump 控制 电源 输入 四个 选择 5v ext 5v link usb fs usb hs jump 下方 5v ext 下方 下方 ETHERNET 3.5 音源 输入 输出 另一面 则是 块 触控 面板 这是 上电 显示 划面 烧 CODE 稍微 玩 感觉 不错 很快 M7 效能 顺畅 媲美 手机 顺畅 度 接下来 回到 RD 安装 Driver en stsw link009 v2.0 2 安装 IDE en st stm32cubeide 1.8 0 11526 20211126 0815 x86 64 exe v1.8 0 看起来 IDE 维护 更新 再来 乱搞 IDE 抓 sample code 跑 抓 几个 试试看 剩下 动手 改写 发现 网路 居然 烧录 那份 demo code 那份 超棒 提供 那份 source code 学习 学习 难道 找 Arm 视窗 索取 私下 找 Odin 问问 Jack 会 那份 source code 触控 音效 档案 读写 效能 抓取 划图 解读 地方 这块 板子 会 顺手 初 接触 这块 板子 小小 心得",
    "烫伤 手 停 几天 差不多 15 天 好像 交代 完 东西 剩下 大部分 冷门 Grid Layout Module Level 2 事情 支援 度 商榷 讲 一点 手是 了点 倒 不用 太 担心 Grid 耐心 假设 Grid Layout Module 基本操作 方式 来看 Grid 到底 情况 事情 事情 做 地方 很多 单 讨论 做 不到 地方 快 非矩 型 区块 非矩 型 区块 非矩 型 区块 基本上 想要 Grid 实作 Layout 有太大 非矩 型 区块 设计 基本上 Grid 制作 如同 div 盛行 年代 东西 Grid 来排 潮 做 例外 说 意外 章节 来说 例外 地方 无限 宽度 高度 物件 隐 性格 线 浏览器 Bug 间隔 尺寸 消灭 零 尺寸 网格 轨道 fr 演算 规则 fit content 演算 规则 minmax 演算 规则 基本上 制作 格线 系统 留意 地方 大方向 矩型 区块 地方 机会 Layout 发生 奇怪 事情 会 莫名其妙 地方 例子 赘述 前述 章节 提到 最让人 麻烦 浏览器 实作 说 Grid 多年 浏览器 网格 实作 渲染 方式 略有 差异 主流 浏览器 Grid 渲染 有太多 例外 这也 Microsoft Edge Chromium 协助 重写 新 渲染 引擎 说 Issue 回报 Chromium 笑 哪一天 会 回到 Chrome 身上 看起来 Edge 93 会用 新 GridNG 实际上 查询 Microsoft 特别 提到 这件 事情 期待 毕竟 Grid Layout Level 2 支援 乐见 其成 谨慎 设定 网格 轨道 会 发现 一篇 会 讲到 尺寸 事情 会 发现 固定 尺寸 网格 容器 弹性 尺寸 网格 容器 网格 轨道 设定 稍有不慎 网格 容器 尺寸 基本上 形同虚设 会 网格 轨道 爆掉 网格 单元 指定 超出 轨道 数量 方向 跨 网格 单元 超出 轨道 数量 方向 网格 单元 命名 网格 隐性 轨道 尺寸 总和 大于 网格 容器 grid template 写错 怀疑 一点 合法 写法 想 做 写 复制 贴 改 状况 不少 俗语 好像 知其然 不知 所以然 隐 性格 线 浏览器 渲染 设定 雷 有没有 发现 提及 隐 性格 线时 特别 着墨 轨道 格线 数字 有雷 灿笑 提到 网格 系统 爆掉 事情 故意 想 善用 隐 性格 线来 帮 做些 事情 留意 隐 性格 线 轨道 数字 举个 例子 渲染 贴上来 先 设定 来看 渲染 测试 浏览器 Google Chrome 97.0 4692.71 Firefox 96.0 Microsoft Edge 97.0 1072.55 Safari 15.1 17612.2 9.1 20 基本上 划面 放 Chrome Safari Safari ModernIE 美名 这次 算是 蛮 合群 显而易见 我为 了将 差异 作 特意 指定 grid auto column grid auto row 数值 gap 设定 10px 状况 先 列举 auto 尺寸 演算 关系 尺寸 0 1 关系 gap 第二条 线 关系 隐性 网格 列入 负数 网格 计算 内 3 关系 行 方向 1 2 列 方向 1 4 状况 换个 方向 会 成立 不用 太 失望 该会 怪怪的 地方 row 转向 column 会 自动 变好 gap 消灭 合并 取消 gap grid auto column grid auto row 数值 取消 那划 划面 毛病 说 打算 好好 规划 grid template grid template area 请 隐 性格 线 带来 小结 主流 浏览器 来看 Grid 支援 度 各家 渲染 状况 太 奇怪 落差 主流 市场 CSS Framework 真的 在意 Framework 到底 Flexbox Grid 章节 会聊 Media Query Grid 演算 机制 回见 目录 小节 部落 格 同步 放送",
    "Show html 资料 查询 呈现 多出 操作 像是 编辑 删除 ... Show html 加上 client 端 jQuery 存取 呼叫 程序 扩充 操作 相关 连结 编辑 传入 产品类别 ID 页面 跳转 后续 资料 回填 删除 针对 特定 产品类别 ID 呼叫 HTTP Delete 即可 扩充 编辑 Action Method Edite html client 端 jQuery 存取 呼叫 程序 GET 类型 GetSpecificCategoryById 用来 帮 资料 查询 用来 后续 回填 划面 PUT 类型 UpdateCategory 用来 呼叫 端 编辑 更新 运行 效果 划面 By CategoryID 回填 更改 执行 编辑 更新 扩充 删除 Action Method 运行 效果 删除 API 存取 采用 同步 方式 确保 entity 取到 null null 例外 错误 此会 发现 Entity Framework 更新 写法 所写 方式 事实上 EntityFramework 中有 多种 更新 写法 文章 net core MVC 更新 采用 context Update 实体 context SaveChanges context SaveChangesAsync net core WebAPI 采用 context Entry 实体 State EntityState Modified context SaveChanges context SaveChangesAsync 若想 观察 EF Core SQL 指令 Startup cs 引入 using Microsoft Extensions Logging 调整 ConfigureServices 再次 执行 编辑 观察 到当 执行 SaveChange EF 底层 执行 SQL script 输出 视窗 中 记得 调整 net core 才 预设 带 参数值 版本 启动 敏感 资料 log 机制 即可 MVC context Update 实体 SQL 语句 WebAPI context Entry 实体 State EntityState Modified SQL 语句 执行 state 变更 句 事实上 处于 Detached 状态 标记 Modified 才 会 变更 追踪 EF 中 EntityState 共分 几种 改 MVC Update 写法 看起来 栏位 更新 事实上 两种 写法 针对 资料 物件 栏位 做 更新 写法 Update 事实上 标记 Modified 做 变更 追踪 更新 两种 写法 设计 接收 并复写 做法 预设 Entity 状态 处于 Detached 改 采用 先 查询 更新 预设 既有 DB 取出 Entity 状态 追踪 中 改为 作法 先 DB 捞取 出 指定 entity 改 年龄 栏位 entity 预设 状态 追踪 中 不用 state 标记 呼叫 Update 更新 会 更新 变动 栏位 网上 时常 有人 EF 例子 写 样子 写 事实上 update 洁癖 有要 更新 栏位 更新 若是则 先 DB 捞取 预设 会 attach Ref Modifying data via DbContext C# Entity Framework 更新 数据 三种 方法 C# NET Entity Framework Update Record Q A Entity Framework 更新 资料 表 栏位 观察 EF Core SQL 指令 NET Core C# Entity Framework Core EF Core Update 更新 记录 方法 示例 代码 本篇 同步 发表 部落 格",
    "接续 Startup cs 中 启用 静态 资源 专案 新增 目录 命名 wwwroot 会 自动 地球 图示 wwwroot 引入 bs4 jquery3.6 测试 Client 端 UI 时 互动 存取 透过 jQuery 接着要 实作 产品 分类 资料 查询 增加 新增 PCategoryController cs 新增 Action 查询 Action Controllers PCategoryController cs 同步 形式 API 存取 透过 net core DI 建构 子 注入 DbContext Controller 程序 中 存取 异动 新增 静态 资源 页面 wwwroot PCategory Add html wwwroot PCategory Show html 运行 效果 ado net 搭配 写法 写法 基本上 采用 同步 API 存取 方式 基本上 单位 时间 内能 消化 请求 量 称 吞吐 流通 量 Throughput 有限 会 阻塞 EFCore 支援 异步 存取 相关 API 方法 名 Async 后缀 改为 非 同步 API 存取 非 同步 异步 形式 API 存取 Ref The Ultimate Guide Async Await C# ASP NET 效能 调教 Async Await 非 同步 机制 加快 Web API 回应 时间 网站 测试工具 JMeter 教学 JMeter 网页 压力 测试 教学 NET Web 应用 中 为什幺 async await 异步 编程 非 同步 程序设计 真的 提升 整体 应用程序 执行 效能 ASP NET async 心法 本篇 同步 发表 部落 格",
    "专案 前置 建立 配置 visual studio net core web api 专案 net5 专案 中 预设 OpenAPI 勾选 会 自动 配置 Swagger 文档 相关 dll 设定 预设 Swashbuckle AspNetCore 预设 专案 Startup cs 运行 专案 预设 会 跳转 swagger swagger UI 划面 Properties launchSettings json launchUrl swagger 设定 关系 EF Core 安装 Microsoft EntityFrameworkCore sqlserver 此要 vs2019 net5 做 开发 太高版 EFCore 会 支援 vs2022 net6 改为 5.0 13 版本 6 x CodeFirst 开发 前置 一段时间 需求 分析 资料 朔模 会 产出 ERD 和表 关联 简单 产品 分类 产品 项目 资讯 设计 资料库 中 两张 table 关联 资料 字典 Step1 资料 实体模型 一张 table Model Folder Models Product cs Models PCategory cs Step2 建立 DbContext 衍生 类 Data ProductDbContext cs Step3 appsettings json 配置 DB connection string Step4 Startup cs ConfigureServices DB 服务 依赖 注入 Startup cs 引入 命名 空间 using Microsoft EntityFrameworkCore using Net5EFCoreWebApiApp Data Startup cs Step5 至主 程序 Program cs 中 Main 实践 第一次 执行 DB 上下文 建立 原先 程序码 CreateHostBuilder args Build Run 删掉 注解 掉 需 引入 命名 空间 Microsoft Extensions DependencyInjection using Microsoft Extensions DependencyInjection Program cs 希望 Web 应 用于 启动时 会 Startup class 中 注册 DB 上下文 服务 自行 建立 衍生 DbContext 物件 ProductDbContext 借由 dbContext Database EnsureCreated 方法 创建 DB EnsureCreated 回传 Boolean true 代表 新 资料库 结构 建立 false 代表 资料库 结构 不需 建立 启动 先 观察 SSMS 是还 AspNetEFCoreDb 资料库 沿用 示范 ado net 资料库 会 发现 启动 完并 额外 新 table DB 两种 方式 情境 情境 1 这是 全新 一项 专案 更改 DB 名称 再重 执行 应用程序 想要 同一个 Db 既有 先 做 删除 建立 Drop database exists dbContext Database EnsureDeleted 情境 2 这是 针对 既有 DB 搭配 EF 开发 沿用 示范 ado net 资料库 AspNetEFCoreDb 资料库 启用 专案 migration 机制 透过 nuget 补 安装 Microsoft EntityFrameworkCore Tools 第一 步骤 先 启用 初始化 DB Migration 子 才能 EF Core 得知 舍 DB 迁移 变动 额外 补 增加 几张 Table 既有 DB 当中 开启 PMC Package Manager Console Tools NuGet Package Manager Package Manager Console 输入 指令 EF 先 输入 enable migrations 启用 migration 机制 EF Core 不用 第二 步骤 程序 中 改为 dbContext Database Migrate 重启 会 DB 目标 资料 表 既有 table 影响 资料 还在 不想 启动专 方式 透过 指令 update database 应用程序 部属 不太可能 类似 专案 中 人工 判断 有无 初始化 等待 资料库 迁移 程序 端 借由 DbContext Database GetPendingMigrations Any 应用程序 做 判断 最终 Program cs 程序 Ref Automatic migration Entity Framework Core Where should I put Database EnsureCreated EF core creating tables migrate method Database Migrate creating database but tables EF NET Core 2 How where call Database EnsureCreated Database Migrate Can ' t enable migrations Entity Framework VS 2017 NET Core Entity Framework 6 Code Frist 3 Migration commands Migrations Code First 大道 番外 Migrations 本篇 同步 发表 部落 格",
    "文章 同步 更新 官网 网页 端 地给 存取 资料 功能 验证 资料 正确 功能 使用者 提供 符合 需求 资料 时 主动 体醒 使用者 方向 改 资料 验证 功能 这次 echo 官方 推荐 验证 套件 这是 官网 介绍 validator 透过 宣告 注入 echo 中 同一个 validator 透过 方法 echo router 中 放入 validator 验证 资料 这次 code 编辑 过程",
    "Swagger 刚 将其 理解 成 网页 版本 postman 测试 发送 资料 回传 预设 webapi 专案 WeatherForecastController 新增 post action 一份 json 测试 资料 尝试 post 专案 中 中断点 下方 则会 呈现 回应 curl 呼叫 语法 转译 Swagger 中若 想 自订 API 文档 外部 开发者 厂商 做 移至 Startup cs ConfigureServices 方法 API 官方 文件 会 习惯 写 中英文 注解 描述 只 API 功能 C# 专案 透过 XML 函数 method 上方 添加 功能 描述 注解 写 API 子 呈现 别人 会 晓得 功能 目的 预设 专案 开启 XML 注解 读取 机制 开启 本篇 同步 发表 部落 格",
    "前言 抱歉 打扰 XD 真的 太 想来 分享 厚着 脸皮 po 文了 XD 这次 参加 铁人 赛 颁奖典礼 XD 得奖者 XD 私心 往下 会 XD 本日 正文 去年 第二次 参加 奖状 有压 参赛 题目 惊喜 地方 得奖者 专属 badge 耶 醉翁之意不在酒 得奖者 千里迢迢 && 千方百计 参加 颁奖典礼 颁奖典礼 办 辅仁大学 会问 辅仁大学 这次 东京 奥运 好几个 优秀 选手 辅仁大学 唸书 三次 元 偶像 怡静 昀 儒 辅大 学生 XD 想 辅大 相关 布景 拍 XD 刚进 辅大 颁奖典礼 地点 一路上 怡静 昀 儒 身影 正 小小 失望 ..... 重点 错 XD 天无绝人之路 天无绝人之路 颁奖典礼 路上 询问 辅大 学生 告诉 中美堂 会 运动选手 布景 亲切 指导 圣言 楼要 走到 中美堂 补充 捷运 站 会 布景 循着 指示 终于 找到 太 感谢 这位 辅 大学生 T TTTTTTT 这里讲 看不到 说 妳是 好人 妳 会 一生 平安 课业 嗨 趴 补充 2020 年 铁人 赛 团体 完赛礼 会 铜牌 XD 真的 太伤 成本 XD 理解 完赛礼 会 拿到 奖牌 XD 奖状 有多压 参赛 题目 真的 很棒 计划性 去年 拿到 两个 铜牌 带 辅大 XD 终于 两个 铜牌 怡静昀 儒 两个 铜牌 合照 梦想 回到 捷运 站 发现 真的 布景 真的 非常感谢 iThome 铁人 赛 主办单位 主办 这次 比赛 颁奖典礼 梦想 始料未及 事 XD 重点 再错 真的 有种 去年 参加 铁人 赛是 辅大 偶像 合照 梦想 错觉 XD 后记 补充 回过 头看 篇文章 发现 颁奖典礼 本身 描述 太少 XD 当天 奖状 走 XD 补 一张 当天 照片 集锦 证明 好好 参与 颁奖典礼 事 XD 致谢 我要 先 感谢 参加 iThome 铁人 赛 每位 参赛者 参与 精采 铁人 赛 颁奖典礼 X PS 朝圣 有趣 事情 XD 再次 感谢 那位 亲切 辅 大学生 妳 没 办法 梦想 再次 感谢 iThome 铁人 赛 主办单位 幕前幕后 工作人员 您们 辛苦 m m 还让 参加 颁奖典礼 拿到 餐盒 饮料 这也 太好了 QAQ PS1 回家 吃 餐盒 好吃 很澎派 PS2 拍谢 那天 工作人员 还被 我问 奇怪 XD 希望 这次 铁人 赛 会 再见 XD 期待 自虐 XDDDDDDDDDDDDDDDD Ado Lin 2022.01 10",
    "先前 Hueman 主题 plugin 花 时间 研究 才能 加进去 推荐 NexT 整合 plugin 修改 设定 档 想像 美好 做 不少 ... Themes 架构 变更 NexT 主题 主题 会 安装 themes 资料夹 底下 则是 放到 node modules 修改 样式 设定 网站 根目录 建立 config 主题 名称 yml 档案 调整 设定值 设定 档 内容 node modules hexo theme next 资料夹 底下 找 config yml 复制 回 网站 根目录 改 记得 改 档名 会 原本 hexo config 冲突 作法 主题 原始 码 更动 后续 更新 主题 版本 出 本篇 文章 版本 Hexo 5.4 0 NexT 8.8 2 左侧 选单 显示 最新 文章 NexT hexo related popular posts 套件 显示 最新 文章 列表 功能 套件 没 办法 运作 网路上 不少 教学 文章 NexT 架构 档案 格式 swig 改成 njk 旧 文章 贴 成功 设定 步骤 修改 config next js 设定 定 样式 档案 近期 文章 设定 网站 根目录 source 资料夹 新增 data 资料夹 建立 sidebar njk 档案 sidebar njk 档案 段 程序码 swig 版本 差 toArray 生成 页面 参考 文章 导入 Google Analytics NexT 做好 相关 配置 config next js 设定 追踪 ID NexT 文件 中有 UA 开头 网路 教学 做 只会 拿到 G 开头 追踪 码 参考 下个 步骤 连结 乖乖 申请 UA 开头 追踪 码 没 分享 不吝指教 谢谢",
    "Update 01 10 EP approved 纪录 这份 offer 时程 大 公司 关系 很多 relocation 事务 交给 专业 公司 有效率 沟通 顺畅 新加坡 签证 EP Employment Pass 新加坡 最高级 工作 签证 薪资 至少 5000 新币 影响 申请 因素 包含 国籍 学校 公司 产业 规模 职业 硬性 标准 MOM 新加坡 人力 部 判定 申请 EP 前会 雇主 做 Self Assessment Tool 都过 不了 送 机会 渺茫 SP WP 工作 签 不到 研究 WP 真的 做工 LTVP Long Term Visit Pass DP Dependent ' s Pass 想带 爸妈 LTVP EP 想 申请 薪水 达 门槛 配偶 子女 DP 持有 EP SP 薪水 超过 6k 申请 签证 想要 工作 都还 申请 offer 后续 时程 【 11 30 】 HIRE RIGHT 背景 调查 开 跑 背景 调查 填 个资 打电话 学校 确认 真有 此人 HIRE RIGHT 有会 说 中文 稍微 知会 校方 【 12 9 】 Offer letter 签完 送回 【 12 14 】 背调 FRAGOMEN 接棒 VISA 护照 快 到期 新加坡 入境 那天 6 月 效期 办理 新 护照 延迟 礼拜 加钱 办速件 ... 穷 【 12 29 】 EP application filed 【 01 10 】 EP approved IPA letter",
    "此次 修正 内容 将在 定义 资料库 内容 pq schema 中 两个 model 套用 设计 概念 error 放入 middleware 中 统一 error message 这次 改动 录影 github 连结 附在 此处 请 自行 取用 测试 此次 更新 内容 留置 篇文章 文章 同步 发表",
    "满常要 form submit 改成 AJAX 非 同步 送 表单 分享 template 非 Laravel 做 端 Laravel Response 范例 json 前端 status code 参考 建议 无脑 200",
    "1 Grid Optimizer 原本 4 年 资料 回测 改成 5 年 00646 改 00662 2 Gridbot 移除 不到 除错 程序码 过度 交易 threshold 改成 max 2000 总资产 0.5% 3 Gridbot 更新 网格 策略 参数 祝 新年快乐",
    "一套 web api 管理 测试 工具 协助 提供 自订 API 规格 文件 呼叫 回应 方式 描述 台 中 交通 API 案例 2015 年 Swagger 捐赠 OpenAPI 计划 OpenAPI 别称 习惯 OpenAPI 视为 一种 规范 Swagger 则是 实践 规范 工具 OpenAPI 注重 开发者 写 API 调用 呼叫者 合作 不用 透过 程序码 存取 OpenAPI 规范 访问 URL HTTP Method 采用 何种 GET PUT POST ... 参数 资料 型别 用户端 呼叫 更能 二次开发 无缝 接轨 Swagger 相当于 OpenAPI 规范 发展 一系列 产品 品牌 旗下 诸多 工具 OpenAPIGenerator .... Swagger UI 则是 提供 Web 接口 OpenAPI 规范 提供 资讯 NET Core 开发 框架 则可 透过 middleware 方式 注册 NSwag Swashbuckle Swagger 3 Web UI Swagger 2 Web UI net core web api Swagger 配置 跑 几篇 最终 产出 专案 配置 Nuget 套件 下载安装 NSwag AspNetCore Starup ConfigureServices 方法 注册 服务 Configure 启用 OpenAPI SwaggerUI 中间件 见证 奇蹟 时刻 懒得 写 API 文件 开发者 来说 真的 一大 福音 查看 Swagger API 自动 帮 扫描 API 方法 WEB API Document 预设 路由 swagger 会 自动 跳转 swagger index html 真的 执行 存取 异动 Ref OpenAPI Specification Swagger OpenAPI ASP NET Core web API 档 NSwag ASP NET Core 使用者 入门 Swashbuckle ASP NET Core 使用者 入门 本篇 同步 发表 部落 格",
    "数据 表格 陈列 划面 上时 会 关键字 查询 机制 新增 Search Action By 文章内容 标题 模糊 查询 前端 划面 jQuery Ajax 呼叫 查询 回来 每次 呼叫 前 table tbody 清除 资料 重叠 本篇 同步 发表 部落 格",
    "操作 删除 编辑 页面 回填 By NewsId 查询 Action 扩充 Show html 中 jQuery Ajax 呼叫 程序 划面 调整 新增 操作 Column 附上 跳转 Edit 页面 删除 功能 差别 在于 删除 呼叫 js 端 触发 删除 一段 js 执行 编辑 则是 跳转 特定 一页 News Edit html 划面 则是 By 特定 NewsId 查询 回填 划面 中 文章 分类 下拉 选单 则是 额外 ajax 存取 查询 回填 type id 吻合 设置 预设 选取 状态 剩下 编辑 表单 更新 提交 前端 jQuery 触发 呼叫 效果 before after 本篇 同步 发表 部落 格",
    "几个 开发方式 渐渐 了解 端 分离 开发方式 新闻 文章 表格 陈列 Controller 新增 Show 查询 动作 方法 wwwroot News Show html 有个 在于 文章 类别 显示 ID 流水号 看不懂 改为 中文 定义 显示 NewsInfo Model 中 扩充 TypeName 并在 NewsController 扩充 方法 GetNewsTypeNameById Show html 简单 ID 替换成 newsTypeName 本篇 同步 发表 部落 格",
    "新闻 类别 相关 增删 改查 要来 新闻 文章 增删 改查 功能 导入 新建 NewsController wwwroot 额外 建立 News 目录 新增 添加 新闻 文章 页面 表单 Add html 网页 UI 元素 中 时常 会 透过 DB 动态 捞取 资料 作 绑定 微粒 绑定 下拉 选单 新闻 类别 借由 jQuery 呼叫 端 API 方式 GET 查出 绑定 完善 NewsController 新增 insert 新闻 文章 Action Add html 前端 增加 Ajax 呼叫 随意 挑 一篇 新闻 文章 尝试 新增 本篇 同步 发表 部落 格",
    "前言 说 useCallback useMemo 时机 模糊 透过 篇文章 厘清 观念 一点 不用 盲目 反而 更耗 效能 React 底层 记忆 值 消耗 效能 Referential Equality 先 复习 Referential Equality 理解 内容 会 阵列 物件 函式 物件 型别 拥有 call reference 特性 两个 物件 元素 属性 函式 内容 做 时 会 false React 关系 useCallback 时机 Referential Equality 案例 1 范例 React memo 包复 元件 Child 接收 函式 onClick 当作 props 父 元件 渲染 时 同一个 函式 函式 React memo 会以 传入 props 改变 渲染 Child 元件 加上 useCallback Referential Equality 案例 2 useEffect dependency array 元素 物件 型 别时 物件 会 useEffect 当作 dependency array 改变 例子 useEffect 无限 render 加上 useCallback 范例 类似 例子 pjchender 大大的 提到 兴趣 读者 跳 useEffect dependencies 中 放入 函式 useCallback 段落 阅读 useMemo 时机 1 Referential Equality Referential Equality 概念 套用 useMemo 留意 useEffect dependency array 2 计算 开销 较大 值 filter 很多 元素 阵列 数学 运算 参考资料 推荐 阅读",
    "星期四 12 14 大盘 跌幅 近 百分点 市场 哀嚎 散户 犯 错 大涨 找 理由 大跌 狂找 原因 常听到 美股 大跌 才 拖累 大盘 Fed 主席 鲍尔又讲 才 导致 大跌 预设 任何原因 猜 不到 市场 单一 力量 说了算 这时候 因素 一点 意义 反观 检视 持股 到达 停损 位阶 身为 投资人 认清 一点 一点 赚钱 赔钱 外 次要 一个多月 农历 过年 关心 大盘 究竟 攻 上万 八 总共 三次 挑战 万八 失败 坐收 毕竟 万八是 历史 高点 顺利 站上 没 失败 一会 有人 套牢 冲破 关卡 先将 套牢 卖压 消化 掉 每次 大跌 跌幅 更 跌破 支撑 没有支撑 14 号这跟 黑 K 一举 跌破 10 日 月 线 三天 内 站上 月线 会 找 季线 支撑 那天 外资 大卖 好家 官股 进场 护盘 稍微 止血 15 号有 微涨 价量 背离 价涨 量减 至少 卖压 理想 情况 14 号 下跌 吓到 导致 15 号 恐慌性 出场 卖压 危险 15 号 算是 初步 止跌 讯号 16 号有 机会 上攻 收盘 价涨量 增 算是 多头 走势 站上 均线 算是 现象 太 靠近 万 八大关 未 站稳 会 震盪 情况 资金 部位 放太多 心态 陪样 才 最要 才 每次 大跌",
    "写 系统 程序 主题 跳进 Software Development 算是 大胆 尝试 大学 时期 写过 web 简单 程序 来说 得奖 名单 作品 真的 又惊又喜 学生 时期 拿到 铁人 赛 奖项 终极目标 想 为例 鼓励 跳脱 舒适 圈 或许 不经意 间 生活 惊喜 更新 文章 预计 会 再补 fork wait exit ... 系统 呼叫 文章 执行 绪 程序 做 基础 铺垫 铁人 发文 按钮 一阵子 会 消失 文章 结构 大 调整 新 文章 会 优先 更新 确保 期望 顺序 学习 系统 程序 还请 见谅 废话 结束 C 程序 中 goto 工程师 之间 热烈 讨论 话题 有人 说 goto 会 破坏 程序 结构 有人 说 回圈 何必 goto goto 大型 软体 专案 实验室 开发 关系 笔者 阅读 大型 c 语言 专案 碰巧 读到 篇文章 goto 更 认知 一般来说 goto C 语言 专案 很大 exception handling computed goto 开发者 C 语言 程序 出错 时 回收 动态分配 记忆体 错误处理 确保 程序 下次 该函 式 时 工作 试想 一家 公司 开发 高效能 网路 程序 确保 程序 稳定 持续 工作 软体 中 发生 错误 轻易 放过 2021 年 10 月初 Facebook 断线 例子 来看 Facebook 长达 六小时 断线 连带 损失估计 超过 9 亿美元 商业化 软体 稳定性 后者 computed goto 才 笔者 想要 本文 分享 重点 computed goto 先前 浅谈 分支 预测 Hazards 议题 一文 中 归纳 出 重点 分支 预测 失败 会 导致 流水线 中 排序 指令流 清除 这也 处理器 不止 做 白工 还要 正确 指令 填充 回 流水线 再谈 branch prediction 处理器 引入 如上图 所示 分支 预测 方法 处理器 会以 address 索引 检索 Pattern history table 历史纪录 进一步 做出 预测 computed goto computed goto 适用于 取代 switch case 基底 dispatcher switch 仅会 基底 分派任务 参考 子 说 会 抽象 程序码 进一步 了解 概念 处理器 分支 预测 方式 来看 一段 程序码 周期 会 jump 地方 会 导致 分支 预测 成功率 下降 反复 填充 正确 指令 流水线 computed goto 会 幺 做 function 内 宣告 变数 时 static 关键字 变数 生命周期 延长 程序 结束 C C++ 中 地方 static 会 带来 效果 特别注意 unary operator && gcc 提供 扩展 搭配 label 跳转 位址 配合 goto 程序 访问 code 跳转 操作 做 好处 显而易见 computed goto jump 操作 分成 好几 正确 访问 dispatch table 处理器 更 精准 预测 正确 分支 真实世界 例子 Computed goto efficient dispatch tables 一文 提到 computed goto 知名 软体 Ruby 1.9 YARV also uses computed goto Dalvik Android Java VM computed goto Lua 5.2 uses a switch Jserv 老师 主导 开发 rv32emu next 引入 computed goto 实作 详细 手法 参考 前 请 详阅 公开 说明书 unary operator gcc 特别 提供 扩展 C 语言 专案 gcc 编译 有人 下载 原始 码且 采用 编译器 编译 会 错误 时 写 makefile 使用者 做出 超出 预期 针对 编译器 类别 做 侦测 目标 编译器 非 gcc switch case 编译 时 fno gcse fno crossjumping gcc 优化 原始 码 Reference",
    "1 开启 网格 机器人 流程 改成 1 执行 网格 机器人 2 读取 money 变数 现金 部位 大小 3 读 取现 股 部位 大小 4 印出 机器人 总资产 现股 现金 5 问 使用者 加减 码 money 变数 做 操作 6 执行 机器人 交易 7 下午 两点 关闭 机器人 money 变数 写到 档案 2 改用 机器人 纪录 成交 回报 金额 计算 机器人 现金 部位 增减 不再 仰赖 帐户 馀额 交割 金",
    "佳作 承蒙 评审 给予 肯定 感谢 方式 狗尾续貂 一番 沈淀 一个多月 时常 咀嚼 结语 中 故作 轻松 豪语 先抓 2025 Q4 释出 Hoddarla 1.0 版 铁人 赛毕 回归 日常 松开 锁 走下 大怒 神 云霄飞车 座椅 感觉 方才 经历 瞬间 带来 极 深刻 感官 体验 日后 鼓起勇气 挑战 足够 把握 刺激 游园 设施 经验 类比 部份 先前 规划 2025 Q4 时间 尽头 时间 到达 尽头 作业系统 典范 概念 工程 原则 破坏 创新 沿袭 有太多 矛盾 本身 隐式 专案 宣言 side project 原始 本能 之中 提取 足够 能量 核心 动力 而后 才 启动 设定 目标 阶段 一步步 回顾 改善 这份 能量 空乏 也许 需 挪作 他途 也许 资源 耗竭 哪里 达成 目标 Hoddarla 两年 生命 本身 类似 向度 思考 大部分 一文 之中 持续 久 非 独有 沉吟 这末 篇 将会 连狗尾 等级 引 2 来源 希望 读者 诸君 一同 品味 我将 Hoddarla 1.0 目标 搁置 也许 酐 醉 深处 underflow 恰到好处 醒觉 说不定 这场 演讲 来自 开放 系统 架构 论坛 2021 技术 年会 连动 OSDI 研讨会 Key Note 讲座 精彩 Key Note 需 富含 领域 深度 洞见 这场 讲座 不缺 而论 启 发性 娱乐性 更是 这场 讲座 津津乐道 处 一两个 月 稍微 作业系统 主题 会 这场 讲座 参照 延伸 讨论 讲者 Timothy Roscoe 一位 带领 ETH Zurich 系统 部门 业界 先进 开场 鸡蛋 高墙 式 高 反差 手法 指出 OSDI 作业系统 领域 影响力 一份 刊物 之中 作业系统 本身 学术论文 仅是 论文 之中 Linux 实验 平台 之外 作业系统 研究 稀缺 一年 一两篇 程度 思考 作业系统 相关 哲学 决不会 陌生 作业系统 到底 Linux 讲者 给出 很强 断言 Linux 作业系统 研究 领域 高 佔 见树 不见 林 实际上 就算 Linux 之外 作业系统 设计 研究 Linux 共享 一项 硬体 假设 ccNUMA 架构 CPU 丛集 来说 记忆体 存取 远近 亲疏 之别 之间 cache coherent 就此 破题 讲者 列举 一点 ccNUMA 系统 方块图 说 Linux ccNUMA 架构 而生 作业系统 实际上 控制 真实 硬体 CPU 记忆体 真实 硬体 元件 解离 情境 作业系统 透过 driver 稍微 接触 边疆 民 有趣 这也 催生 领域 研究 机会 领域 cross SoC 研究 计算机 架构 研究 来说 改 架构 理解 调整 软体 层 东西 简单 领域 研究者 时间 Linux 之外 作业系统 势必 周边 硬体 元件 配合 Linux 状态 讲者 顺便 抱怨 USENIX OSDI 研讨会 大部分 机器 学习 资料库 领域 研究 作业系统 领域 研究 反而 少 不打紧 子 领域 专属 高品质 研讨会 作业系统 不仅如此 硬是 研究 作业系统 选择 Linux 务必 实验 OS 尽量 Linux 运行 ccNUMA 假设 之下 31 分钟 这场 讲座 点 讲者 做 最重 批判 现状 作业系统 设计 研究 远离 真实 硬体 硬 体长 样子 这是 无知 停留 舒适 圈里面 专注 Linux 本来 擅长 这是 否认 现状 作者 语气 放缓 提出 建议 一步 作法 包含 写 系统 控制 真实 SoC 确实 包含 撰写 系统 降伏 复杂度 本来 天职 过程 中 讲者 提出 一篇 他作 作者 论文 2011 年 至今 没什幺 改变 来说 Linux 大宗 作业系统 排挤 孤立 仅仅 佔据 CPU Memory 一小块 角落 越来越 作业系统 看不见 东西 延伸 资料 导致 整体性 打造 电脑 计算机 讲者 俨然 系统 软体 禅师 大声 诘问 理解 电脑 硬体 懂 至少 2011 那篇 论文 制定 规格 打造 工业 级 电脑 简单 讲者 简单 秀 规格 照片 描述 作业系统 研究者 少 关注 BMC 主机板 控制器 负责 温度 电量 贴近 原生 硬体 关键 控制 回头 审视 ccNUMA 假设 侷限性 讲者 领域 计算机 架构 领域 研究者 关心 关键 作业系统 领域 跟上 才 结论 理所当然 硬体 这些年来 变化 工程界 很多 公司 关注 现象 开发 新 作业系统 子 领域 反复强调 两个 大宗 架构 关注 项目 作业系统 研究者 跟上 社群 USENIX OSDI 鼓励 类似 研究 大 环境 否认 Linux 之外 大 真实 硬体 样貌 呈现 软体 现状 缺乏 认知 作业系统 研究 崭新 机会 真的 新 硬体 构思 新 作业系统 架构 工具 远比 好多 新 正规方法 语言 新 硬体 ... Hoddarla 赛期 中 接触 讲座 带来 莫大 鼓舞 结论 讲者 鼓励 新 语言 新 概念 遗憾 笔者 至今 接触 过的 RISC V 机器 简单 平台 再不然 模拟器 新 机器 探索 讲者 有头有脸 研究 单位 居 高职 支配 资源量 才 支撑 作出 告 背后 靠山 现状 必有 诸多 原因 演化 至今 使然 未来 盈利 主流 当中 Linux 非 Linux 离经叛道 遑论 是非 POSIX 排除 C 语言 说 未来 事项 将会 研究 成形 RISC V 进阶 中断 架构 Advanced Interrupt Architecture 新机制 两三年 会 普及 取代 现今 PLIC 做法 或许 硬体 本身 控制器 转为 RISC V 情况 更 有望 支援 类似 讲者 期望 那种 作业系统 相较 前 篇 讲座 佳评 连连 系列 文 共 四篇 评论 却是 稍微 负面 有评 论说 作者 点出 一大堆 了解 本身 了解 主题 足以 称之为 旁边 热闹 也许 众人 评论 自有 道理 作者 稀疏地 更新 2020 二月 后续 系列 文 停留 架构 构想 阶段 部落 格中 作者 部落 格用 艺名 No Bugs Hare 行文 我行我素 美式 口语 幽默 争议 处采 痛点 前 一篇 讲者 争议 处会 放缓 打预防针 做法 敢 放话 No Bugs 技术 一番 见识 描述 五十年 硬体 软体 生态系 进展 论述 地基 硬体 改进 差异 至少 数点 效能 无需多说 元件 效能 改进 CPU Memory 之间 资料 速度 越差 越大 context switch 变得 昂贵 NUMA Interrupt 改进 更深 pipeline 分支 预测 软体 看不到 CPU 改良 软体 大多 工具 功能 增强 静态 分析 工具 公共 签署 实务 增加 使用者 软体 来源 信心 应用程序 层有 更好 分享 东西 Shared Nothing 讯息 传递 Message Passing 式 API 语言 框架 中供 作者 引述 Golang Channel 设计 背后 核心 精神 Do communicate sharing memory instead share memory communicating 非 同步 程序设计 框架 则是 列举 作者 希望 作业系统 中 改良 八大 项目 增加 弹性 布署 时 控制 选项 取代 开发 时 编译 时 控制 选项 无论是 低阶 MCU 高阶 CPU 借由 作业系统 接口 共享 应用程序 驱动程序 非 开发 增加 稳定度 测试 性 正式 上线 生产 环境 除错 经验 应 提升 一例 很多 生产 环境 crash 掉 难解 决 有个 监控 机制 调度 事发 前 一段时间 系统 状态 会 更好 认知 很多 工具 提供 是问 作业系统 提供 内 建 容错 Fault tolerance 扩容 Scalibility 安全性 情境 增加 安全性 解决 公共 财的 悲剧 参见 作者 应是 意指 租户 使用者 情境 系统 利用 状态 驱动程序 开发 简化 增加 效能 且须 分开 HPC 高效能 运算 CPU 负责 绝大部分 互动式 工作 作者 遭受 批评 作者 希望 改进 面向 应 措施 工具 作者 评估 过的 批评 本身 道理 作者 不仅仅 希望 改进 做法 实际上 更 希望 作业系统 核心 应用程序 之间 设定 边界 无异于 多出 框架 第三方 函式 库 内心 想望 投射 解读 篇 更进一步 想要 功能 想法 当初 系列 持续 这篇 蓝图 篇 描述 改良 段落 撰写 本篇 提出 五个 功能 长 段落 做 结论 不免 破坏性 压缩 先行 致歉 读者 诸君 感受 那份 动能 原生 支援 事件驱动 Event driven 式 程序设计 模式 支援 手持 装置 桌面 系统 服务器 事件驱动 模式 透过 程序 语言 框架 函式 库来 支援 支援 方法 应用程序 层 费了 很多 工夫 费工夫 底层 系统 本质 中断 驱动 Interrupt driven 式 作者 大部分 事件处理 很快 解决 事件驱动 模式 优于 中断 驱动 模式 考量 执行 绪 切换 维护 作业系统 之中 何等 高 成本 原文 heavy weighted 作者 出发点 更到 细节 处 有限 状态机 Finite state machine 执行 单元 事实上 很多 嵌入式 作业系统 即时 作业系统 类似 设计 作者 一点 想要 就算 是给 高阶 处理器 运行 作业系统 应往 方向 靠拢 才 网页 服务器 效能 为例 non blockng nginx 优于 apache 东西 FSM 系统 执行 时 会 deterministic 有助于 检验 生产 环境 crash 事件 理论 一台 机器 记录下来 log 运行 系统 机器 重现 理想 这也 简化 迁移 migration 流程 作者 重 定义 作业系统 指涉 核心 指涉 API 提供 应用程序 驱动程序 运行 配备 核心 原 系列 作者 最会 现实 阻拦 设计 原则 个例 子 网页 服务器 阅览 组态 档 需求 Unix like 系统 有个 open 系统 呼叫 档案 系统 互动 也许 应用程序 层 API read conf open 服务器 想要 运行 档案 系统 微小 系统 read conf 不堪 何不 定 作业系统 API read conf API 分群 应用程序 设计者 用到 足够 看法 延伸 第三点 应用程序 设计者 角度 出发 提出 兼具 应用程序 仅 API 高层 级 API 底层 作业系统 核心 抽换 解法 延续 第三点 网页 服务器 案例 设计者 选择 read conf sql socket 非 限定 Unix like kernel open read socket API 一点 太 理解 精神 旨趣 作者 倡议 作业系统 程序 语言 编译器 更 紧密 合作 呼应 第二篇 当中 援引 程序 语言 静态 分析 工具 优势 名为 第一份 草稿 比前 篇 更 接近 设计 先 跳过 Hoddarla 原本 反 社会 恐怖主义 作者 No Bugs Hare 相比 传统 价值 乖乖 牌 系列 文 相比 单纯 Golang 语言 比照 以往 作业系统 照顾 贴近 硬体 抽象 层级 XXI 系列 充满 更 想像 原作者 部落 格下 留言 大多 不以 为然 转发 Hacker News 众人 评论 不太优 相 之下 Hoddarla 本身 回响 驱车 入巷 时 猛吠 狗 引 一瞥 真的 要说 系列 文给 技术 发想 之外 点子 接近 第一 时间 感受 篇文章 这是 Stonemaier 设计师 Jamey 文章 指引 有志于 桌游 设计 一系列 心法 中 一篇 一言以蔽之 点子 聪颖 无比 没 做出 东西 实践 过程 远远 构想 出 神妙 点子 困难 当初 乍看 一把 无明火 点子 作出 东西 事实 梦想家 比例 佔 全人类 总数 实际上 不少 实践者 协调者 会 点子 做 来说 梦想 烂 主意 并无二致 更 极端 说 搞不好 率低 梦想家 价值 更 低 换个 角度看 理解 创业 失败 受 景仰 程度 会 远大于 在讲 创业 没 做 流于 功利主义 梦想 尽头 难道 世界 带来 更好 改变 这不 纯然 过程 梦想 兑现 途中 一部分 成果 重点 做 做 大概 Nike 品牌形象 缘故 本来 期待 系列 会 引导 Hoddarla 尴尬 console 更 高明 东西 一个系列 停止 更新 First draft 难免 惆怅 永远 站 鸡蛋 遗憾 无论如何 高墙 正确 日前 晶心 壮士 队友 聊聊 技术 路上 梦想 知晓 远大 梦想 泄漏 祕密 追问 既然如此 做 铁人 赛 事情 太 循规蹈矩 毕竟 很多 学习 事情 来说 吸收 养分 理解 ... 来说 这是 煎熬 震盪 安排 走 正轨 想要 好好 吸收 养分 不由得 会 太乖 Hoddarla project 做 做 会 该学 东西 还学 梦想 规划 执行 一年 半 冲刺 三五个 月 沉淀 佳作 沉淀 ... 会 选择 永远 Hoddarla 停留 0.1 状态 几年 内 做 作业系统 专案 尝试 典范 典范 岁月 风沙 淘洗 共存 共生 共 演化 人类 面并 唯一 主体 宰制 至多是 脑细胞 player C 语言 Linux Linux Foundation 概念 前辈 脑中 跃出 一本 本长 灰尘 书 电流 血 概念 肉 神物 挑战 神兽 没血 没 魔 没装 没 天命 有何 可战 作业系统 专案 尝试 自干 作业系统 答案 两件 事情 区分 开 来看 先说 第一件 事 接近 Hoddarla No Bugs Dare 想 做 事情 会 业界 先进 归类 经验 一群 倾向 认同 Timothy 讲座 中 提到 引用 2011 年 论文 角度 梦想家 想要 挑战 改动 作业系统 原则 光 软体 层 做 真的 够吗 硬体 假设 之下 会 到头来 就算 给你 做 差太多 反正 RISC V 开源 核心 只会 越来越 硬体 概念 补 回来 也许 硬 体层 改 软硬 之间 更 互补 需 会 更 有趣 专案 是从 作业系统 往下 角度 角度 Hoddarla 本身 想要 Golang 执行期 作业系统 一部分 地说 太 丑陋 维护性 至少 Golang 套用 可行性 Golang 至少 付出 像是 TamaGo 专案 等级 心力 才行 再不然 就连 程序 语言 思考 语法 简洁 节省 开发者 认知 资源 工具 众多 ... 一件 事情 自干 作业系统 认知 作业系统 课堂 深 浅 作业 技术 狂 实作 本质 手边 工具 重现 实务 作业系统 一小部分 想要 走 路 过程 中 学到 缺乏 技术 知识 玩具 希望 做 东西 玩具 话虽如此 光是 骇客 好好 自干 做 本身 足以 第一种 看起来 像是 逃避 仔 看法 大方 承认 想要 逃避 C POSIX everything a file 企鹅 红色 恶魔 玩具 倡导 价值 影响力 回事 创业 营利 回事 学习 面向 或许 唯一 创造 玩具 理由 学生 潜入 Linux 大 系统 找到 痛点 修正 听 很久 时间 学生 经验 Input Output 效果 会 创造 玩具 学习 认知 有进有出 预期 方法 效果 打造 玩具 学习 法有 一大 原因 节省 日后 接触 真实 系统 手 时间 而花 了解 玩具 复杂度 花太多 时间 也就是说 教学 心智 模型 深潜 真实 系统 中所 需 时间 远远 大于 打造 玩具 过程 中 理解 系统 元件 时间 加上 有过 玩具 经验 手 真实 系统 学习 时间 出 社会 总觉 潜入 真实世界 未必 坏处 大部分 就学 时期 玩具 都造 不好 没造过 工作 自由支配 时间 更为 稀缺 这时候 做 玩具 来说 毫无意义 Side project 铁人 赛 系列 文在 夺奖 劣势 聊聊 劣势 恭喜 Software Development 组 冠军 系列 文 节奏 分配 确实 登 楼梯 感觉 程序码 实例 夹带 重构 心法 目标 读者 群大 易 受益 反观 几次 尝试 大多 自我中心 Side project 东西 本来 关乎 自我 成长 Hoddarla RISC V 面向 透过 实际操作 方式 展露出来 先前 几次 尝试 来得 完整 整体 学习 来讲 略显 虚浮 去芜存菁 感觉 仅仅 参加 目的 优势 劣势 兴趣 型 专案 独到 领域 型 专门知识 整理 教学 目的 分享 成 系列 文的料 未来 会 参赛 核心 形式 求 扭转 劣势 策略 争奖 打算 下次 回避 Modern Web Software Development 两个 一级 战区 评审 主办单位 公布 评量 向度 得奖 系列 文在 向度 分数 评语 如此一来 未获奖 技术 有个 目标 得奖者 相当于 回馈 增进 传递 知识 能力 由衷感谢 读者 希望 最末 篇 宣告 Hoddarla 1.0 永远 感到 阅读 系列 浪费 时间 理论 大部分 RISC V S mode CSR 系统 却是 Hoddarla 系统 建构 脉络 之下 逻辑 至少 一点 学习 参考 事实上 一个多月 参考 几次 PLIC Golang 系统 面向 则是 偏门 往复 搭配 前年 系列 才 比较清楚 阅读 确实 会 难以 入口 系统 软体 圈多 C Golang 绝大部分 生硬 形式化 方式 表达 文章 确实 刻意 这是 表达 读者 尊重 方法 实际上 成效 只能 说 世界 误会 大得 所有人 会 遗憾 结论 本篇 则是 宽松 更 接近 日常 行文 方式 读来 也许 自溺 有趣 推荐 读者 诸君 试着 创作 铁人 赛 部落 格 相遇 更 会 未来 先前 写作 相遇 那种 经验 堪比 接触 陌生人 举例来说 先前 三个 铁人 赛 系列 认得 笔调 精神 生命 同等 岁月 遗失 留下来 的则 大部分 程序码 概念 赖以 为生 技术 感谢 阅读 阅读 文字 程序码 毫无意义 请 接受 过早 佳节 祝福 希望 2022 所有人 来说 带来 机会 成长 一年",
    "买 哪次 买好 买满 一步 稽核 最终目标 人员 技术人员 法规 网路 架构 网路 连线 使用者 电脑 服务器 电腊 频率 A 级 办理 二年 办理 技术 面 分类 提要 网路 架构 检视 端点 防护 开发 防护 基准 盘点 清查 检测 扫描 盘点 文件 清查 旧 系统 帐号 安全性 检测 资通 健诊 健诊 目 包括 网路 架构 检视 有将 网路 分区 公私 IP 配置 彼此间 连线 存取 网路 恶意 活动 检视 会侧 录 网路 分 区间 封包 异常 分析 网路 设备 log 异常 使用者 端 电脑 恶意 活动 检视 检测 电脑 中 异常 包含 程序 网路 连线 帐号 还会 作业系统 应用程序 安装 更新 服务器 主机 恶意 活动 检视 使用者 端 一项 不合宜 作业系统 Windows10 目录 服务器 设定 防火墙 连线 设定 检视 检测 套用 GCB 政府 贴心 打包 好供 选购 请参阅 4531 揪 甘心 价格 仅仅 单一 项目 价格 ... 人天 费用 加总 7 万之多 还不 包含 GCB 资料库 检测 ... 110 年 资安健 诊费 最低 费用 1 6 项目 74761.5 1 6 项目 7 GCB 108744 1 6 项目 7 GCB 8 防火墙 131399 应办 事项 外 健诊 列入 先行 作业 提到 执行 项目 包含 GCB 资料库 会 稽核 时 技术 检测 建议 选择 优质 厂商 寻找 中 顺利 复测 稽核 目标 文件 库 参考 资源 延伸 阅读",
    "接续 昨天 response headers Julia Evans 大大的 可爱 图 图片 来源 Set Cookie set a cookie Access Control 呼叫 Cross Origin Resource Sharing CORS cross origin 请求 Content Type body MIME type Content Length body 长度 单位 bytes Content Language body 语言 Content Encoding body 压缩 方式 Location URL 转倒 ... Accept Ranges server 告知 client 端 可否 支援 range range",
    "request 常用 headers 接下来 response 常用 headers Julia Evans 大大的 可爱 图 图片 来源 Age response cache 多久 s Date response send 出 Last Modified 内文 异动 ETag response body 版本 一串 hash Cache Control cache 设置 Vary req header 而会 变化 accept xxxxx Via proxy server 加上 ex nginx Expires 本次 response 有效期限 Connection close keep alive 判断 tcp 连线 开启",
    "context 流程 中 超时 控制器 lib context 常用 context 方法 来看 几个 例子 例子 中 会 第四 秒 时 发出 cancel 讯号 输出 第五 秒 时 context cancel 第二个 例子 例子 中 WithTimeout 设定 context 会 第四 秒 时 超时 输出 第三个 例子 WithTimeout cancel context cancel time out 输出 context 确保 流程 安全性 thread safe 更 准确 指 goroutine safe context 变动 只能 基于 现有 context 创出 新 子 context",
    "大盘 上周 连涨 四天 周五 小跌 作收 收盘价 均线 之上 型态 来看 算是 止 稳盘 柜买 指数 遇前 高 关系 会 震盪 处于 高档 盘整 中 且量 萎缩 迹象 周五 收盘价 站上 均线 以盘 代跌 情况 讲完 盘势 主题 选股 基本面 筹码 面 技术 面 听 明牌 之外 做足 功课 最终 会 面临 我该 选股 将以 案例 来说 明 操作 大 原则 见林 找 树 先 找 个股 先 国际 盘势 看美股 美股 表现 足以 影响 全球股市 不用 说 有个 迷思 纠正 台股 美股 连动 性 请 破除 迷思 步骤 至少 台股 盘势 会 底 柜买 指数 8 10 月间 呈现 向下 趋势 进场 赔钱 底部 带量 W 底 观察 等待 时机 入场 保险 情况 带量 站上 季线 突破 下降 趋势 线 预期 趋势 向上 持续 观察 跌破 趋势 线 若破 就要 出场 看类 股 台股 资金 轮动 快速 昨天 航运 塑化 明天 晶圆 代工 类股 发动 攻击 当中 几档 领头羊 会齐涨 齐跌 情况 类股 个股 观念 杰西 李佛摩 这本 书 讲到 协力车 概念 柜买 指数 电子 类股 主 柜 半导体 指数 柜买 指数 连动 性 高 才 着眼 个股 选择 以合晶 6182 为例 11 24 开盘 跳空 突破 区间 整理 均线 漂亮 进场 好时机 观察 3 天 回档 续 抱 分类 个股 方式 筛选 型态 强势 保证 会 一路 涨 方式 会 筛选 2 3 只 入场 伴随 而来 风险 趋势 变 3 只 齐跌 入场 前为 何要 做好 资金 控管 原因 3 点 我大 略带 很多 细节 还未讲 新手 先 不用 着手 个股 选择 至少 第二 第三点 做 扎实 连盘势 类股 趋势 贸然 进场 割 分",
    "上班 github 纪录 发现 commit 没 push 没 github 上传",
    "一个月 发 一篇 速度 怕 是还 发完 关赛 ... 人员 技术人员 法规 技术 面 分类 提要 网路 架构 检视 端点 防护 开发 防护 基准 盘点 清查 检测 扫描 盘点 文件 清查 旧 系统 帐号 安全性 检测 弱点 扫描 渗透 测试 资通 健诊 如果说 弱点 扫描 列个 清单 好好先生 不痛不痒 的还 赖皮 说 误判 本篇 渗透 测试 实实在在 暴燥 坏蛋 开心 将您打 回老家 测试 列出 利用 漏洞 外 还会 详细 攻击 手法 想赖 赖不掉 糟糕 技术 误 可知 渗透 测试 更 像是 一种 技术 列出 自动化 软体 符 ㄥ ˋ 合 ㄈ ㄨ ˋ 规范 metabolic 免费 偏向 软体 配合 才能 自动化 参考 rapid 7 商业 软体 收购 metabolic 公司 ... sqlmap 针对 SQL injection 工具 Burpsuite 商业 软体 谜 之声 人手 一套 怎么回事 实在 没 测试 免费 自动化 软体 找到 再补 ... 渗透 扫描 适用范围 弱点 扫描 太大 简单 区分 浅 深 程度 弱点 扫描 快速 产出 成本 低 频繁 法规 至少 渗透 扫描 思维 模拟 骇客 攻击 手法 组合 性 成本 高 情况 2 年 执行 即可 渗透 测试 技术 门槛 高 请 寻找 一家 经验丰富 厂商 给予 充足 时间 手动 会 可靠 随之 高涨",
    "完赛 发个 心得 好像 怪怪的 原本 想 系列 补充 完再发 心得 赶稿 压力 产出 超 低落 人性 ... 才 没生气 话 说 上次 铁人 赛 有幸 出书 机会 碍于 版权 关系 失败 收场 算是 解锁 真 铁人 系列 成就 铁人 赛断赛 出书 失败 ... 打击 之下 有想过 再次 出发 以能 出书 前提 挑选 题目 收十 心情 太 考量 反而 分享 乐趣 这次 参赛 题目 一反常态 选 工作 相关 正 聊 题目 也许 写文章 资安法 受苦受难 善男信女 包含 出书 束缚 版权 考量 下大玩梗图 说 说 五四三 舒压 下次 铁人 赛 题目 会 回到 上次 初衷 好玩 有趣 优先 有没有 附加 价值 当佛系 作者 XD",
    "ShiojiLogin py 加 contracts timeout 10000 参数 登入 时会 等待 Contracts 资料 下载 完 登入 比较慢 错误 Gridbot py 新增 下午 三点 中止执行 money 写到 档案 接下来 这周 开关 网格 机器人 会 改成 流程 1 执行 网格 机器人 2 读取 money 变数 现金 部位 大小 3 读 取现 股 部位 大小 4 印出 机器人 总资产 现股 现金 5 问 使用者 加减 码 money 变数 做 操作 6 执行 机器人 交易 7 下午 三点 关闭 机器人 money 变数 写到 档案",
    "好久 没有 更新 比较忙 不过 一个 有意思 问题 过来 记录 通过 正则表达式 匹配 文本 并 替换 一个 脚本 中 很多 路径 此时 更改 这个 路径 通过 正则表达式 来 匹配 找到 满足条件 字符串 然后 进行 替换 原始 路径 替换 后 路径 代码 内容 Replace 语法 为什幺 说 这个 有意思 理解 匹配 规则 时候 后面 应该 转义 额外 转义字符 应该 将 两个 当成 字符串 进行 匹配 结果 确 不行",
    "2021 年 11 月初 React Router 正式 释出 v6 版本 身为 React 开发者 按捺不住 好奇心 想 版本 究竟 增加 功能 修改 语法 篇文章 诞生 篇文章 中 我会 介绍 v6 新 功能 v5 哪些地方 1 Switch 元件 Routes 取代 传递 props 元件 方式 做 调整 新 props element v5 v6 2 Router 变 聪明 不用 加上 exact 需 透过 exact 设定 完全符合 url 时才 会 显现 指定 元件 内容 Router 会 抓取 相近 url 呈现 元件 3 NavLink activeClassName prop 移除 提到 activeClassName 移除 v6 className 判定 即可 4 简化 巢状 路由 推出 Outlet API 版本 搭配 useRouteMatch 组出 巢状 路由 写 想要 子 路由 v5 v6 path 有没有 加上 ' ' Outlet api 建立 巢状 路由 一大 利器 官方 提供 范例 Dashboard 元件 内部 会 路由 messages tasks Outlet 地方 呈现 元件 DashboardMessages DashboardTasks 5 useNavigate useHistory useNavigate 第一个 参数 路由 数字 代表 回去 页数 范例 1 v5 v6 范例 2 v5 v6 useNavigate hook 外 v6 提供 元件 6 useRoutes react router config 7 功能 几点 之外 变更 像是 React Router v6 bundle size 缩小 轻量 就举 常用 几点 来说 明 想 了解 更 点击 推荐 youtube 影片 官网 阅读 文件 囉 放上 中 介绍 React Router v5 范例 程序码 修改 v6 版本 程序码 范例 提供 读者 做 范例 中并 文中 功能 读者 自行",
    "加权指数 W 底 10 19 站上 颈线 一路 狂奔 11 19 历经 1 月 多头 格局 一个月 入场 大部分 赚 11 19 回档 迹象 今日 回档 再次 跌破 前高 支撑 线 连续 2 天 跌破 10 日线 投资人 会 荒 紧张 不到 空头 回档 今日 观察 重点 会 再度 跌破 支撑 线 跌破 加权 市场 个股 操作 会 倾向 保守 保住 获利 第一 原则 空头 瞎猜 纪律 进出 柜买 指数 相较 加权指数 柜买 指数 气焰 可强 一举 站 上前 高 支撑 未有 回档 迹象 均线 漂亮 发散 开花 排列 正确 这一波 量 7 10 月 还多 电子 类股 领先 族群 操作 电子 类股 居多 获利 原则 大 赚 赔 盘势 很强 尽量 放大 获利 盘势 转弱 懂得 收手 右侧 交易 原则",
    "有位 朋友 抱怨 单 绩效 差 很多 第一个 直觉反应 没 做好 资金 控管 先说 三次 资金 控管 资金 控管 资金 控管 资金 控管 没 做好 就算 标的 赔钱 将用 损益 解释 到底 赔钱 这张 近 一个月 未 损益 表面 看起来 很漂亮 一档 赔 会 赔 持股 标的 中 一档 联发科 11 23 收盘价 1080 250 这位 朋友 听 建议 都给 买 一张 感觉 会涨 就给 买 几张 出 唯一 赔 档 联发科 买法 联发科 佔 整体 资金 比重 太重 大跌 会 拖垮 整体 获利 正确 做法 平均分配 个股 佔 举例来说 假设 投资 标的 中有 100 50 20 股票 做 买 一张 100 跌个 10% 20 要涨 50% 才能 打平 100 跌 10% 20 涨 50% 机率 高 正确 做法 100 买 1 张 50 买 2 张 20 买 5 张 核心 观念 风险 平均 分摊 各股 高价股 大跌 获利 全吐 正确 投资 心态 长期 稳定 获利 输赢",
    "DevFest Hsinchu Taichung 周六 顺利 结束 感谢 Ryan 邀请 机会 学生 时期 站上 DevFest 舞台 QQ 这次 议程 中 介绍 RISC V 中断 异常 作业系统 当中 想 影片 解说 会 满满的 文字 更 理解 兴趣 朋友 影片 五小时 处 观看 议程 录影 排 小弟 前 一场 议程 提到 IC 产业 分工 内容 推荐",
    "接下来 要将 测试 放入 api 中 这次 测试 中 想 测试 mRequest Get 会 回传 资料库 request 值 这次 测试 中 mRequest Get 单纯 预期 资料库 会 回传 值 有没有 执行 执行 这段 sql 连线 requests 资料 那接 gorm mock lib 大部分 sql 资料库 mock 不用 制造 轮子 mock method 详细 用法 连结 中 查询 这次 ExpectQuery method 帮 检查 执行 想要 sql 语法 用法 检查 执行 SELECT FROM requests 这段 内容 说 regexp QuoteMeta method ExpectQuery 中 预设 会 认为 内容 正规 表达式 这句 sql 语法 中 正规 表达式 符号 冲到 想要 预期 字串 符合 就要 加上 regexp QuoteMeta 这段 内容 相符 判断句 改为 model 资料夹 执行 外面 执行 这次 测试 搂 附上 这次 commit 纪录",
    "改成 targetCapital 变数 控制 总部 位 大小 不用 开 机器人 还要 算 加减 多少钱 大小 初始化 会 检查 帐户 馀额 交割 金 没 钱 交割 这部分 没 特别 帐户 里的 钱汇 测试 有没有 预期 多放 钱",
    "分享 适合 刚 入门 STM32 新手 快速 了解 STM32 开发 生态 昨天 讲到 建议 标准 库学 懂 STM32CubeIDE 这方 法只 适合 走 韧体 开发 工程师 心想 研究 这韧体 领域 适合 那种 想要 快速 开发 功能 OK 功能 别学 标准 库 开发 STM32CubeIDE 暂存器 看法 函示 配置 方法 脚位 宣告 STM32CubeMX 帮 弄 好好 选好 IC 点 一点 图片 中 脚位 配置 初始化 函示 接下来 尽量 了解 东西 简短 方式 懂 先来 介绍 STM32Cube 生态 具 昨天 参加 ST 线上 研讨会 第一 介绍 新出 MCU 简单 整理 详细资料 ST 官网 查询 1 STM32MP1 这颗 MPU Cortex A7 核心 Cortex M 系列 大幅提高 性能 支持 Linux 系统 用户 内部 含有 GPU 下图 是从 会议 中 截图 MP1 架构 双核心 A7 M4 2 STM32H7 性能 MCU 双核心 M7 M4 480MHz 240MHz 高达 2Mbytes 内部 Flash 3 STM32U5 新出 的极 低功耗 MCU 更 高度 安全性 ADC 提升 14 bit 再来 聊聊 STM32Cube 软体 开发工具 系列 STM32CubeMX 图形化 设定 工具 STM32CubeIDE 整合 开发 环境 IDE STM32CubeProgrammer 烧录 程序 STM32CubeMX 选定 开发 MCU 型号 MCU 图片 点选 脚位 初始化 设定 STM32CubeMX 支援 最新 MP1 系列 MPU STM32CubeMX 周边 init C project HAL 库 LL 库 使用者 自行决定 提到 HAL 库是 标准 库 精简 版本 LL 库则 是从 HAL 衍生 精简 版本 暂存器 操作 大幅 缩小 原本 程序 容量 IDE 好处 不用 受限于 Keil5 免费 版本 程序 大小 限 太大 不让 烧入 困扰 STM32CubeIDE compiler tools 开新 专案 整合 CubeMX 进去 就算 下载 STM32CubeMX STM32CubeIDE 里 会 连结 STM32CubeMX 昨天 没 下载 STM32CubeMX 发现 IDE 连结 MX 会 卡顿 想 软体 时 内部 建立 MX 做 连动 导致 些微 卡顿 下载 STM32CubeMX 分开 顺畅 点 分开 影响 原本 专案 MX 视窗 设定 好脚 会后 Generate code IDE 软体 初始化 会 设定 先放上 截图 设定 UART2 来看 标准 库 设定 差别 是点 完 Generate code UART 初始化 函式 来看 标准 库 开发 UART 初始化 函式 IDE 点 一点 省去 很多 时间 昨天 用到 很想 跳来 IDE 开发 标准 库 经验 自动 程序码 陌生 大概 了 地方 做 事 能力 韧体 开发 具备 能力 会 来用 IDE 昨天 发表 QA 问答 问到 STM32L 系列 提供 标准 库 开发 资料 回答 提供 HAL 库 LL 库 听到 这回 答 ST 不在 提供 新 标准 库 程序 LL 库 来说 会 标准 库 效率 更高 LL 库 操作 暂存器 线上 研讨会 提到 MCU AI 出 STM32Cube AI 软体 这方面 没 这套 软体 适合 原本 AI 训练 经验 套用 训练 Mode C code 烧给 MCU 做 附上 相关 教学资料 研讨会 有人 问 有没有 相关 中文 学习 资料 回答 STM32Cube AI 影片 教学",
    "分享 适合 刚 入门 STM32 新手 閒聊 STM32 生态 11 月 09 日 11 月 10 日 参加 ST 线 研讨会 听 ST 介绍 生态 感想 了解 STM32CubeMX STM32CubeIDE 开发 模式 标准 库 开发 差别 原本 没 STM32CubeMX STM32CubeIDE 听说 两个 功能 模糊 印象 STM32CubeMX 自动 配置 初始化 函式 STM32CubeIDE 包含 MX 设定 功能 编译 配置 环境 模糊 方向 大致 但还 观念 接下来 会 两天 了解 知识 STM32CubeMX STM32CubeIDE 差别 HAL 库 LL 库是 东西 第一次 STM32CubeMX STM32CubeIDE 感想 ... 东西 太 想 转过 STM32Cube 系列 XD 这方 便 感想 建议 学完 标准 库 开发方式 学着 STM32CubeMX STM32CubeIDE 分享 完就会 我会 说 刚听 完线 研讨会 立马 载 STM32CubeMX STM32CubeIDE 刚刚 想来 分享 事情 明天 说 说 STM32CubeMX STM32CubeIDE HAL 库 LL 库 差别",
    "建立 简单 RESTful api 接下来 就要 测试 放到 程序 中 golang 中 原本 有将 测试 框架 包 进去 原生 函示 库 网路上 很多 测试 框架 接下来 会实 做 测试 方式 参考 gorm mock 篇文章 实作 方式 留言 交流 先 安装 测试 套件 测试 框架 mock 框架 gorm mock 补充 mock 用途 简单 测试 中 程序 中 只会 input output 撰写 测试 写 即可 程序 依赖 其他人 测试 上方 写 每次 测试 会 这时候 就要 rand Intn 产出 内容 控制 function 控制 动作 mock 原始 程序 测试 一篇 就要 测试 内容 放到 程序 中",
    "Day 38 AWS Lambda 中 YOLO 推估 Inference YOLO 自订 资料集 训练 方法 YOLO 推估 彼此之间 关系 下图 所示 使用者 透过 API Gateway 上传 PUT 图片 储存 贮体 A 事件 会 驱动 AWS Lambda 函数 AWS Lambda 函数 会 事先 训练 YOLO 模型 图片 YOLO 推估 Inference IAM 角色 B 身分 侦测 物件 划出 方块 框 存 储存 贮体 B 使用者 图 1 S3 驱动 Lambda 函数 YOLO 辨识 架构图 这份 专案 中 提供 OpenCV YOLO 推论 案例 试着将 案例 布署 AWS Lambda 测试 前期 工作 上传 YOLO 相关 档案 S3 训练 权重 档 yolov3 backup 推论 图片 02 frame 608x608 0090 jpg 建立 IAM 角色 执行 AWS Lambda 并有 存取 S3 许可 建立 AWS Lambda 函数 设定 环境 变数 AWS Lambda 建立 OpenCV 层 撰写 AWS Lambda 函数 测试 步骤 1 上传 YOLO 相关 档案 S3 AWS Lambda 函数 大小 256 MB YOLO 权重 档 yolov3 backup 推论 图片 02 frame 608x608 0090 jpg 存 S3 中 下图 所示 图 2 上传 YOLO 相关 档案 S3 步骤 2 建立 IAM 角色 建立 IAM 角色 执行 AWS Lambda 并有 存取 S3 许可 IAM 管理 控制台 选择 新增 角色 接下来 下图 所示 选择 Lambda 案例 点击 许可 按钮 图 3 建立 角色 选择 Lambda 案例 搜寻 文字 框中 输入 basic 找到 AWSLambdaBasicExecutionRole 连接 这将 角色 写入 CloudWatch 记录 档 全县 程序 除错 之用 下图 所示 图 4 连接 基础 CloudWatch 除错 许可 政策 先前 设定 后并 输入 角色 名称 建立 角色 下图 所示 图 5 检阅 设定 建立 角色 编辑 新 政策 内容 下图 所示 给定 读取 GetObject 储存 贮体 A 写入 物件 PutObject 权限 PutObjectAcl 储存 贮体 B 图 6 新增 政策 角色 设定 划面 新建 政策 连接 角色 下图 所示 图 7 新增 政策 连接 先前 角色 步骤 3 建立 AWS Lambda 函数 AWS Lambda 管理 控制台 选择 建立 Lambda 函数 设定 内容 下图 所示 执行 时间 务必 选择 Python 3.7 OpenCV 函式 库层 执行 角色 记得 选择 步骤 设定 角色 选择 选项 建立 函式 从头开始 撰写 函式 名称 opencv45Func 执行 时间 Python 3.7 架构 x86 64 执行 角色 现有 角色 图 8 建立 Lambda 函数 设定 划面 Lambda 函数 中 点击 组态 页 籤 点击 环境变量 新增 三个 环境变量 所示 modelbucket 存放 权重 储存 贮体 储存 贮体 B 储存 贮体 A 做 写入 会 引发 驱动 Lambda 事件 modelweight yolov4cfg yolov3 backup putbucket 储存 贮体 B 图 9 新增 Lambda 函数 组态 中 环境变量 步骤 4 AWS Lambda 建立 OpenCV 层 建立 Lambda 函数 选择 AWS Lambda 函数 设定 划面 划面 底端 为本 函数 新建 Layer 下图 所示 图 10 Lambda 函数 新增 Layer 新增 Layer 划面 选择 层 来源 自订 Layer 选择 先前 建立 opencv45 函式 库层 下图 所示 图 11 选择 opencv45 函式 库层 步骤 5 撰写 AWS Lambda 函数 测试 先 建立 目录 cfg 目录 内 新增 档案 yolov3 cfg 档案 内容 参考 推论 程序 service py 内容 service py 图 12 AWS Lambda 程序码 建立 新 测试 事件 事件 范本 选择 hello world 事件 名称 输入 fromS3Bucket 内容 下图 所示 这是 用来 模拟 S3 触发 Lambda 函数 传过来 参数 内容 记得 INPUT BUCKET 改成 输入 储存 贮体 名称 INPUT OBJECT 确保 档案 图 13 设定 Lambda 函数 测试 事件 拉 划面 下方 修改 执行 时间 设定 例程 指定 service handler 下图 所示 图 14 修改 执行 时间 设定 中 例程 点击 Test 测试 下图 所示 推论 时间 约 1.75 秒 需 记忆体 990 MB 图 15 OpenCV YOLO 推论 接受 解决方案 表 1 列出 为止 YOLO 辨识 部署 解决方案 表 1 EC2 Lambda SageMaker YOLO 辨识 EC2 Lambda darknet SageMaker Lambda OpenCV 成本 USD 0.736 hour 0 1.0304 hour 0 时间 秒 0.1 秒 60 秒 1 秒 1 3 秒 可用性 较差 AWS 托管 AWS 托管 AWS 托管 参考资料 Simple Inference Scripts YOLO OpenCV Day 34 实作 S3 驱动 Lambda 函数 Yolo 物件 辨识 Day 35 Amazon SageMaker 简介 Day 36 Container 建立 Amazon SageMaker 端点 Day 37 AWS Lambda 建立 OpenCV Layer yolov4 SageMaker Pytorch YOLOv4 YOLO v4 v3 CPU Inference API Windows Linux pytorch YOLO OpenVINO demo Real time Object Detection CPU",
    "Day 37 AWS Lambda 建立 OpenCV Layer OpenCV 影像 视觉 中 时常 用到 尝试 AWS Lambda 中 建立 一层 OpenCV 并将 AWS Lambda 操作 流程 打包 Python OpenCV 函式 库 AWS Lambda 建立 OpenCV 层 打包 程序 图片 传到 S3 AWS Lambda 执行 步骤 1 打包 Python OpenCV 函式 库 动作 务必 Linux 环境 操作 Windows macOS 会 执行 失败 推论 AWS Lambda 执行 OpenCV Container Linux based 这又 奇怪的是 Python 函式 登录 Amazon Linux 2 主机 执行 程序 操作 内容 创建 新 Python 虚拟环境 检查 Python 版本 更新 pip 安装 opencv 安装 套件 压缩 python 目录 检视 压缩 内容 压缩包 针对 Python 3.7 opencv 版本 4.5 3.56 numpy opencv 相依 包 会 一并 安装 进来 档案 大小 72 MB 图 1 Python OpenCV 压缩包 相关 版本 上传 压缩 档到 S3 记得 先 aws configure 使用者 认证 图 2 Python OpenCV 压缩包 传到 S3 步骤 2 AWS Lambda 建立 OpenCV 层 AWS Lambda 管理 控制台 选择 建立 Layer 输入 Layer 名称 上传 先前 建立 压缩 档 选择 兼容 架构 x86 64 兼容 执行 时间 指 希望 版本 python 中 执行 只能 选择 Python 3.7 选 版本 会 出错 建立 键 建立 Layer 下图 所示 图 3 建立 OpenCV Layer 设定 划面 步骤 3 打包 程序 图片 传到 S3 登录 EC2 创建 目录 将相 关 档案 放入 目录 中 压缩 传到 S3 存储 桶 内 相关 指令 yoloDrawLabel py 程序码 请 参考 下图 EC2 执行 划面 图 4 EC2 中 建立 Lambda 压缩 档 yoloDrawLabel py 步骤 4 AWS Lambda 执行 AWS Lambda 管理 控制台 选择 建立 Lambda 函数 设定 内容 下图 所示 选择 选项 建立 函式 从头开始 撰写 函式 名称 opencv45Func 执行 时间 Python 3.7 选项 选 Python 版本 会 错误 架构 x86 64 执行 角色 建立 具备 Lambda 许可 新 角色 图 5 建立 Lambda 函数 设定 划面 建立 Lambda 函数 选择 opencv45Func 函数 设定 划面 划面 底端 为本 函数 新建 Layer 下图 所示 图 6 Lambda 函数 新增 Layer 新增 Layer 划面 选择 层 来源 自订 Layer 选择 先前 建立 opencv45 函式 库层 下图 所示 图 7 选择 opencv45 函式 库层 上传 程序码 Lambda 函数 代码 传到 S3 需 函数 设定 主 划面 右边 找到 上传 按钮 点击 选择 Amazon S3 位置 指定 位置 s3 ap southeast 1 amazonaws com lambda zip 划面 所示 图 8 S3 压缩 档 建立 Lambda 函数 打开 yoloDrawLabel py 档案 插入 AWS Lambda 呼叫 函数 handler 修改 完毕 记得 点击 Deploy 下图 所示 图 9 修改 Lambda 函数 拉 划面 下方 修改 执行 时间 设定 例程 指定 yoloDrawLabel handler 下图 所示 图 10 修改 执行 时间 设定 中 例程 透过 点击 Test 执行 AWS Lambda 函数 第一次 执行 设定 测试 组态 不需 更改 需 给定 名称 即可 点击 会 执行 输出 EC2 输出 方块 框 左上角 右下角 座标 下图 所示 证明 OpenCV 层 运作 图 11 执行 AWS Lambda 函数 参考资料 建立 共享 Lambda 层 zip 封存 档 部署 Python Lambda 函数 Day 33 实作 S3 驱动 Lambda 函数 镜像 Day 12 标籤 图片 方法 实作 AWS S3 CP Examples – How Copy Files S3 CLI",
    "Day 36 Container 建立 Amazon SageMaker 端点 是将 训练 YOLO 权重 转为 SageMaker 节点 Lambda 调用 用到 AWS 资源 Amazon EC2 Amazon Simple Storage Service S3 Amazon Elastic Container Registry ECR AWS Lambda Amazon SageMaker Identity Access Management IAM 彼此之间 关系 下图 所示 使用者 透过 API Gateway 上传 PUT 图片 S3 事件 会 驱动 AWS Lambda AWS Lambda 中 会 呼叫 Amazon SageMaker 端点 endpoint 事先 训练 YOLO 模型 YOLO 模型 EC2 中 制作 容器 映像 档 Container Image 并上 传到 Amazon Elastic Container Registry 中 储存 图 1 S3 驱动 Lambda 函数 YOLO 辨识 架构图 建立 Amazon SageMaker 端点 步骤 EC2 中 建立 容器 映像 档 上传 容器 映像 档到 ECR Amazon SageMaker 笔记本 中 建立 Amazon SageMaker 端点 AWS Lambda 中 Amazon SageMaker 端点 呼叫 步骤 1 EC2 中 建立 容器 映像 档 专案 建立 容器 设定 专案 下载 EC2 建立 YOLOv4 推论 容器 映像 档 登录 事先 建立 EC2 个体 g4dn.2 xlarge 参考 篇文章 并将 事先 训练 权重 档 复制到 指定 目录 即可 参考 相关 指令 参考 操作 确认 yolov4 SageMaker 目录 结构 下图 所示 图 2 yolov4 SageMaker 目录 结构 修改 推论 程序 predictor py 容器 内 用来 图片 辨识 程序 预设 参数 修改 成 自定义 参数 修改 94 96 行 source yolov4 endpoint predictor py 图 3 修改 自行 定义 图片 辨识 程序 接下来 建立 容器 映像 档 组态 改成 GPU 基础 建立 映像 档 会 编辑 成 GPU 版本 建立 过程 会 缓慢 大概 数个 小时 会 建立 Docker Image 并将 image 放到 ECR 中 AWS CLI 认证 一部分 参考 一篇 文章 图 4 建立 YOLOv4 容器 档案 建立 成功 Amazon Elastic Container Registry ECR 中 建立 容器 映像 档 下图 所示 图 5 建立 容器 映像 档 步骤 2 建立 Amazon SageMaker 端点 专案 中有 create endpoint py 档案 用来 建立 Amazon SageMaker 端点 代码 代码 利用 Amazon SageMaker 笔记 本来 运行 观察 运行 修改 get arguments 方法 指定 端点 名称 容器 映像 档 指定 端点 运行 机型 代码 下图 所示 图 6 建立 Amazon SageMaker 端点 yolov4 gpu 步骤 3 AWS Lambda 中 Amazon SageMaker 端点 呼叫 建立 角色 Lambda 函数 执行 执行 Amazon SageMaker 端点 许可 授权 IAM 管理 控制台 选择 新增 角色 接下来 下图 所示 选择 Lambda 案例 点击 许可 按钮 Attach 许可 政策 中 输入 sagemaker 接着选 AmazonSageMakerFullAccess 政策 确保 角色 透过 AWS Lambda 执行 Amazon SageMaker 端点 图 7 建立 角色 选择 Lambda 案例 AWS Lambda 管理 控制台 选择 建立 Lambda 函数 设定 内容 下图 所示 输入 函数 名称 执行 时间 选择 Python 3.8 执行 角色 务必 选择 划面 中 角色 图 8 建立 Lambda 函数 设定 划面 输入 程序码 所示 bucket image uri 两个 变数 改成 环境 中 值 测试 下图 所示 图片 辨识 0.8 秒 图 9 建立 Lambda 函数 设定 划面 想要 事实上 Amazon SageMaker 端点 建立 实体 之上 实体 计费 EC2 规格 还要 贵 g4dn xlarge 实体 类型 小时 端点 EC2 计价 1.0304 Endpoint ml g4dn xlarge 0.736 per On Demand Linux g4dn xlarge 务必 记得 关闭 Amazon SageMaker 端点 下图 所示 关闭 Amazon SageMaker 笔记本 这也 实体 运行 图 10 关闭 Amazon SageMaker 端点 三个 方案 表 成本 推论 时间 实验 中 得知 系统 在乎 可用性 EC2 内 服务 开发者 自行 建置 会有 维运上 系统 负荷 导致 服务 表 1 EC2 Lambda SageMaker YOLO 辨识 EC2 Lambda SageMaker 成本 USD 0.736 0 1.0304 时间 秒 0.1 秒 60 秒 1 秒 可用性 较差 AWS 托管 AWS 托管 参考资料 yolov4 SageMaker How run a python file inside a aws sagemaker using dockerfile Day 16 影像 辨识 训练 Real time Object Detection API using Amazon SageMaker Amazon API Gateway Call Amazon SageMaker model endpoint using Amazon API Gateway AWS Lambda",
    "Day 35 Amazon SageMaker 简介 中 AWS Lambda 物件 辨识 辨识 时间 长达 一分钟 中 g4dn 类型 EC2 辨识 时间 不到 0.1 秒 差距 太 大 不适 合作 为线 辨识 观赏鱼 试着 AWS 服务 中来 找寻 节省成本 服务 人工智能 AI 云端 AWS 提供 很多 这方面 服务 简列 表 电脑 视觉 – 图像 影片 提供 物体 脸部 识别 图像 中 提取 文字 语音 文字 转换成 语音 则是 录音 档 转换成 文字 语言 利用 NLP 技术 找到 文字 中 意义 相关性 则是 翻译 多种不同 语言 对话 机器人 一项 构建 语音 文字 互动式 对话 应用程序 服务 预测 机器 学习 时间 序列 数据 附加 变量 相结合 构建 预测 推荐 利用 机器 学习 客户 创建 个性化 推荐 服务 图 1 AWS 提供 人工智能 服务 服务 针对 需求 资料 分析 人员 使用者 使用者 打算 建立 机器 学习 模型 并将 部署 云端 AWS 推出 Amazon SageMaker 这项 服务 使用者 需求 AWS 官方网站 Amazon SageMaker 服务 定义 Amazon SageMaker 透过 整合 ML 建置 一组 功能 协助 资料 科学家 开发人员 快速 建置 培训 部署 高品质 机器 学习 ML 模型 下图 Amazon SageMaker 登录 划面 首页 Amazon SageMaker 服务 包含 资料 建置 训练 调整 部署 管理 图 2 Amazon SageMaker 服务 概览 训练 资料 布署 入口 透过 Amazon SageMaker Studio 这是 AWS 2020 年 re invent 推出 适用于 机器 学习 整合式 开发 环境 IDE 使用者 轻松 建立 训练 侦错 部署 监控 机器 学习 模型 专注 开发 机器 学习 模型 非 环境 设置 开发工具 转换 包含 功能 Jupyter 笔记本 中 编写 执行 程序码 建立 训练 机器 学习 模型 部署 模型 监控 模型 预测 性能 调校 改进 机器 学习 模型 成效 Amazon SageMaker Studio Notebooks 操作 平时 常用 Jupyter Notebook Jupyter lab 请 运行 实体 之上 启用 Amazon SageMaker Studio Notebooks 就要 收费 观念 EC2 开着 不用 收钱 下图 2021 10 Amazon SageMaker Studio Notebooks 收费 情形 主机 位于 新加坡 地区 ap southeast 1 机型 ml t2 medium 开 138.77 小时 小时 收费 0.0584 美元 很多 忘 关机 时间 远 少于 138 小时 帐单 来看 分钟 来算 才 会 小数点 权重 档案 放在 Studio Notebooks 中 才 会 第一笔 硬盘 空间 钱 月 1G 使用费 0.168 美元 图 3 Amazon SageMaker Studio Notebooks 收费 接下来 操作 Amazon SageMaker Studio Notebooks 参考 内容 建立 笔记本 执行 个体 操作 笔记本 接下来 这句 话 教学 建立 资源 符合 AWS 免费 方案 资格 请 记得 终止 资源 AWS 将向 帐户 收取 费用 步骤 1 建立 笔记本 执行 个体 Amazon SageMaker 主控台 并在 左边 功能 列中 点击 笔记本 笔记本 执行 个体 右边 主 划面 中 点击 建立 笔记本 执行 个体 下图 所示 图 4 启动 Amazon SageMaker 笔记本 建立 笔记本 执行 个体 页面 笔记本 执行 个体 名称 栏位 中 输入 名称 教学 ithomeSM 做 执行 个体 名称 选择 名称 笔记本 执行 个体 类型 保留 ml t2 medium 预设 IAM 角色 栏位 中 选择 建立 新 角色 建立 IAM 角色 视窗 中 预设值 不需 改变 点击 建立 角色 按钮 Amazon SageMaker 建立 角色 许可 并将 分配 执行 个体 帐户 中 选择 现有 IAM 角色 点击 建立 笔记本 执行 个体 按钮 下图 所示 图 5 建立 笔记本 执行 个体 新建 笔记本 执行 个体 等待 数分钟 才 会 待处理 pending 转换 服务 中 InService 状态 状态 变为 服务 中 选取 ithomeSM 动作 下拉 式 功能表 将其 开启 选择 服务 中 状态 旁 开启 Jupyter 下图 所示 图 6 透过 Jupyter 笔记本 执行 个体 开启 Jupyter 划面 右手边 单击 New 按钮 下拉 选单 选择 conda python3 下图 所示 图 7 透过 Jupyter 笔记本 执行 个体 步骤 2 操作 笔记本 简单 KNN 近临 案例 体验 Amazon SageMaker 笔记本 操作 相 观赏鱼 辨识 模型 操作 将于下 一篇 文章 中 示范 这是 KNN 算法 一组 电影 分类 电影 数据 包含 10 条数 据集 测试 集 2 条数 训练 集 这批 电影 共有 两个 划面 动作 镜 头数 接吻 镜 头数 两个 特征 每部 电影 分类 标籤 值 共有 “ 动作 ” “ 爱情 ” 两个 类别 程序码 运行 图 8 笔记本 执行 个体 中 Jupyter AWS 提供 很多 Amazon SageMaker 笔记本 范例 页 签中 Amazon SageMaker Examples 中 找到 开发者 试着 找到 相关 案例 参考 图 9 Amazon SageMaker 笔记本 范例 集合 参考资料 Amazon SageMaker CreateEndpointConfig AWS Pricing Calculator 建立 训练 部署 机器 学习 模型 Amazon SageMaker",
    "前天 龙 雀斑 公主 音乐 真的 好听 剧情 烘托 的还 不错 网路 分身 题材 时 会 兴趣 作者 搜集 资讯 描述 装置 近期 两个 动漫 86 战区 龙 雀斑 公主 说 知觉 共享 说 日本 很多 很多 技术 玩 很多 碍于 语言 障碍 办法 触及 相关 最新 资讯 86 作者 找 不到 太 讯息 龙 雀 采访 细田守 找 相关 技术 研究 人员 访问 制定 5G 网路 人员 永田 聪 Human Computer Interaction 研究 人员 玉城绘 美 Emi Tamaki 说 更 进阶 VR 视觉 听觉 之外 还要 触觉 模拟 受器 感觉 讯号 电脑 模拟 号 经电 刺激 转给 人体 而玉城 绘美 公司 开发 产品 手部 互动 之外 貌似 虚拟 物体 会 给予 人体 感觉 模拟 产品 连结 发售 我要 先 两个 论文 先 放在 有空",
    "存 文字 档 log 取代 print 解决 网格 分母 部位 过小",
    "Day 34 实作 S3 驱动 Lambda 函数 YOLO 物件 辨识 这是 微 服务 架构 需将 AWS Lambda 函数 改变 成 YOLO 物件 辨识 模型 达成 YOLO 物件 辨识 功能 图 1 S3 驱动 Lambda 函数 YOLO 辨识 架构图 github 找到 专案 非常简单 上传 事先 压缩 darknetmin zip Lambda 函数 中 运行 专案 事实上 是将 事先 LInux 环境 编译 YOLOv3 执行 档 darknet 相关 参数 档 压缩 darknetmin zip 中 流程 所示 实际操作 一遍 下载 程序码 上传 相关 档案 S3 建立 IAM 角色 执行 AWS Lambda 并有 存取 S3 许可 建立 AWS Lambda 函数 修改 布署 程序 测试 步骤 下载 程序码 网站 中 下载 darknetmin zip 下图 所示 图 2 下载 darknetmin zip 步骤 二 上传 YOLO 相关 档案 S3 AWS Lambda 函数 大小 256 MB YOLO 权重 档存 S3 中 给定 数据 集 权重 训练 档案 传到 S3 先前 下载 Lambda 程序码 图片 下图 所示 图 3 上传 YOLO 相关 档案 S3 步骤 三 建立 IAM 角色 建立 IAM 角色 执行 AWS Lambda 并有 存取 S3 许可 IAM 管理 控制台 选择 新增 角色 接下来 下图 所示 选择 Lambda 案例 点击 许可 按钮 图 4 建立 角色 选择 Lambda 案例 搜寻 文字 框中 输入 basic 找到 AWSLambdaBasicExecutionRole 连接 这将 角色 写入 CloudWatch 记录 档 全县 程序 除错 之用 下图 所示 图 5 连接 基础 CloudWatch 除错 许可 政策 先前 设定 后并 输入 角色 名称 建立 角色 下图 所示 图 6 检阅 设定 建立 角色 编辑 新 政策 内容 下图 所示 给定 读取 GetObject 储存 贮体 A 写入 物件 PutObject 权限 PutObjectAcl 储存 贮体 B 图 7 新增 政策 角色 设定 划面 新建 政策 连接 角色 下图 所示 图 8 新增 政策 连接 先前 角色 步骤 四 建立 AWS Lambda 函数 AWS Lambda 管理 控制台 选择 建立 Lambda 函数 设定 内容 下图 所示 执行 时间 务必 选择 Python 3.8 这是 github 专案 执行 角色 记得 选择 步骤 设定 角色 图 9 建立 Lambda 函数 设定 划面 建立 Lambda 函数 自行 撰写 上传 压缩 档 第二个 步骤 中 Lambda 函数 代码 传到 S3 需 函数 设定 主 划面 右边 找到 上传 按钮 点击 选择 Amazon S3 位置 指定 位置 s3 ap southeast 1 amazonaws com darknetmin zip 划面 所示 图 10 建立 Lambda 函数 设定 划面 步骤 五 修改 布署 程序 测试 修改 地方 建 资料集 相关 档案 物件 档 obj data obj names 用来 辨识 物件 名称 组态 档 yolov3 cfg 需将 组态 档 改名 放入 新 组态 档 Lambda 函数 执行 环境 调整 Lambda 函数 本身 需求 调整 建 资料集 相关 档案 相关 三个 档案 纯 文件 档 需 AWS Lambda 操作 划面 中 新增 档案 操作 档案 内容 请 参照 划面 图 11 Lambda 函数 中 新增 建 资料集 相关 档案 Lambda 函数 执行 环境 程序码 页 签中 下方 执行 时间 设定 选项 设定 上图 中 Lambda 函数 函数 点是 service py 执行 时间 设定 中 设定 例程 service handler 划面 图 12 执行 时间 设定 中 设定 例程 组态 页 签中 选择 组态 记忆体 MB 设定 2048 5120 M 逾时 设定 2 分钟 划面 图 13 组态 页 签中 设定 组态 Lambda 函数 本身 修改 指定 权重 档 测试 图片 所在位置 并将 原本 执行命令 改成 darknet detector test cfg obj data cfg yolov3 cfg 才 预设 coco data 标籤 图 14 修改 service py 内容 修改 完毕 布署 Deploy 设定 测试 test 计划 内容 测试 即可 确认 会 约 60 几秒 才 会 影像 辨识 下图 所示 图 15 执行 YOLO Lambda 辨识 功能 输出 整行 输出 复制到 编辑器 中 辨识 下图 所示 图 16 YOLO 辨识 反应速度 批次 即时 反应速度 太慢 找 工具 需求 参考资料 YOLO Lambda Day 15 YOLO 相关 设定 Day 16 影像 辨识 训练 Day 33 实作 S3 驱动 Lambda 函数 镜像",
    "篇 内容 中 资料库 连线 字串 放进 程序码 中 并写 死 常规 程序 开发 中 程序 会 连线 内容 放到 环境 变数 中 程序码 中 这类 帐号密码 程序 放到 很多 环境 时 才能 改动 程序 情况 修正 环境 变数 快 速将 程序 部署 环境 中 环境 变数 整体 电脑 台 电脑 中 透过 修改 变数 部署 同一个 电脑 环境 变数 一同 改掉 这次 会 套件 套件 档案 中 设定 环境 变数 不用 先将 环境 变数 设定 电脑 中 套件 提供 功能 将他 autoload 放在 import init 功能 预设 env 载入 env 放到 gitignore 建立 env example 未来 建立 档案 先 env example 找到 环境 变数 设定 透过 env 档来 设定 操作步骤 git 连结 放在",
    "继 前天 新创 apple id developer 没 付费 状态 好像 personal team 状态 github 找到 先选 计算机 程序 试试看 程序 下载 说 做 做 差别 示范 App 制作 ios13 ios 版本 15 修改 改完 ios 版本 跳出 修正 AppIcon 指示 少 1024x1024 软体 图示 简单 原本 60x60 图示 预览 程序 调整 大小 另存 修正 资料夹 内 contents json 惊叹号 修正 尝试 APP build 进 i7 手机 里 不行 Unable prepare iPhone development Please check connection device review errors Devices Simulators window 手机 iPhone 7 本来 xcode 13 i7 不合 改成 先 simulator i8 i7 都行 app 只能 接口 按键 计算机 没 本来 App 做 接口 样子 几个 怀疑 usbTypeA 母 转 usbTypeC 公 支援 数据传输 这不 有用 转接头 传输 资料 进 随身 碟过 iPhone 7 支援 Simulator 先放着 Xcode 登入 新 apple id 已登记 developer personal team 手机 原本 apple id 改成 新 apple id 才能 写入 手机 ios 15.1 版本 更新 更新 才能 打算 先 手机 apple id 登出 改成 新 apple id 试 这步 不行 会 先 改回 apple id 执行 ios 版本 更新 原本 apple id 新 apple id 各试 ok 结论 apple id 做 3 更动 顺利 APP build 进 手机 打开 程序 尚未 信任 开发者 说 设定 中 APP Apple 官网 教学 指示 操作 手机 里 描述 档 选项 写 VPN 装置 管理 点 进去 信任 就行 补充 本身 手机 教学 安装 developer APP 登入 新创 apple id 做 写 进去 试试看 中途 APP 写 进去 手机 程序 卡住 开机 手机 解决 Bug 幸运 5 会 持续 带来 充满 bug 解决 方式 参考 疯",
    "本来 参考 Nano 脚位 板子 写 程序 内 数字 差 3 号 也就是说 板子 D8 脚位 程序 里要 写 11 这张 图 买 副 厂板 试出来 脚位 板子 digital 脚位 名称 程序 内要 写 数字 应 说 原本 参考 脚位 只能 说 前 几天 试 成功 那次 虾 成功 刚好 插 脚位 囧 附个 副 厂板 说明书 我能 说明书 讯息 能看懂 Pin 13 LED Yellow 纪录 脚 位图 所说 讯号 D13 抓 Bug 板子 灯号 Red Yellow 本来 想 试试看 RX0 TX1 等于 D0 D1 我刚 插上去 RX0 会 面 包板 LED 常亮 板子 4 LED 右边 写 RX 灯号 常亮 TX1 则是 会 面 包板 LED 闪烁 板子 上右 2 LED 会 闪烁 看不出 Blink 成功 先 放弃 搞 究竟 参考 文章 副 厂板 设定 奇怪 买 副 厂板 试出来",
    "Hello iT 邦 帮忙 粉丝 本篇 Re 从零开始 Xamarin 技术 来复 刻过去 开发 App TopStore 系列 文 EP32 本篇 EP32 要来 介绍 EP1 EP21 的双 平台 TopStore App 利用 Xamarin Forms 转换成 接下来 NET 开发技术 中 颇受 瞩目 NET Multi platform App UI MAUI 撰写 方式 唷 要将 Xamarin Forms 转换成 NET MAUI 撰写 几个 需 考量 条件 App 开发 中 利用 Xamarin Forms 第三方 套件 支援 NET 6 MAUI App 成长性 迁移 MAUI 必要性 做 发展 NET 6 微软 接下来 NET 版本 NET MAUI NET 6 正式 释出 2021 11 8 时间 点而 正式 释出 2022 年 Q2 才 机会 正式 释出 兴趣 朋友 参考 时间 点要 Xamarin Forms 专案 迁移 NET MAUI 本篇 介绍 介绍 法 囉 撰写 本篇 EP32 时间 点 来看 最新 释出 或许 捧 友会问 EP1 EP21 EP22 会 这篇 介绍 SQLite 介绍 sqlite net pcl 套件 作者 GitHub 2021 11 13 补充 更新 MAUI 专案 当中 SQLite 微软 官方 伴随 NET 6 释出 EF Core SQLite 参考 文件 微软 文件 Xamarin 当中 EFCore EF Core GitHub EF Core SQLite Nuget 装 Visual Stuido 2022 version 17.0 RC3 Preview 7 版本 理论 记得 透过 Visual Studio Installer 安装 记得 勾选 NET MAUI 元件 安装 Visual Studio 2022 当中 选择 MAUI 专案 范本 新增 专案 专案 范本 中 搜寻 MAUI 建立 MAUI 设定 Visual Studio 2022 建立 MAUI 专案 范本 预设 空白 专案 范本 当中 会 MainPage xaml 预设 页面 TopStore App XAML 放进来 MainPage xaml 删除 删除 完毕 EP21 TopStore App Xamarin Forms 专案 中 程序 复制 csproj App xaml cs AssemblyInfo cs 复制 皆 复选 复制 MAUI 专案 资料夹 当中 贴 贴 档案 总管 呈现 贴 Visaul Studio 2022 方案 总管 呈现 开启 文字 替换 窗格 并将 替换 设定 方案 文字 替换 窗格 中将 xmlns 点选 取代 替换成 xmlns 此次 TopStore App 专案 中 文字 替换 共有 6 替换 文字 替换 窗格 中将 Xamarin Forms Xaml 点选 取代 替换成 Microsoft Maui Controls Xaml 此次 TopStore App 专案 中 文字 替换 共有 4 替换 文字 替换 窗格 中将 Xamarin Forms 点选 取代 替换成 Microsoft Maui Controls 此次 TopStore App 专案 中 文字 替换 共有 13 替换 两个 替换 OrdersPage SettingsPage XAML 标记 当中 Label 标记 设定 Text 显示 文字 记得 改 文字 替换 窗格 中将 Xamarin Essentials 点选 取代 替换成 Microsoft Maui Essentials 此次 TopStore App 专案 中 文字 替换 共有 1 替换 打开 App xaml 原本 ResourceDictionary XAML 标记 内部 包含 XAML 标记 圈选 删除 并贴 原本 TopStore App Xamarin Forms 当中 App xaml 撰写 Resource 补上 其所 需 引用 XAML 命名 空间 Application Resources XAML 标记 撰写 Application MainPage XAML 标记 设计 Shell XAML 标记 打开 AppShell xaml 并将 当中 撰写 TabBar XAML 标记 复制 贴入 刚刚 App xaml 中 设计 Shell XAML 标记 当中 补上 其所 需 引用 XAML 命名 空间 打开 App xaml cs MainPage 指定 MainPage 程序码 移除 原本 AppShell xaml cs 当中 路由 指定 设定 Visual Studio 方案 总管 当中 Assets 资料夹 当中 FontAwesome5 otf 档案 搬移到 Resources 底下 Fonts 资料夹 搬移 没 Assets 资料夹 AppShell xaml 档案 删除 打开 MauiProgram cs 档案 找到 ConfigureFonts 将其 原本 设定 字型 档 换成 TopStore App 当中 所用 FontAwesome5 otf 兼容性 当中 透过 右键 选单 选取 新增 参考 选取 Maui Plugin BaseBindingLibrary dll 先前 透过 Nuget 安装 Xam Plugin BaseBindingLibrary 替换成 Maui Plugin BaseBindingLibrary dll 参考 会 平台 组件 增加 Maui Plugin BaseBindingLibrary 会 发布此 DLL 透过 Nuget 安装 版本 文字 替换 窗格 中将 Xam Plugin 点选 取代 替换成 Maui Plugin 此次 TopStore App 专案 中 文字 替换 共有 2 替换 编辑 会 编译 快取 XAML cs 顺利 整合 作法 关闭 Visual Studio 开启 专案 关闭 Visual Studio 时 记得 储存 变更 再次 开启 TopStore App MAUI 专案 相关 错误 讯息 发生 方案 总管 当中 透过 选取 右键 选单 重建 方案 选项 等待 一段时间 建置 成功 上图 截图 当中 眼尖 捧友 会 Visual Studio Mac 做 连线 MAUI 官方 预设 建置 平台 会 建置 iOS Android macOS Windows 应用程序 iOS Simulator Android Emulator NET MAUI Android 微软 官方 努力 改进 2022 02 13 补充 更新 MAUI Preview 12 当中 已能 显示 List 客 制 化 项目 内容 2022 04 16 补充 更新 MAUI Preview 14 当中 已能 显示 App Title MenuItem 内容 操作 ListView 项目 调整 撰写 XAML 跑 版 macOS MacCatalys Windows 10 参考 文件 Announcing NET MAUI Preview 9 Migrate your app Xamarin Forms Xamarin Essentials 1.7 introducing NET MAUI Essentials",
    "Hexo 架设 Blog 仅仅 几秒钟 时间 细部 调整 时 会 不少 困难 记录 排除 简介 Hexo 主题 做出 个人化 配置 修改 1 启动 本地 服务器 hexo server 时 告警 版本 Hexo 5.4 0 错误 讯息 参考资料 爬 文章 大概 2020 年 相关 资讯 后续 改版 会 修正 不得而知 参考 解决 发生 原因 Hexo 依赖 nib 1.1 2 套件 指定 旧版本 stylus 套件 停止 维护 修改 解决 解决 方式 编辑 package json 专案 设定 档 设定 指定 最新 stylus 版本 执行 指令 yarn install 安装 完 npm install 无效 注意事项 透过 指令 安装 主题 设定 会 复盖 再次出现 告警 再次 执行 yarn install 修复 2 Hexo Github Page 专案 中 档案 共存 Hexo 发布 Github 时会 复盖 掉 专案 目录 想要 放 写 静态 页面 专案 根目录 存放 README md 打造 华丽 页面 参考 会 deploy 动作 盖掉 解决 方式 先 将要 部署 Github 档案 放到 source 资料夹 修改 config yml 设定 档 找到 skip render 字眼 档名 资料夹 名称 3 Hexo 套用 主题 寻找 喜欢 版型 点 进去 发现 连结 失效 就换 范例 页面 主题 Github 连结 本次 Hueman 主题 为例 找到 小猫 图示 顺利 到达 找 文件 Hueman 放在 Github 首页 底下 主题 撰写 摆放 位置 太 找到 安装 方式 主题 放在 首页 写 文件 里 安装 主题 git clone 方式 你将 专案 复制 npm install 方式 安装 文件 写 还要 以下几点 git clone 方法 会 终端机 切换 当前目录 位置 需 看清楚 文件 安装 步骤 额外 设定 请将 文件 完 确保 遗漏 修改 Hexo config yml 设定 档 theme 内容 改成 主题 名称 修改 先 执行 hexo cl && hexo g && hexo s 重建 页面 并启 动 本地 服务器 检查 成功 4 Hexo 个人化 样式 设定 布景 主题 设定 方式 大致 两种 编辑 themes 主题 名称 config yml 档案 git clone 下载 主题 网站 根目录 建置 config 主题 名称 yml 编辑 npm 安装 主题 类型 主题 安装 完 网站 资料夹 新增 档案 套件 放在 node modules 到里面 找到 主题 config yml 档案 复制到 网站 根目录 变更 档名 config 主题 名称 yml 做 修改 本次 介绍 Hueman 主题 开启 themes hueman config yml 档案 修改 修改 方式 参考 颜色 想 改掉 配置 主题 资料夹 搜寻 关键字 variable 会 名称 存放 颜色 单位 样式 Hueman 为例 找到 variables styl 档案 大部分 颜色 更改 版面 配置 想要 做 颜色 调整 搜寻 关键字 style Hueman 为例 找到 style styl 档案 想 设定 样式 具备 自行 撰写 css 能力",
    "摘要 前言 工具 流程 前言 提及 Windows YOLOV4 呼叫 本地 端 GPU 时 出现异常 部署 Colab 训练 免费 Colab GPU 训练 时 训练样本 数量 超过 3000 张 上传 档案 耗费 时间 40 60 分钟 训练 一半 Colab 断线 导致 前功尽弃 变相 样本 数量 近期 参考 网路上 分享 文章 尝试 Windows 编译 Darknet 本地 端 训练 YOLOV4 模型 提高 训练 样本数 模型 训练 效率 YOLOV4 Darknet 环境 部署 时 BUG 频发 整整 踩 2 天 坑 想 一阵 后怕 此次 撰文 分享 YOLOV4 部署 Windows 本地 端 遭遇 解决 方法 做 笔记 下次 部署 时 坑 不想 踩 2 次 工具 更新 显卡 驱动程序 详细 请参阅 Visual stutio 2019 Microsoft Visual C++ 2015 2019 建议 先 安装 Visual stutio 2019 Microsoft Visual C++ 2015 2019 安装 CUDA cuDNN 2.1 下载 请 点击 2.2 安装 点击 安装 Visual stutio 2019 勾选 C++ 桌面开发 CUDA cuDNN CUDA 版本 10.1 cuDNN 版本 7.6 详细 请参阅 OpenCV 版本 4.5 4 4.1 下载 请 点击 4.2 安装 记下 安装 路径 4.3 新增 环境 变数 系统 变数 OpenDIR C Users 88691 Desktop YOLOV4 opencv build Path C Users 88691 Desktop YOLOV4 opencv build x64 vc15 bin Cmake 请 点击 下载 ZED SDK 请 点击 下载 AlexeyAB darknet 请 点击 下载 流程 建立 专案 1.1 开启 Visula Studio 2019 点击 建立 新 专案 1.2 点击 空白 专案 1.3 点击 新增 项目 新增 C++ 档 cpp 供 后续 验证 OpenCV 成功 设定 设定 OpenCV 路径 2.1 点击 左下方 属性 管理员 右键 点击 release X64 点选 新 属性 专案工作 表 2.2 设定 属性 专案工作 表 点击 PropertySheet 开启 属性 → V C++ 目录 → Include 目录 → 新增 3 路径 上图 编号 3 C Users 88691 Desktop YOLOV4 opencv build include C Users 88691 Desktop YOLOV4 opencv build include opencv C Users 88691 Desktop YOLOV4 opencv build include opencv2 V C++ 目录 → 程序库 目录 → 新增 路径 上图 编号 4 C Users 88691 Desktop YOLOV4 opencv build x64 vc15 lib ※ Visula Studio 2015 选择 vc14 Visula Studio 2017 2019 选择 vc15 连结 器 → 输入 → 相依 性 → 新增 路径 opencv world454 lib 验证 OpenCV 启用 将待 验证 图片 放入 Project2 程序码 刚刚 新增 C++ 档 cpp 中 输入 程序码 执行 选取 Release x64 点击 本机 Windows 侦错 工具 成功 显示 影像 2.3 执行 错误 解决 方法 找 不到 opencv world454 lib 新增 系统 环境 变数 C Users 88691 Desktop YOLOV4 opencv build x64 vc15 lib 找 不到 opencv world454 dll 新增 系统 环境 变数 C Users 88691 Desktop YOLOV4 opencv build x64 vc15 bin 编译 Darknet 3.1 AlexeyAB darknet 下载 darknet master zip 解压缩 3.2 开启 Cmake 设定 路径 3.3 点击 ConFigure → 输入 x64 → 点击 finish 3.4 Looking a CUDA compiler – NOTFOUND 解决 方法 确认 改善 时 记得 开启 Cmake Delete Cache 再次 点击 ConFigure → 输入 x64 → 点击 finish 重新安装 先 安装 Visual Stutio 安装 CUDA 控制台 → 新增 移除 程序 → 查看 安装 NVIDIA Tools Extension SDK NVTX 确认 路径 中 4 档案 路径 1 档案 复制到 路径 2 路径 1 C Program Files NVIDIA GPU Computing Toolkit CUDA v10.1 extras visual studio integration MSBuildExtensions 路径 2 C Program Files x86 Microsoft Visual Studio 2019 Community MSBuild Microsoft VC v160 BuildCustomizations 尝试 安装 版本 CUDA 3.5 点击 Generate 产出 新 Darknet sln → Open Project 3.6 生成 解决方案 选取 Release x64 点击 建置 → 建置 方案 3.7 生成 解决方案 时 拒绝 存取 点击 方案 总管 → 点击 鼠标 右键 建置 ALL BUILD INSTALL 3.8 成功 生成 解方 方案 build darknet Release5 中 5 档案 复制到 build darknet x64 执行 Darknet 训练 模型 4.1 事前 按此 下载 解压缩 成 train 资料夹 资料集 放进 train VOCdevkit VOC2021 JPEGImages LabelImg 标记 XML 档 放进 train 底下 VOCdevkit VOC2021 Annotations train 资料夹 移到 C Users 88691 Desktop YOLOV4 darknet master build darknet x64 4.2 执行 gen train val py 分配 训练 集 测试 集 4.3 执行 voc label py datasets 预处理 标记 Train Test Val 资料集 4.4 开启 obj data 路径 修改 成 绝对路径 4.5 开启 cmd 视窗 输入 指令 cd C Users 88691 Desktop YOLOV4 darknet master build darknet x64 4.6 输入 指令 darknet detector train C Users 88691 Desktop YOLOV4 darknet master build darknet x64 train obj data C Users 88691 Desktop YOLOV4 darknet master build darknet x64 train yolov4 tiny myobj cfg C Users 88691 Desktop YOLOV4 darknet master build darknet x64 train yolov4 tiny conv.29 map 4.7 执行 时 错误 解决 方法 找 不到 pthreadVC2 dll 前往 C Users 88691 Desktop YOLOV4 darknet master 3rdparty pthreads bin 复制 pthreadVC2 dll 复制到 C Windows System32 C Windows System64 资料夹 内 找 不到 opencv world454 dll 前往 C Users 88691 Desktop YOLOV4 opencv build x64 vc15 bin 复制 opencv world454 dll 复制到 C Users 88691 Desktop YOLOV4 darknet master build darknet x64 资料夹 4.8 YOLOV4 模型 训练 4.9 模型 预测 程序码 执行 成功 框选 字串 小结 久违 原以 这篇 写到 一半 会 偷懒 搁置 毕竟 Debug 够累 出乎意料 回过 神 写 完 想 参加 铁人 赛 一个月 养成 学习 撰文 分享 习惯 ... 参考资料",
    "试试看 做个 简单 手机游戏 先 build 流程 理顺 再来 开发 这次 参考 Unity Learn 教程 Windows 安装 Unity 基于 MacBook 双系统 错误 mac 双系统 windows10 安装 unity 选择 dev tools android build ios build 没 办法 安装 unity 软体 会 错误 改成 分批 安装 先 安装 android build 再来 ios build 再来 visual studio 成功 0.0 注册 IOS 开发者 前 先 建立 Apple ID 教程 开发者 网页 certificate 拿到 东西 Apple ID Apple ID 开发者 才行 IOS 开发者 开发者 付年费 ... 想 尝试 开发 穷学生 代价 高 还好 好像 免费 开发 方式 条件 Mac 电脑 用到 Xcode 创建 新 Apple ID 混用 走 正规 路 这部 影片 免费 开发 路线 走 走到 Appuploader 时换 走 先 结束 确认 工具 安 方法 接下来 理论 上要 做 事 Windows build ios project project 丢 mac Xcode 编译 ... 一条 路 mac 尝试 想 做 project 光是 iOS APP 编译 上传 手机 中 就要 费功夫 感觉 不想 花 7500 元去 正式 开发 员 .... 参考",
    "先说 mac 双系统 win10 本来 想 mac os 做 下载 说明书 里有 驱动程序 exe 结尾 只好 改用 windows 副 厂板 下载 说明书 下载 IDE 安装 打开 IDE 开发板 选择 Arduino Nano 调整 序列 端口 序列 端口 灰色 我用 说明书 附带 驱动程序 安装 找 序列 端口 上传 空白 程序 失败 尝试 插拔 Nano 关掉 IDE 没 办法 错误 处理器 切换 成 带有 Old Bootloader 上传 LED 亮亮 可惜 遵照 接法 先接 5V 电路 先 LED 杜邦 线 成功 LED 会常亮 范例 程序 Blink 悲伤 插 pin 脚 D8 程序 内写 11 成功 LED 闪烁 诡异 再也 重现 pin 脚 D2 D5 D8 试过 D8 成功 洗掉 成功 期间 插回 5V 确认 电路 运作 .... Sad 11052021 更新 digital 脚位 找到",
    "二元 树 展开 成 linked list 顺序 preorder traversal 三种 traversal 模式 每次 preorder inorder 会 搞混 这题 图片 先 找父 节点 找 子点 每次 模式 记成 inorder 这题 提示 说 写成 O 1 写法 思路 回传 值 void 蒙 cout cout print preorder 顺序 cout 空 阵列 没 概念 想到 O n 解法 创建 linked list 变数 Preorder traversal 一遍 树 巡到 值 塞入 list 中 结束 C++ 笔记 程序码 void 基本上 原本 给的 变数 内容 改成 答案 本来 想想 O 1 解法 睡着 说 O 1 空间 时间 postorder 方式 原本 树 拆解 参考",
    "系列 昨天 流逝 45 天 时间 期间 会 怀疑 写 文章 够不够 所学 知识 好像 拿来 教学 强迫 学习 麻烦 事物 这也 第一次 下定决心 认真对待 某件事 情 接下来 来回 顾 45 天 文章 介绍 系列 前 15 天 介绍 物件 原型 相关 方法 借此 找回 收纳 记忆 藏 宝箱 中 知识 接下来 10 天 打造 专属 函式 库 满意 函式 这是 需求 打造 第一个 函式 系列 20 天 函式 库 范例 当中 想不出 主题 不想 放弃 开赛 前 成熟 学习 更 知识 对待 事情 完 赛后 学习 程序 语言 指标 会 再次 参赛 差不多 尾声 文章 疑问 下方 提问 建议 Felix 下次 再见",
    "接下来 内容 中 会 gorm 接上 postgreSQL 过程 补充 golang 两种 用途 main go 执行 档案 中 会 执行 这段 function main package 中 import package import 前放上 会 执行 内容 log log go main go 输出 会 log message main message",
    "篇 回顾 讲到 会议 很烦 冗长 没 重点 还要 开 几次 不熟 域 连对 认知 落差 讲到 说 故事 听者 快速 了解 流程 讲到 敏捷 宣言 里 鼓励 互动 协作 Cost Change Curve 一篇 讲到 敏捷 开发 宣言 Waterfall TDD Agile 面临 需求 变更 错误 修复 成本 Waterfall TDD 开发 前 先写 Test 设计 开发 软体 Agile Reduce feedback cycle Agile 两种 颜色 Green Red Red 成本 高 作法 文化 习惯 Green 则是 低 成本 透过 Model Storming DDD Domain storytelling event storming other medeling methods ... 减少 设计 需求 梳理 理解 错误 透过 Stackholder 协作 互动 减少 设计 需求 梳理 理解 错误 两个 阶段 提早 发现 及早 Feedback 浪费 后期 才 发现 尽量 消弭 浪费 则能 面对 变化 错误 时 敏捷 But 公司 没 Waterfall 浪费 硬 改变 What Domain DDD 作者 Eric Evan 提出 Domain 定义 A sphere knowledge influence activity The subject area user applies a program domain software 字 sphere Eric Evan 描述 维度 XD 同义字 Domain knowledge influence activity 用户 围绕 三个 主题 范畴 软体 满足用户 用户 执行 软体 支持 满足用户 需求 软体 支持 Domain Storytelling 来说 Waterfall 流程 搭配 文字描述 不难 看得懂 用讲 搭配 划面 播放 XD Domain Storytelling 来说 Stakeholder 参与 协作 流程 差别 先请 规划者 来说 故事 开发者 听 当下 开发者 快速 划出 业务流程 请 规划者 阅读 协作 修正 提倡 提早 认知 规划者 协作 交互 沟通 业务流程 认知 拉其 一种 方法 介入 时机 点 Benefits Telling Storeis Visualize Business Flow Designer 针对 理解 Domain 范畴 一部 份 快速 假设 出 Prototype 验证 Q 开发人员 Domain 刚好 Designer 认知 范畴 一模一样 Q 开发 软体 早点 假设 部份 给具 现化来 讨论 验证 快速 给出 Telling Storeis Visualize Business Flow 好处 懒得 细细 描述 出自 Domain Storytelling 一种 协作 建模 工具 目的 来自 背景 与会 人员 透过 可视化 故事 说 故事 方式 学习 领域 范畴 Pictorgraphic Language 进 书本 第二章 讲 划布 内容 文法 Actor 句子 里的 主词 一群 系统 外部 服务 Work Object 句子 里的 受词 Actor 之间 户通 有无 东西 实体 事物 虚拟 事物 资讯 说 故事 特别 地去 区别 数据 事物 资讯 Activity 句子 内 动词 刚刚 Actor Work Object 名词 方向性 指向 接收 方 Sequence Number 标示 Activity 数字 故事 中会 一堆 句子 数字 用来 故事 里的 句子 顺序 举例 7 号 句子 会 6 号 句子 被讲 废话 废话 数字 了解 前后文 关联 方向 Annotation 想 补充 资讯 Actor WorkOjbect 状态 条件 表达 想讲 写 Activity 想 做 补充 别写 散文 这就 蛮多 元素 类似 Grammar 故事 中 句子 表示法 文法 学习 门槛 低 Avoid Grammar Loopbacks 描述 API User 做出 动作 本来 期望 会 预期 资讯 更 在意 业务流程 Conditional 在划 讲故事 描述 流程 业务 运作 方式 Domain Storytelling User Story 做 产品 会 UserStory 描述 需求 快速 讲 转换 语法 Domain storytelling 慢慢 拆解 映射 User story mapping 实战 工作坊 合适 讲解 Domain Storytelling 转换 Pictorgraphic Language User Story 大致 上到 Domain Storytelling 故事 讲完 软体 设计 想 才 疑惑 流程 大概 故事 流程 中 针对 角色 流程 方向 事物 用途 设计 出 边界 边界 Zoom In 分析 讨论 也许 分工 各组 讨论 尝试 界 场景 内 找出 sub domain aggregate 再来 小组 玩 User Story Mapping 找出 价值 优先权 高 story 拆分 出 task 再来 各组 搭配 Example mapping 规格 Rule 规格书 会给 假设 出 情境 给出 期望 答案 展开 内容 做 整合 测试 UnitTest Gherkin 语法 还能 转成 BDD 测试 案例 OO Analysis Design OOAD 拆成 Analysis Design OOA 辨识 What do OOD 辨识 出要 做 How do 流程 雷同 Divide Conquer 持续 repeat 细化 精化 ProblemSpace 拆解 梳理 过程 Project 投射 Requirement Layer 开发者 最爱 谈 分层 设计 梳理 分析 再来 投射 Design 设计 设计 规格书 TableSchema UI 写扣 投射 Implement 布署 发布 一层 验收 条件 上线 QA 背锅 XD 工作 快 10 年 合作 不少 PM SA 说 很会 做 软体 设计 没 UML 图 做 分析 设计 UI Prototype Table Schema 数十页 文字 档 月 工时 估算 每次 开会 我问 各层 验收 条件 傻 住 讲不 QQ 当下 回应 内容 这次 系统 没 CRUD 日后 QA 跑 去问 测试 案例 常 回答 没 办法 划面 资料库 推断出 流程 当初 设计 没 给写 视觉 化 日后 问时 会 忘 XD ... 真的 开发人员 脑补 XD QA 暗 只好 慢慢 探索性 测试 真有 公司 子 跑 流程 嘴里 喊 敏捷 会 困惑 QQ 无形中 一堆 浪费 没 改善 想 压榨 时间 公司 软体 系统 设计 Table Schema API Doc PM SA 写 开发人员 真的 按表操 课 新 同事 前辈 后辈 只能 脑补 文件 想像 右 半边 图 OOAD 流程 懒得 细说 没 验收 条件 假 QQ 责任 QA 使用者 抛 有人 常讲 以终 为始 角度 解读 这句 有人 User 想 有人 资料 流在 想 身为 开发人员 更 喜欢 以中 为始 那层 业务 逻辑 变得 这的 业务流程 真的 变 资料库 变动 API 协议 变动 划面 变动 影响 业务 外部环境 领域 业务 外部环境 影响 影响 测试 保护 这层 只讲 UI TableSchema 难怪 公司 没 写 测试 开发 团队 问 测试 资料库 里阿 CRUD 只讲 UI TableSchema 开会 时 争执 细节 XD More Thinking Reference ps Domain Storytelling 浅显易懂 好书 读书会 开团 跑 工作坊 QQ",
    "挑战 铁人 赛 读者 疑问 关闭 浏览器 时 发出 警告 阻止 浏览器 关闭 原本 写 文章 付诸流水 明白 毕竟 经历 切身 之痛 不止一次 下方 储存 草稿 功能 总 完 字 按钮 我花 五分钟 思考 终于 想出 解决办法 主题 离开 网页 时 自动 发出 警告 主题 程序码 实测 范例 连结 制作 中 差不多 尾声 文章 疑问 下方 提问 建议 Felix 明天 再见",
    "空置 两个 礼拜 我要 延毕 说 说 延毕 世界末日 接受 说法 希望 废物 快点 出 社会 思路 说 反转 一个二元 树 看起来 像是 本来 Preorder 这棵树 数值 会 由小到大 答案 Preorder 会 由大到 回传 树 root 乍一看 想 说 感觉 拜访 左 child 右 child 想想 感觉 乱 盯 着树 感觉 试试 点的 link child 交换 child 为止 程序码 说 开心 刷 图论 题目 第二 直觉 解法 这题 简单 参考",
    "前 阵子 升级 作业系统 Big sur 失败 导致 重灌 那种 资料 救 回来 那种 懒人 论文 资料 留 备份 一律 备份 近期 备份 空间 全数 吃掉 无奈 之下 才 备份 全数 删除 掉 本来 想 说 没 衰 ... 弄成 双系统 Big sur 也给 信心 Big sur 双系统 超 轻松 需用 随身 碟 会试 windows 作业系统 unity unreal 说 Mac 不好 至少 真的 喜欢 萤幕 喇叭 也许 硬体 两种 作业系统 切换 挺 会 简单 简单 更新 纪录 尝试 时 心得 碰到 状况",
    "新增 订单 callback 计算 交割 金 功能 这部分 整合 进 机器人 跑 两支 交易 机器人 跑 两支 机器人 会 机器人 记录 交易 纪录 帐户 交割 金",
    "本书 听到 协作 方法 书本 第一章 讲到 Telling stories 好处 将前 两 章节 内容 做成 投 影片 简单 部门 分享 这几天来 文字 形式 分享 前言 常见 会议 情况 情境 1 专案 产品 Kickoff 时 会议 报告 形式 讨论 价值 时间 很少 浪费 掉 会 没 结论 方式 说 下次 会议 情境 2 会议 中 有人 报告 时 很多 报告 内容 解决 很多 领域 专有名词 情境 3 会议 对着 划面 操作 动线 争论 针对 细节 做 讨论 有的则 会议 讨论 资料库 表格 设计 分析 见解 情境 1 会议 听 PM 企划 划面 草稿 行销 手段 介绍 也许 创新 产品 没 针对 既有 需求 划面 草稿 行销 企划 很难 与会 人员 理解 完整 域 相关 业务流程 情境 2 与会 人员 理解 完整 域 相关 业务流程 背景 专长 常见 状况 人讲 讲会 讲到 API Table ... 与会 人员 一半 管理 企划 行销 在讲 情境 3 针对 细节 展开 争执 这是 认知 理解 程度 自然而然 想像出来 萧煌奇 眼 眼前 黑 黑 说 白 白 说 天空 蓝 记忆 中 那团 白云 背后 蓝天 书上 第一篇 讲到 观点 conversations cannot adeqquately replaced written formal specifications attempts do so even widened gap between business software development 交谈 沟通 取代 书写 正式 规范 只靠 交谈 沟通 只会 业务 软体 开发人员 之间 gap 更深 consider software development approaches like agile Domain Drivent Design BDD these philosophies foucs feedback stackeholder involvement nevertheless making great bussiness software hard but rarely because technical problems because software developers need understand how day day busniess operates they need become domain experts themselves whole domain but least part they build software 像是 Agile DDD BDD 更 鼓励 回馈 stackholder 参与 构建 出 商业 服务 颇 难 难 部份 技术 更 业务 开发人员 了解 日常 业务 运作 方式 试图 负责 部份 领域专家 书上 引述 一段 ' s developers mis understanding expert knowledge gets released production 发布 软体 认知 开发人员 理解 误解 领域 专业知识 讲 白话 点 开发人员 规格书 理解 分析 加上 书上 这段 论点 沟通 协作 更 有效率 讨论 领域 认知 快速 建立 认知 这时候 说书人 说 故事 简单 成效 方法 说 故事 前 召集 会议 日常 还蛮 活动 会议 形式 展开 类似 小团体 围成 圈 讨论 形式 像是 Campfires 营火 够大 圈 营火 圈 少点 营火 则是 目光 聚集 对象 这类 活动 会 主持人 说书人 旁边 讲述 事情 形式 很快 融入 上图 主持人 做起 动作 聚焦 主持人 身上 事情 一堆 才能 带动 做出 动作 想 不必 上图 这张 想 营火 聚会 聚集 来自 背景 肤色 性别 愉悦 沟通 讨论 凡事 总有 But 开会 老板 想要 听到 结论 But 开会 形式 有效率 会议 中 结论 我想给 台词 大多 长官 会后 招开 会议 讨论 下次 结论 这另开 会议 开发 团队 天时 程 ... 开发 团队 业务 之间 gap 依然 时间 经验 消弭 搞不好 下次 长官 想法 稍微 变化 顺序 重复 Loop 回到 情境 1 结论 ... 开发 团队 X 只会 时程 做 业务 单位 x 开发 团队 能力 给了 厚厚的 文件 每次 做错 Campfires 示意 描述 开发 团队 Stakeholder 业务 单位 聚在一起 请 Stakeholder 业务 单位 说 故事 方式 开发 团队 接触 真实 客户 无访 反正 业务 单位 视窗 Story Telling 说 故事 总 有人 说书 小明 进到 市场 低于 1 斤 20 橘子 则买 一斤 吐司 特价 则买 一条 三 英打 吕布 关羽 挡住 吕布 刺击 张飞 刘备 则从 砍击 描述 事实 描述 事实 顺序 正好 业务 顺序 时间 线上 关系 小明 进到 市场 冬季 快 关门 买 1 斤 18 橘子 买 一条 特价 吐司 虎牢关 三英 吕布 关羽 挡住 吕布 刺击 张飞 刘备 发现 吕步 侧门 大开 立刻 砍击 扯 一堆 干话 没 讲到 讨论 是举 论点 来讲 干话 敏捷 开发 宣言 里说 Individuals interactions over processes tools Working software over comprehensive documentation Customer collaboration over contract negotiation Responding change over following a plan Individuals interactions over processes tools 成员 互动 比起 工具 做 抽象 流程 这的 指 效率 呼应 主题 讨论 Customer collaboration over contract negotiation 客户 协作 讨论 比起 文件 合约 协商 想 转个 角度 想 成 传统 SA PM 文件 公司 希望 到位 等到 文件 写 符合 客户 需 大概 来来回回 数次 修改 协商 确认 版本 没 说 这不 来来回回 找 客户 当场 确认 修改 会 简易 讨论 宣言 发现 成员 互动 客户 协作 讨论 想必 会 省去 初期 投入 一堆 时间 写 文件 邀请 Domain expert 开发人员 讲解 故事 这张 图 想 表达 说 故事 方式 传达 业务 领域 知识 比起 一堆 流程图 传达 更为 简单 懂 不费 太 功夫 文件 补上 事后 追加 进去 先 开发人员 理解 足以 理解 贴合 业务流程 所需 一篇 写 Domain Storytelling 这方 法 工具",
    "实作 输入 网址 RSS 阅读器 主题 程序码 实测 范例 连结 制作 中 差不多 尾声 文章 疑问 下方 提问 建议 Felix 明天 再见",
    "习惯性 地点 一杯 手摇 饮 咖啡 喝完 杯子 ... 喝 饮料 装 友 A 外带 饮料 装 友 B 杯子 嘞 友 A 哪种 杯 友 B 店家 提供 杯子 友 A 喝完 杯子 友 B ... 垃圾桶 回收 桶 友 A 喔 ... 有没有 更好 做法 友 B 自备 环保 杯 友 A 听 不错 没带 环保 杯 出门 友 B 只能 店家 杯子 ... 日常 看起来 平凡 无所谓 对话 ... 却是 成为 环境 刽子手 大自然 轻易 分解 消化 掉 杯子 ... 有个 提供 循环 杯 平台 服务 ... 店家 提供 租借 杯子 使用者 完后将 杯子 放 回 归还 站 回收 杯子 清洗 提供 店家 续用 会 提供 循环 杯 平台 平台 服务区 台湾 台北 新竹 台 中 台南 借用 Line QRcode 提供 型态 借 杯杯 店铺 借杯 自助 借杯机 爱 地球 外送 杯杯 店铺 还杯 自助 归还 站 业者 开发 宣传 平台 FB Line google 表单 Notion Figma 平台 服务区 台湾 台北 台大 校区 周边 店家 借用 Line QRcode 台大 学生证 提供 型态 借用 方式 借用 学生 社团 借用 公司 行号 借用 还杯 方式 店家 还杯 甲 店租 乙店还 集点 换物 活动 平台 服务区 欧盟 北美 借用 戴 Android IOS APP 提供 型态 借用 方式 店家 借用 外送 平台 还杯 方式 自助 归还 站 预约 到府 收杯 平台 服务区 德国 借用 戴 Android IOS APP 提供 型态 借用 方式 客户 需先 支付 押金 返回 杯后可 退金 换杯 店家 借用 还杯 方式 店家 还杯 甲 店租 乙店还 缔造 连结 ✣ 资讯 ⚙ ︎ 参考资料",
    "昨天 表 格式 表单 新增 资料 列 输出 JSON 格式 主题 样式 程序码 实测 范例 连结 制作 中 差不多 尾声 文章 疑问 下方 提问 建议 Felix 明天 再见",
    "Always keep your hand level your eyes 脑中 浮现 一句 话 歌剧 魅影 中 一位 教 舞蹈 夫人 提醒 着众 魅影 绳索 袭击 养成 文化 人才 参与 工程 团队 深刻 体会 沉住气 才 出手 失准 体会 决策 慢 执行 快 参杂 担心 毁于一旦 心 会 节奏 过慢 产品 经理 承上 启下 开左闢 右 角色 慢 拿捏 度 会 转离 团队 会 团队 转离 方向 警戒 节奏 决策 慢 执行 快 状态 难言 喻 或许 更 合适 说法 决策 稳 心中 会 节拍器 稳定 节奏 突发事件 转瞬间 调整 步调 希望 表现 受 主管 给予 波动 加上 情绪 敏感 现象 会 昨天 发生 事件 主管 讨论 过程 之中 别扭 提出 抛出 想法 拉长 收集 讯息 区间 才 主管 达成 共识 过程 来说 新 表现 尝试 习惯性 会 抛出 想法 更 难听 一点 表述 过程 之中 呈现 自我中心 会 话题 嵌入 好听 一点 乐于 分享 缺少 引导 倾听 难 关键点 执行 会 难 正中 红心 难怪 工具书 会 问个 警戒 不符 目标 小看 错误 会 公司 马上 损失 持续 伤害 文化 错误 解读 原因 历史 老师 拍桌 故事 用力 拍 桌 没 机会 问 缘由 幸好 工程 团队 还小 推动 高等级 工程 团队 经验 还在 历练 一对一 工程师 深聊 庞大 团队 真的 会 发生 伤害 损及 团队 文化 累积 就会 文化 毒瘤 这是 很大 学习 差点 就让 动能 强 特质 工程师 缓慢 忙碌 身为 产品 经理 心中 永远 记得 目标 商业 效益 目标 团队 文化 目标 越想 越 团队 才 机会 目标 靠拢 我要 加油 内 化成 直觉 Always keep your hand level your eyes 状况 套索 抛掷 来时 才能 开启",
    "实作 新增 删除 资料 列 主题 样式 程序码 实测 范例 连结 制作 中 差不多 尾声 文章 疑问 下方 提问 建议 Felix 明天 再见",
    "铁人 赛后 一下子 放松 FIGHT 人员 技术人员 法规 技术 面 分类 提要 网路 架构 检视 端点 防护 开发 防护 基准 盘点 清查 检测 扫描 盘点 文件 清查 旧 系统 帐号 安全性 检测 弱点 扫描 渗透 测试 资通 健诊 安全性 检测 目的 清查 系统 弱点 威胁 试图 找出 并对 修补 实施 简单 利用 软体 工具 弱点 扫描 渗透 测试 即可 困难 地方 在于 事后 报告 弱点 修补 建议 工具 选择 多多 一套 判读 拥有 低 误判 率 技术人员 建议 越早 阶段性 扫描 提早 发现 弱点 加速 修补 过程 弱点 扫描 分为 主机 应用程序 网页 找出 已知 弱点 广义 来说 会 影响 资产 价值 机密性 完整性 可用性 可称 弱点 执行 工具 则以 CVE 资料库 比对 项目 风险 等级分 高 中 低 核心 资通 系统 会 至少 修补 高 中 风险 主机 弱点 扫描 工具 AP 网页 弱点 扫描 工具 Acunetix Web Application Security Scanner 试用版 AppScan 渗透 工具 留在 一篇 ... 参考 资源",
    "实作 非 同步 请求 上传 进度条 主题 程序码 实测 范例 连结 制作 中 差不多 尾声 文章 疑问 下方 提问 建议 Felix 明天 再见",
    "实作 向下 滚动 网页 时 自动隐藏 页 手 导览 列 效果 主题 样式 程序码 实测 范例 连结 制作 中 差不多 尾声 文章 疑问 下方 提问 建议 Felix 明天 再见",
    "完美 办到 事 多难 次次 达标 件 好事 完美 Scope 定义 情况 才能 机会 愿景 想要 会 到处 充满 未知 到处 充斥 挑战 能将 功能 完美 开发 背后 付出 努力 大 做 有时候 脚步 就会慢 event 快速 学习 加快 经验 累积 子弹 飞 一会儿 是从 技术 脱口而出 却是 几天 着墨 一句 话 急着 想要 成果 步调 急躁 耐性 沉住气 去年 主管 讨论 过程 中 会 想着 没 办到 稍 目标 追 会 不耐烦 会 想要 赶着 羊群 找 简单 直觉 做法 羊 想当然 会 反扑 远离 会 急躁 想 恐惧 恐惧 达标 恐惧 失败 恐惧 失控 至少 想 时机 点 感受 慢 或许 花 心思 展开 雷达 收集 讯息 加上 主管 给予 空间 心中 中心思想 错误 中 快速 学习 记住 慢 感觉 规划 慢 执行 快 Event 价值 event 马上 拿捏 原则 就要 当下 观察 则是 放着 发酵 时机 event 做 上周 所待 IT 团队 继 第一次 成功 迎来 第二次 成功 第一次 失败 本来 担心 Retro 会 偏离 轨道 幸运地 前一天 接连 event 机会 体现 Event 看法 爱 event 过于 失控 冲击 团队 主 核心 在意 event 所在 意 是从 event 中 萃取 出 一步 更好 周五 经历 一场 略微 成功 retro 失败 better 成功 会议 过程 中 接受 失败 显得 气馁 卸责 或咎责 气氛 有要 目标 团队 责任 希望 更好 这还蛮 鼓舞 期待 event 真的 会 变更 订下 这周作 雪耻 希望 一切顺利"
]